{"articles": [{"title": "New equipment to slash open‐heart surgery backlog", "url": "https://www.heraldonline.co.zw/new-equipment-to-slash-open-heart-surgery-backlog/", "description": "Rumbidzayi Zinyuke Senior Health Reporter ZIMBABWE is poised to significantly reduce its open-heart surgery backlog following the installation of a state-of-the-art heart-lung machine at Parirenyatwa Group of Hospitals, bringing relief...The post New equipment to slash open‐heart surgery backlog appeared first on herald.", "content": "ONLY AVAILABLE IN PAID PLANS", "image": null, "source": {"name": "The Herald"}, "publishedAt": "2026-02-17 22:18:34"}, {"title": "India T20 World Cup 2026 Super 8 fixtures: Full schedule, dates and venues", "url": "https://sports.yahoo.com/articles/india-t20-world-cup-2026-221600870.html", "description": "India secured their Super Eight berth in the T20 World Cup with a dominant victory over Pakistan. This marked their third consecutive win, confirming their place in Group 1. India's campaign included convincing wins against the USA and Namibia, showcasing strong batting and bowling performances.", "content": "ONLY AVAILABLE IN PAID PLANS", "image": "https://s.yimg.com/ny/api/res/1.2/NtA5kkD.3LM4Xo2HXd1euQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/willow_sports_articles_673/6cad1ab50ec915ede5e5ba124d018bfe", "source": {"name": "Yahoo! News"}, "publishedAt": "2026-02-17 22:16:00"}, {"title": "Zimbabwe’s Circular Opportunity: Retaining Value in a Resource-Constrained Economy", "url": "https://thezimbabwemail.com/zimbabwes-circular-opportunity-retaining-value-in-a-resource-constrained-economy/", "description": "Zimbabwe’s economic narrative is frequently dominated by familiar themes: currency instability, constrained liquidity, deindustrialisation, and capital scarcity. Yet beneath these visible pressures lies a quieter structural challenge that receives far less attention, the persistent erosion of value. Raw materials leave the economy with limited downstream beneficiation, finished goods are imported at high cost, products are [...]The post Zimbabwe’s Circular Opportunity: Retaining Value in a Resource-Constrained Economy appeared first on The Zimbabwe Mail.", "content": "ONLY AVAILABLE IN PAID PLANS", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/02/Zero-Waste-Zimbabwe.png", "source": {"name": "The Zimbabwe Mail"}, "publishedAt": "2026-02-17 22:12:33"}, {"title": "AIRBNB OWNERS ORDERED TO REGISTER, OR FACE CLOSURE", "url": "https://www.heraldonline.co.zw/airbnb-owners-ordered-to-register-or-face-closure/", "description": "Latwell Nyangu OPERATORS of Airbnb, the majority of whom have been operating without compliance, have been given until February 28 to register with the Zimbabwe Tourism Authority (ZTA) or face...The post AIRBNB OWNERS ORDERED TO REGISTER, OR FACE CLOSURE appeared first on herald.", "content": "ONLY AVAILABLE IN PAID PLANS", "image": null, "source": {"name": "The Herald"}, "publishedAt": "2026-02-17 22:09:58"}, {"title": "Magaya seeks removal of ‘Makandiwa prosecutor’", "url": "https://thezimbabwemail.com/magaya-seeks-removal-of-makandiwa-prosecutor/", "description": "HARARE – Founder of Prophetic Healing and Deliverance Ministries, Walter Magaya, has formally requested the removal of a senior official from the National Prosecuting Authority of Zimbabwe (NPA) from handling his ongoing rape trial, alleging bias, personal animosity and conflict of interest. In an urgent letter dated February 17, 2026, Magaya’s lawyers, Rubaya and Chatambudza [...]The post Magaya seeks removal of ‘Makandiwa prosecutor’ appeared first on The Zimbabwe Mail.", "content": "ONLY AVAILABLE IN PAID PLANS", "image": "https://thezimbabwemail.com/wp-content/uploads/2025/11/Walter-Magaya-34.jpeg", "source": {"name": "The Zimbabwe Mail"}, "publishedAt": "2026-02-17 21:45:36"}, {"title": "High Court dismiss Mzembi Discharge Application", "url": "https://thezimbabwemail.com/high-court-dismiss-mzembi-discharge-application/", "description": "The High Court of Zimbabwe has dismissed former Tourism and Hospitality Minister Walter Mzembi’s application for discharge at the close of the State’s case, ruling that a prima facie case has been established against him. Mzembi, who is facing charges of abuse of office, is accused of donating Government-owned public viewing screens valued at approximately [...]The post High Court dismiss Mzembi Discharge Application appeared first on The Zimbabwe Mail.", "content": "ONLY AVAILABLE IN PAID PLANS", "image": "https://thezimbabwemail.com/wp-content/uploads/2025/09/Walter-Mzembi.jpeg", "source": {"name": "The Zimbabwe Mail"}, "publishedAt": "2026-02-17 21:37:29"}, {"title": "Zimbabwe doctors perform landmark open-heart surgery", "url": "https://thezimbabwemail.com/zimbabwe-doctors-perform-landmark-open-heart-surgery/", "description": "Doctors at Parirenyatwa Group of Hospitals have successfully carried out an open-heart surgery using a newly acquired heart-lung machine for the first time, marking a significant boost to Zimbabwe’s public cardiac care capacity. The milestone procedure was conducted on Tuesday in Harare as the hospital commissioned the state-of-the-art bypass machine, procured by the Government. Before [...]The post Zimbabwe doctors perform landmark open-heart surgery appeared first on The Zimbabwe Mail.", "content": "ONLY AVAILABLE IN PAID PLANS", "image": "https://thezimbabwemail.com/wp-content/uploads/2025/11/Parirenyatwa-Hospital.jpg", "source": {"name": "The Zimbabwe Mail"}, "publishedAt": "2026-02-17 21:33:40"}, {"title": "EU lifts all sanctions on Zimbabwe, extends arms embargo", "url": "https://thezimbabwemail.com/eu-lifts-all-sanctions-on-zimbabwe-extends-arms-embargo/", "description": "The European Union has concluded its annual review of restrictive measures relating to Zimbabwe, deciding to extend the existing arms embargo for another year while lifting provisions tied to potential travel bans and asset freezes. In a decision adopted by the Council of the European Union, the bloc extended the arms embargo until 20 February [...]The post EU lifts all sanctions on Zimbabwe, extends arms embargo appeared first on The Zimbabwe Mail.", "content": "ONLY AVAILABLE IN PAID PLANS", "image": "https://thezimbabwemail.com/wp-content/uploads/2025/09/European-Union-EU.png", "source": {"name": "The Zimbabwe Mail"}, "publishedAt": "2026-02-17 21:29:25"}, {"title": "T20 World Cup | For South Africa, the real challenge starts in the Super Eight stage", "url": "https://www.thehindu.com/sport/cricket/t20-world-cup-for-south-africa-the-real-challenge-starts-in-the-super-eight-stage/article70642740.ece", "description": "At the start of the T20 World Cup, there was consensus that Aiden Markram and Co. were in the toughest of the four groups", "content": "ONLY AVAILABLE IN PAID PLANS", "image": "https://th-i.thgim.com/public/incoming/l6n1d8/article70644938.ece/alternates/LANDSCAPE_1200/_SKP1403.jpg", "source": {"name": "The Hindu"}, "publishedAt": "2026-02-17 21:28:34"}, {"title": "Rain ends Australia and Ireland’s T20 WC hopes", "url": "https://www.qatar-tribune.com/article/220085/sports/rain-ends-australia-and-irelands-t20-wc-hopes", "description": "AgenciesIreland and Australia have both been eliminated from the T20 World Cup as rain prevented play in the Group B game between the Irish and Zimbabwe at Pallekele Cricket Stadiu...", "content": "ONLY AVAILABLE IN PAID PLANS", "image": "https://www.qatar-tribune.com/watanqatartribune/uploads/images/2026/02/18/342944.jpg", "source": {"name": "Qatar Tribune"}, "publishedAt": "2026-02-17 21:26:00"}]}