{"articles": [{"title": "Rising anger over ‘lop-sided’ and ‘immoral’ US health funding pacts with African countries", "description": "Zimbabwe refuses to sign agreement and Kenya faces a court case over data sharing as new aid deals come under scrutiny", "url": "https://www.theguardian.com/global-development/2026/feb/27/rising-anger-over-lop-sided-immoral-us-health-funding-pacts-africa-countries", "image": "https://media.guim.co.uk/052f71618f81a5e32d654d7d911f9002cd98f9e0/967_502_3452_2762/500.jpg", "publishedAt": "2026-02-27T07:00:34Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "Zimbabwean breakout at T20 World Cup has fans rejoicing renaissance", "description": "Swelling fanbase has been in dreamland this past month as Zimbabwe have defied all expectations in the competition", "url": "https://www.theguardian.com/sport/2026/feb/25/zimbabwe-breakout-cricket-world-cup-supporters-rejoicing-renaissance", "image": "https://media.guim.co.uk/57170b6bfd404a0e029eb92825e336f3452038e3/183_0_1827_1462/500.jpg", "publishedAt": "2026-02-25T10:05:15Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "Zimbabwe rejects 'lopsided' US health aid deal over data concerns", "description": "Access to biological samples raised flags for Zimbabwe as the US did not want to share the benefits of its research.", "url": "https://www.bbc.com/news/articles/cwy6nd3664no", "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6ada/live/d161dbc0-1249-11f1-b048-c9424b2cf5fd.jpg", "publishedAt": "2026-02-25 13:39:40", "source": "The Bbc", "_source_api": "Newsdata.io"}], "more": [{"title": "How the Skeleton of Mutapa Times is Based on Sarah Charlesworth's Work", "description": "Conceptual artist Sarah Charlesworth's 1979 study of how newspapers covered a solar eclipse inspired the framework behind The Mutapa Times.", "url": "article.html?slug=2020-04-20-how-the-skeleton-of-mutapa-times-is-based-on-sarah-charlesworths-work", "image": "/img/uploads/imageedit_1_5381951801.jpg", "publishedAt": "2020-04-20T00:00:00.000Z", "source": "The Mutapa Times", "cms": true}, {"title": "Zimbabweans lured to Russia’s War: Inside the deceptive recruitment network drawing civilians to the frontlines", "description": "A growing network of recruiters operating in Zimbabwe and across southern Africa is drawing young men into Russia’s war in Ukraine through promises of civilian jobs and financial security, only for ‘many’ to find themselves on an active, deadly frontline war zone after minimal training.", "url": "https://www.thezimbabwean.co/2026/02/zimbabweans-lured-to-russias-war-inside-the-deceptive-recruitment-network-drawing-civilians-to-the-frontlines/", "image": "https://cite.org.zw/wp-content/uploads/2026/02/russia-war.jpeg", "publishedAt": "2026-02-27 21:10:19", "source": "The Zimbabwean", "_source_api": "Newsdata.io"}, {"title": "Why pretend to invite public views on proposed constitutional amendments when the same public is barred from discussing them?", "description": "Source: Why pretend to invite public views on proposed constitutional amendments when the same public is barred from discussing them? Why pretend to invite public views on proposed constitutional amendments when the same public is barred from discussing them? This is a cynical game of smoke and mirrors we have all become too familiar with. [...]The post Why pretend to invite public views on proposed constitutional amendments when the same public is barred from discussing them? appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/why-pretend-to-invite-public-views-on-proposed-constitutional-amendments-when-the-same-public-is-barred-from-discussing-them/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/watermarked-9d28ecb2-a37c-4f07-82dd-319b2a9f1294-17.jpg", "publishedAt": "2026-02-27 21:06:50", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Why are we no longer taking responsibility for our actions but choosing to blame others for the consequences?", "description": "Source: Why are we no longer taking responsibility for our actions but choosing to blame others for the consequences? The spectacle currently unfolding in a Los Angeles courtroom—where a twenty-year-old woman named Kaley G.M. sits as the face of a massive litigation effort against tech giants—is more than just a legal battle over algorithms. If [...]The post Why are we no longer taking responsibility for our actions but choosing to blame others for the consequences? appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/why-are-we-no-longer-taking-responsibility-for-our-actions-but-choosing-to-blame-others-for-the-consequences/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/file_000000008604722f8990ffbee81b35d8-19.png", "publishedAt": "2026-02-27 21:00:01", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Church leaders condemn amendment bill as threat to constitutional integrity", "description": "Church leaders have declared their firm opposition to the proposed Constitution of Zimbabwe (Amendment) Bill No. 3 of 2026, warning that the changes would fundamentally alter the spirit of the country’s people-driven 2013 Constitution and risk concentrating power at the expense of citizens’ voices.", "url": "https://www.thezimbabwean.co/2026/02/church-leaders-condemn-amendment-bill-as-threat-to-constitutional-integrity/", "image": "https://cite.org.zw/wp-content/uploads/2021/06/MNANGAGWA.jpeg", "publishedAt": "2026-02-27 20:59:30", "source": "The Zimbabwean", "_source_api": "Newsdata.io"}, {"title": "BCC commissions $1m road equipment", "description": "Source: BCC commissions $1m road equipment – CITEZW The Bulawayo City Council (BCC) has commissioned road construction and maintenance equipment worth more than US$1m, in a move aimed at strengthening its ability to rehabilitate the city’s deteriorating road network using in-house teams. Speaking at the ceremony on Friday, Mayor David Coltart described the development as [...]The post BCC commissions $1m road equipment appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/bcc-commissions-1m-road-equipment/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/IMG_20260227_100605-1200x900-1.jpg", "publishedAt": "2026-02-27 20:55:39", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "RBZ Unveils New ZiG Banknotes To Circulate From 7 April", "description": "Source: RBZ Unveils New ZiG Banknotes To Circulate From 7 April ⋆ Pindula News The Reserve Bank of Zimbabwe (RBZ) has unveiled a new series of Zimbabwe Gold (ZiG) banknotes, set to enter circulation on 7 April 2026. The new notes will circulate alongside the existing series introduced in April 2024. Speaking during the 2026 [...]The post RBZ Unveils New ZiG Banknotes To Circulate From 7 April appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/rbz-unveils-new-zig-banknotes-to-circulate-from-7-april/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/John-Mushayavanhu-New-ZiG-Banknotes.jpg", "publishedAt": "2026-02-27 20:52:55", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "RBZ Orders Removal Of Account Balance Inquiry, Cash Deposit Charges", "description": "The Reserve Bank of Zimbabwe (RBZ) has taken steps to curb excessive cash withdrawal and point-of-sale (POS) charges imposed by financial institutions.", "url": "https://www.thezimbabwean.co/2026/02/rbz-orders-removal-of-account-balance-inquiry-cash-deposit-charges/", "image": "https://t792ae.c2.acecdn.net/wp-content/uploads/2021/04/EcoCash-Mobile-Phone.jpg", "publishedAt": "2026-02-27 20:50:12", "source": "The Zimbabwean", "_source_api": "Newsdata.io"}, {"title": "Constitution Amendment: Zimbabwe Churches Objects to Mnangagwa’s Power-Grab", "description": "HARARE – Zimbabwe’s leading Christian bodies have issued a strongly worded pastoral statement opposing the proposed Constitution of Zimbabwe Amendment (No. 3) Bill, 2026, warning that the changes threaten constitutional democracy and could reverse the gains of the 2013 people-driven Constitution. In a statement dated 27 February 2026, the Zimbabwe Heads of Christian Denominations (ZHOCD) [...]The post Constitution Amendment: Zimbabwe Churches Objects to Mnangagwa’s Power-Grab appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/constitution-amendment-zimbabwe-churches-objects-to-mnangagwas-power-grab/", "image": "https://thezimbabwemail.com/wp-content/uploads/2025/10/Mnangagwa-453.jpg", "publishedAt": "2026-02-27 18:28:12", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "IT ENDED IN TEARS: Veteran Bindura lawyer convicted of masterminding a deadly armed robbery", "description": "BINDURA – Once a revered figure within Bindura’s legal circles, known for his sharp intellect and adept defence of high-profile clients, Elatone Bonongwe now stands exposed as the alleged mastermind behind a brutal robbery syndicate. The 54-year-old senior partner at Bonongwe and Partners Legal Practice is accused of orchestrating a series of sophisticated heists, leveraging [...]The post IT ENDED IN TEARS: Veteran Bindura lawyer convicted of masterminding a deadly armed robbery first appeared on My Zimbabwe News.", "url": "https://www.myzimbabwe.co.zw/news/186058-it-ended-in-tears-veteran-bindura-lawyer-convicted-of-masterminding-a-deadly-armed-robbery.html", "image": "https://www.myzimbabwe.co.zw/wp-content/uploads/2026/02/Elatone-Bonongwe-Bindura-Lawyer.jpg", "publishedAt": "2026-02-27 18:25:30", "source": "My Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "New ZiG Notes Out", "description": "By Business Reporter-The Reserve Bank of Zimbabwe (RBZ) has unveiled a new series of Zimbabwe Gold (ZiG) banknotes, set to ... Continue reading \"New ZiG Notes Out\"", "url": "https://www.zimeye.net/2026/02/27/new-zig-notes-out/", "image": "https://www.zimeye.net/wp-content/uploads/2026/02/IMG_20260227_123406.jpg", "publishedAt": "2026-02-27 17:43:32", "source": "Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Sylent Nqo's 'Huya' goes triple gold after 10 million streams", "description": "Acclaimed Zimbabwean/Mozambican artist Sylent Nqo is celebrating a major career milestone after his hit single \"Huya\" surpassed 10 million streams worldwide, earning triple gold status.The achievement...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262490.html", "image": "https://img.bulawayo24.com/articles/Sylent_Nqo_Huya_Cover_Image.jpeg", "publishedAt": "2026-02-27 16:57:23", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "Billionaire Strive Masiyiwa recalls 1993 rejection and landmark legal battle in Zimbabwe", "description": "Zimbabwean billionaire and telecom pioneer Strive Masiyiwa has vividly recounted how a rejected 1993 proposal to the state-owned Posts and Telecommunications Corporation (PTC) sparked a historic legal battle that ultimately dismantled Zimbabwe’s telecommunications monopoly.The post Billionaire Strive Masiyiwa recalls 1993 rejection and landmark legal battle in Zimbabwe appeared first on Nehanda Radio.", "url": "https://nehandaradio.com/2026/02/27/billionaire-strive-masiyiwa-recalls-1993-rejection-and-landmark-legal-battle-in-zimbabwe/", "image": "https://nehandaradio.com/wp-content/uploads/2024/08/Strive-Masiyiwa.jpg", "publishedAt": "2026-02-27 16:46:27", "source": "Nehanda Radio", "_source_api": "Newsdata.io"}, {"title": "Churches warns Mnangagwa", "description": "Leading church bodies under the Zimbabwe Heads of Christian Denominations (ZHOCD) have warned President Emmerson Mnangagwa against being persuaded to extend his stay in office, urging him instead to p...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262487.html", "image": "https://img.bulawayo24.com/articles/mnangagwa_eyes.jpeg", "publishedAt": "2026-02-27 16:18:14", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "President Mnangagwa applauds academic-military synergy", "description": "Zvamaida Murwira Senior Reporter Zimbabwe Defence Forces Commander-in-Chief, President Mnangagwa, has commended the partnership between Midlands State University and the Zimbabwe Military Academy (ZMA) in training officer cadets, stating that...The post President Mnangagwa applauds academic-military synergy appeared first on herald.", "url": "https://www.heraldonline.co.zw/president-mnangagwa-applauds-academic-military-synergy/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/02/HE1-2.jpg", "publishedAt": "2026-02-27 16:11:57", "source": "H-metro", "_source_api": "Newsdata.io"}, {"title": "RBZ abandons 2030 multi-currency deadline, unveils new ZiG banknotes", "description": "HARARE - The Reserve Bank of Zimbabwe (RBZ) has abandoned its fixed 2030 deadline for ending the multi-currency system, shifting its focus instead to achieving key economic conditions, while also preparing to roll out new ZiG banknotes aimed at improving transaction efficiency and strengthening the local currency.The post RBZ abandons 2030 multi-currency deadline, unveils new ZiG banknotes appeared first on Nehanda Radio.", "url": "https://nehandaradio.com/2026/02/27/rbz-abandons-2030-multi-currency-deadline-unveils-new-zig-banknotes/", "image": "https://nehandaradio.com/wp-content/uploads/2024/04/John-Mushayavanhu-2.jpg", "publishedAt": "2026-02-27 16:11:29", "source": "Nehanda Radio", "_source_api": "Newsdata.io"}]}