{"articles": [{"title": "Robert Mugabe’s son charged with attempted murder over Johannesburg shooting", "description": "Bellarmine Chatunga Mugabe, known for lavish lifestyle, also accused of theft and being illegal immigrant after man allegedly shot in back", "url": "https://www.theguardian.com/world/2026/feb/23/robert-mugabe-son-bellarmine-mugabe-charged-with-crimes", "image": "https://media.guim.co.uk/a777e1c818970c0301f21b6c3d44c79e5163732c/99_0_3832_3066/500.jpg", "publishedAt": "2026-02-23T13:48:51Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "Cecil: The Lion and the Dentist review – inside the horrific big cat killing that outraged the world", "description": "This documentary looks at the 2015 slaying of the majestic head of two lion prides in Zimbabwe, by a trophy-hunting American dentist. Sadly it raises more questions than it answers", "url": "https://www.theguardian.com/tv-and-radio/2026/feb/20/cecil-the-lion-and-the-dentist-review-channel-4", "image": "https://media.guim.co.uk/83c2849b66a0ffbe56dc71712bf6b62007813e77/859_140_3205_2564/500.jpg", "publishedAt": "2026-02-20T00:00:18Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "Aidan Chidarikire obituary", "description": "<strong>Other lives:</strong> Pharmacy services director in newly independent Zimbabwe", "url": "https://www.theguardian.com/world/2026/feb/19/aidan-chidarikire-obituary", "image": "https://media.guim.co.uk/15ef59544bd60da852af3ba972ac13c4e9aed4b4/0_60_1326_1061/500.jpg", "publishedAt": "2026-02-19T16:01:18Z", "source": "The Guardian", "_source_api": "Guardian"}], "more": [{"title": "How the Skeleton of Mutapa Times is Based on Sarah Charlesworth's Work", "description": "Conceptual artist Sarah Charlesworth's 1979 study of how newspapers covered a solar eclipse inspired the framework behind The Mutapa Times.", "url": "article.html?slug=2020-04-20-how-the-skeleton-of-mutapa-times-is-based-on-sarah-charlesworths-work", "image": "/img/uploads/imageedit_1_5381951801.jpg", "publishedAt": "2020-04-20T00:00:00.000Z", "source": "The Mutapa Times", "cms": true}, {"title": "RBZ presents 2026 monetary policy statement this Friday", "description": "Source: RBZ presents 2026 monetary policy statement this Friday – herald Business Reporter Business leaders and financial markets have their gaze fixed on the Reserve Bank of Zimbabwe’s 2026 Monetary Policy Statement presentation scheduled for Friday, with expectations centred on", "url": "article.html?slug=2026-02-23-rbz-presents-2026-monetary-policy-statement-this-friday", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/RBZ.jpg", "publishedAt": "2026-02-23T23:28:00", "source": "The Mutapa Times", "cms": true}, {"title": "Boost For Chevrons As Delta Flies Castle Corner Fans To Cheer Zimbabwe At T20 World Cup In India", "description": "Delta Flies Castle Corner Fans To India To Boost Chevrons At T20 World Cup In a major morale booster for the national side, Delta Beverages has thrown its weight behind the Zimbabwe Chevrons by sponsoring the iconic five fans from the renowned Castle Corner to travel to India and cheer on the team at the [...]The post Boost For Chevrons As Delta Flies Castle Corner Fans To Cheer Zimbabwe At T20 World Cup In India appeared first on iHarare News.", "url": "https://iharare.com/delta-flies-castle-corner-fans-to-india-to-boost-chevrons-at-t20-world-cup/", "image": "", "publishedAt": "2026-02-24 06:11:50", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Du Plessis Lauds WI Spin Duo, But SA, India Will Be 'Real Test'", "description": "(MENAFN - AsiaNet News) Former South Africa skipper Faf du Plessis praised West Indies spin duo of Akeal Hosein and Gudakesh Motie for their performance against Zimbabwe in the T20 World Cup, but ...", "url": "https://menafn.com/1110781443/Du-Plessis-Lauds-WI-Spin-Duo-But-SA-India-Will-Be-Real-Test", "image": "https://menafn.com/updates/pr/2026-02/24/AN_6c54fimage_story.jpg", "publishedAt": "2026-02-24 06:07:36", "source": "Menafn", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe Rejects $350 Million US Health Aid Deal Citing Intelligence Overreach & Sovereignty Fears", "description": "14 African Countries Sign US Health Deal But Zimbabwe Stands Firm Zimbabwe has walked away from a proposed $350 million (approx R6.4 billion) health funding agreement with the United States, after President Emmerson Mnangagwa personally directed his government to discontinue negotiations over what Harare describes as a one-sided deal that undermines the country’s sovereignty. According [...]The post Zimbabwe Rejects $350 Million US Health Aid Deal Citing Intelligence Overreach & Sovereignty Fears appeared first on iHarare News.", "url": "https://iharare.com/zimbabwe-rejects-350-million-us-health-aid-package-citing-intelligence-overreach-sovereignty-fears/", "image": "", "publishedAt": "2026-02-24 05:34:09", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "HOW THEY WERE SOLD OUT: Mike Chimombe and Moses Mpofu thoroughly beaten, caught using cellphones in Chikurubi prison", "description": "HARARE – In a stark reminder of the pervasive challenges within Zimbabwe’s correctional facilities, prominent businessmen and convicted fraudsters Mike Chimombe and Moses Mpofu were reportedly subjected to severe beatings by prison guards at Chikurubi Maximum Security Prison. The incident, which occurred on a Wednesday in mid-February 2026, unfolded after the duo was caught in [...]The post HOW THEY WERE SOLD OUT: Mike Chimombe and Moses Mpofu thoroughly beaten, caught using cellphones in Chikurubi prison first appeared on My Zimbabwe News.", "url": "https://www.myzimbabwe.co.zw/news/185967-how-they-were-sold-out-mike-chimombe-and-moses-mpofu-thoroughly-beaten-caught-using-cellphones-in-chikurubi-prison.html", "image": "https://www.myzimbabwe.co.zw/wp-content/uploads/2026/01/mike-chimombe-and-moses-mpofu-and-wife-chikurubi-KFC.jpg", "publishedAt": "2026-02-24 05:27:50", "source": "My Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Wicknell Chivayo’s R15 Million Gold Secret: Why the Hawks Are Finally Closing in on President Mnangagwa’s Ally", "description": "HARARE – Wicknell Chivayo, the flamboyant Zimbabwean businessman often referred to as “Sir Wicknell” and known for his extravagant gifts of luxury cars to musicians and church leaders, finds himself once again under intense scrutiny. While he has frequently navigated legal challenges in Zimbabwe, often attributed to his close ties with the political elite, South [...]The post Wicknell Chivayo’s R15 Million Gold Secret: Why the Hawks Are Finally Closing in on President Mnangagwa’s Ally first appeared on My Zimbabwe News.", "url": "https://www.myzimbabwe.co.zw/news/185964-wicknell-chivayos-r15-million-gold-secret-why-the-hawks-are-finally-closing-in-on-president-mnangagwas-ally.html", "image": "https://www.myzimbabwe.co.zw/wp-content/uploads/2025/04/akabatwa-kuti-dzvii-wicknell-chivayo-and-mnangagwa.webp", "publishedAt": "2026-02-24 05:02:22", "source": "My Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "'They Were Tactically Smart': Du Plessis Praises Motie & Hosein After WI Crush Zimbabwe In Super 8", "description": "(MENAFN - IANS) New Delhi, Feb 24 (IANS) Former South African batter Faf du Plessis hailed West Indies spinners Akeal Hosein and Gudakesh Motie as 'tactically very smart' for their brilliant bowling ...", "url": "https://menafn.com/1110780672/They-Were-Tactically-Smart-Du-Plessis-Praises-Motie-Hosein-After-WI-Crush-Zimbabwe-In-Super-8", "image": "https://menafn.com/updates/pr/2026-02/24/I_df097image_story.JPG", "publishedAt": "2026-02-24 03:45:16", "source": "Menafn", "_source_api": "Newsdata.io"}, {"title": "Mighty Warriors warned against complacency ahead of crucial Botswana clash", "description": "Zimbabwe senior women’s national team head coach Sithethelelwe Sibanda has warned her players to guard against complacency when they face Botswana in their final COSAFA Cup Group B match on Tuesday at the Old Peter Mokaba Stadium in South Africa. A victory for the Zimbabwe women’s national football team will secure automatic qualification for the [...]The post Mighty Warriors warned against complacency ahead of crucial Botswana clash appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/mighty-warriors-warned-against-complacency-ahead-of-crucial-botswana-clash/", "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2026/02/23164022/fb_img_1771864702682bMtf3LB.jpg", "publishedAt": "2026-02-24 03:00:53", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Zimbabweans abroad dismiss Ziyambi’s claim that diaspora voting depends on constitutional amendment", "description": "The Zimbabwe Diaspora Vote Initiative (ZDVI) has dismissed claims by Justice Minister Ziyambi Ziyambi that Zimbabweans living abroad will only be able to vote after the passage of the Constitutional Amendment Bill No. 3 of 2026, saying the two issues are unrelated. This comes after Ziyambi a few days ago indicated that diaspora voting would [...]The post Zimbabweans abroad dismiss Ziyambi’s claim that diaspora voting depends on constitutional amendment appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/zimbabweans-abroad-dismiss-ziyambis-claim-that-diaspora-voting-depends-on-constitutional-amendment/", "image": "", "publishedAt": "2026-02-24 00:03:46", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Constitutional Court throws out bid to overturn PVO Act", "description": "The Constitutional Court of Zimbabwe has dismissed an application seeking to invalidate the Private Voluntary Organisations Act 2025 and hold the President of Zimbabwe accountable for allegedly assenting to a law passed without proper public participation, ruling that no constitutional breach was established. In a judgment handed down on 16 February 2026, Justice Rita Makarau [...]The post Constitutional Court throws out bid to overturn PVO Act appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/constitutional-court-throws-out-bid-to-overturn-pvo-act/", "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg", "publishedAt": "2026-02-24 00:02:56", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "T20 World Cup 2026: 8 Teams Battle For Semi-Final Spots In Super 8", "description": "(MENAFN - AsiaNet News) After a brilliant group stage, eight teams - India, South Africa, West Indies, New Zealand, Sri Lanka, England, Zimbabwe, and Pakistan are battling it out for the ICC Men's ...", "url": "https://menafn.com/1110779963/T20-World-Cup-2026-8-Teams-Battle-For-Semi-Final-Spots-In-Super-8", "image": "https://menafn.com/updates/pr/2026-02/24/AN_11662image_story.jpg", "publishedAt": "2026-02-24 00:00:46", "source": "Menafn", "_source_api": "Newsdata.io"}, {"title": "ZNCC woos Korean companies to exhibit locally", "description": "THE Zimbabwe National Chamber of Commerce (ZNCC) recently engaged the Embassy of Korea in a development that is likely to see companies from the East Asian nation exhibiting at forthcoming events. An update shared by the Chamber confirms that ZNCC president Tapiwa Karoro and the chief economist Jephias Makiwa held an engagement with the Embassy [...]The post ZNCC woos Korean companies to exhibit locally appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/zncc-woos-korean-companies-to-exhibit-locally/", "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2026/02/23164948/south_korea-zncc.jpg", "publishedAt": "2026-02-24 00:00:43", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Chinese firm Livetouch ordered to pay US$380k to transporter in long-running debt saga", "description": "Chinese investment firm Livetouch Investments (Private) Limited has been ordered to pay US$380,000 to Avim Investments (Private) Limited after the High Court of Zimbabwe ruled that the former had no lawful authority to oppose the urgent application, a finding that cleared the way for immediate enforcement. Justice Regis Dembure confirmed an ex tempore ruling issued [...]The post Chinese firm Livetouch ordered to pay US$380k to transporter in long-running debt saga appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/chinese-firm-livetouch-ordered-to-pay-us380k-to-transporter-in-long-running-debt-saga/", "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/07061214/high-court.jpg", "publishedAt": "2026-02-24 00:00:34", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "It’s hard to meet someone like him – iShowSpeed says Superstar Jani was highlight of his Africa tour", "description": "A month after coming to Zimbabwe as part of his African tour, American YouTuber iShowSpeed is still smitten by his doppelganger, Mudiwa ‘Superstar’ Jani, whom he described as a highlight of the continental expedition. Jani’s breakthrough came when the YouTube streamer visited Mbare as part of the Harare tour. The encounter became the highlight of [...]The post It’s hard to meet someone like him – iShowSpeed says Superstar Jani was highlight of his Africa tour appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/its-hard-to-meet-someone-like-him-ishowspeed-says-superstar-jani-was-highlight-of-his-africa-tour/", "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2026/01/08071737/20260108_091544.jpg", "publishedAt": "2026-02-24 00:00:29", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Speak now or forever hold your peace", "description": "THE country stands at a generational crossroads. With the recent gazetting of the Constitution of Zimbabwe (Amendment) Bill (No. 3), the foundational... To access this content, please purchase a subscription by clicking the button below and select a package of your choice!Subscriptions", "url": "https://dailynews.co.zw/speak-now-or-forever-hold-your-peace/", "image": "", "publishedAt": "2026-02-24 00:00:00", "source": "Dailynews", "_source_api": "Newsdata.io"}]}