{"articles": [{"title": "Zimbabwean breakout at T20 World Cup has fans rejoicing renaissance", "description": "Swelling fanbase has been in dreamland this past month as Zimbabwe have defied all expectations in the competition", "url": "https://www.theguardian.com/sport/2026/feb/25/zimbabwe-breakout-cricket-world-cup-supporters-rejoicing-renaissance", "image": "https://media.guim.co.uk/57170b6bfd404a0e029eb92825e336f3452038e3/183_0_1827_1462/500.jpg", "publishedAt": "2026-02-25T10:05:15Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "Live Talk: The Connection", "description": "Livetalk is a 30-minute call-in TV (simulcast) talk show engaging Zimbabweans in-country and in the diaspora to air their views on developments taking place in Zimbabwe and elsewhere. The program aims to enlighten citizens on critical issues by engaging experts, non-state actors, politicians and government officials. Join us Monday to Friday 1800-1830UTC, 2000-2030pm Zimbabwe time.", "url": "https://www.voazimbabwe.com/a/8117157.html", "image": "https://gdb.voanews.com/4a8ce12a-a06b-45be-9ed8-4cbf1b17dd17_tv_w800_h450.jpg", "publishedAt": "2026-02-24 18:33:45", "source": "Voa Zimbabwe", "_source_api": "Newsdata.io"}, {"title": "South African army men recover two vehicles being smuggled in flooded Limpopo River into Zimbabwe", "description": "Thupeyo Muleya South African National Defence Force members deployed to patrol the border with Zimbabwe have recovered a Toyota Land Cruiser worth around R1,5 million that was being smuggled out...The post South African army men recover two vehicles being smuggled in flooded Limpopo River into Zimbabwe appeared first on herald.", "url": "https://www.heraldonline.co.zw/south-african-army-men-recover-two-vehicles-being-smuggled-in-flooded-limpopo-river-into-zimbabwe/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/sites/2/2020/08/South-African-Flag.jpg", "publishedAt": "2026-02-24 15:42:36", "source": "The Herald", "_source_api": "Newsdata.io"}], "more": [{"title": "How the Skeleton of Mutapa Times is Based on Sarah Charlesworth's Work", "description": "Conceptual artist Sarah Charlesworth's 1979 study of how newspapers covered a solar eclipse inspired the framework behind The Mutapa Times.", "url": "article.html?slug=2020-04-20-how-the-skeleton-of-mutapa-times-is-based-on-sarah-charlesworths-work", "image": "/img/uploads/imageedit_1_5381951801.jpg", "publishedAt": "2020-04-20T00:00:00.000Z", "source": "The Mutapa Times", "cms": true}, {"title": "RBZ presents 2026 monetary policy statement this Friday", "description": "Source: RBZ presents 2026 monetary policy statement this Friday – herald Business Reporter Business leaders and financial markets have their gaze fixed on the Reserve Bank of Zimbabwe’s 2026 Monetary Policy Statement presentation scheduled for Friday, with expectations centred on", "url": "article.html?slug=2026-02-23-rbz-presents-2026-monetary-policy-statement-this-friday", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/RBZ.jpg", "publishedAt": "2026-02-23T23:28:00", "source": "The Mutapa Times", "cms": true}, {"title": "Robert Mugabe’s son charged with attempted murder over Johannesburg shooting", "description": "Bellarmine Chatunga Mugabe, known for lavish lifestyle, also accused of theft and being illegal immigrant after man allegedly shot in back", "url": "article.html?slug=2026-02-23-robert-mugabes-son-charged-with-attempted-murder-over-johann", "image": "https://media.guim.co.uk/a777e1c818970c0301f21b6c3d44c79e5163732c/99_0_3832_3066/500.jpg", "publishedAt": "2026-02-23T13:48:00", "source": "The Mutapa Times", "cms": true}, {"title": "SA fast food chain makes Zim bow", "description": "Source: SA fast food chain makes Zim bow -Newsday Zimbabwe South African fast-food chain Pedros Flame Grilled Chicken is set to create about 300 jobs in Zimbabwe as it rolls out an initial 10 outlets by February next year.The brand, founded in *2018* and now operating more than 210 stores across South Africa, Zambia, Botswana [...]The post SA fast food chain makes Zim bow appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/sa-fast-food-chain-makes-zim-bow/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/HbXSXfsC7MJ2adOD6DndFW7gq3OIwSzYCprrMdP8.jpg", "publishedAt": "2026-02-25 03:42:51", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Citizens push back on Mnangagwa’s term extension", "description": "Source: Citizens push back on Mnangagwa’s term extension -Newsday Zimbabwe Sanyati residents have urged their Member of Parliament, Polite Kambamura, not to support proposed constitutional amendments that would extend President Emmerson Mnangagwa’s tenure by two years, keeping him in office until 2030. The Constitutional Amendment Bill No 3, gazetted last week, gives Parliament the power [...]The post Citizens push back on Mnangagwa’s term extension appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/citizens-push-back-on-mnangagwas-term-extension/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/nJh1t77A3GHr1UoLritXBcNPKRS8uR0IzNkZLFJy-scaled.jpg", "publishedAt": "2026-02-25 03:41:56", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Govt, Pfizer sign landmark health equity Accord", "description": "Source: Govt, Pfizer sign landmark health equity Accord – herald Trust Freddy Herald Correspondent GOVERNMENT has formally signed onto the Pfizer Accord for a Healthier World, a high-level agreement designed to provide the nation with equitable access to patented medicines and vaccines on a not-for-profit basis. Health and Child Care Minister Dr Douglas Mombeshora yesterday [...]The post Govt, Pfizer sign landmark health equity Accord appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/govt-pfizer-sign-landmark-health-equity-accord/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/DM1-1.jpg", "publishedAt": "2026-02-25 03:40:35", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Polarization is part of any democracy and can never justify extending presidential terms", "description": "Source: Polarization is part of any democracy and can never justify extending presidential terms When those in power place their own failures on a constitution. Tendai Ruben Mbofana ​The current discourse surrounding the proposed Constitutional Amendment No 3 Bill in Zimbabwe represents a profound misunderstanding of democratic principles or, more likely, a deliberate attempt to [...]The post Polarization is part of any democracy and can never justify extending presidential terms appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/polarization-is-part-of-any-democracy-and-can-never-justify-extending-presidential-terms/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/file_000000008604722f8990ffbee81b35d8-16.png", "publishedAt": "2026-02-25 03:40:00", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Professor Moyo and the deception of disguising a term extension as an election cycle", "description": "Source: Professor Moyo and the deception of disguising a term extension as an election cycle The deception seems to have no end. Tendai Ruben Mbofana ​In a recent and carefully worded statement, Professor Jonathan Moyo attempted to provide a scholarly veneer to what is, in reality, a blunt instrument for power retention. If you value [...]The post Professor Moyo and the deception of disguising a term extension as an election cycle appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/professor-moyo-and-the-deception-of-disguising-a-term-extension-as-an-election-cycle/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/watermarked-9d28ecb2-a37c-4f07-82dd-319b2a9f1294-15.jpg", "publishedAt": "2026-02-25 03:39:34", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Legal Discussions with Vengai Madzima: Enforcement of Foreign Judgments", "description": "NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima. This week, we want to discuss the [...]The post Legal Discussions with Vengai Madzima: Enforcement of Foreign Judgments appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-enforcement-of-foreign-judgments/", "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/28062922/WhatsApp-Image-2024-07-26-at-15.42.14-e1722144586557.jpeg", "publishedAt": "2026-02-25 03:37:54", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "ICARRD+20 kicks off this week: can the challenge of redistributive land reform be addressed?", "description": "Source: ICARRD+20 kicks off this week: can the challenge of redistributive land reform be addressed? | zimbabweland The International Conference on Agrarian Reform and Rural Development (ICARRD +20) starts this week in Cartagena in Colombia, hosted by the Colombian government and technically supported by the UN Food and Agriculture Organisation. The conference comes 20 years [...]The post ICARRD+20 kicks off this week: can the challenge of redistributive land reform be addressed? appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/icarrd20-kicks-off-this-week-can-the-challenge-of-redistributive-land-reform-be-addressed/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/icarrd20.png", "publishedAt": "2026-02-25 03:29:18", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe Vigil Diary 21st February 2026", "description": "Source: Zimbabwe Vigil Diary 21st February 2026 Once again Vigil activists met outside the Zimbabwe Embassy in London to continue our protest against the human rights abuse and lack of democracy in Zimbabwe perpetrated by ZANU PF, the ruling regime. https://www.flickr.com/photos/zimbabwevigil/55112630549/sizes/m/ Thanks to those who came today: Elizabeth Chitenga, Munashe Madziyauswa, Chantelle Manyande, Philip Maponga, Samantha [...]The post Zimbabwe Vigil Diary 21st February 2026 appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/zimbabwe-vigil-diary-21st-february-2026/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/55112630549_f11f083008_e.jpg", "publishedAt": "2026-02-25 03:28:08", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Politburo meets today", "description": "Source: Politburo meets today – herald Joseph Madzimure Zimpapers Politics Hub ZANU PF will convene a crucial Politburo meeting today, party spokesperson, Ambassador Christopher Mutsvangwa, has said. In a statement, Ambassador Mutsvangwa said: “The Secretary General, Advocate Jacob Mudenda, advises members of the Politburo meeting to be held this Wednesday, February 25, 2026, at 10:00 [...]The post Politburo meets today appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/politburo-meets-today-10/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/Untitled-97.jpg", "publishedAt": "2026-02-25 03:27:32", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "What happens if the next term is extended to 20 years – asks Coltart, as headstrong Zanu PF trudges on with Constitutional amendments", "description": "WITH Zanu PF leaders and government adamant that President Emmerson Mnangagwa’s second five-year-term must be extended by two more years, Bulawayo mayor David Coltart has asked how Zimbabweans would react if government was to add another 20-year-term in 2030.The post What happens if the next term is extended to 20 years – asks Coltart, as headstrong Zanu PF trudges on with Constitutional amendments appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/what-happens-if-the-next-term-is-extended-to-20-years-asks-coltart-as-head-strong-zanu-pf-trudges-on-with-constitutional-amendments/", "image": "", "publishedAt": "2026-02-25 00:05:18", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Not a fluke says ZANU PF legislator as Parliament hails Chevrons performance at T20 World Cup", "description": "Parliament has hailed the exploits of the Zimbabwe senior men’s cricket team at the ongoing T20 World Cup, being hosted by Sri Lanka and India. Zimbabwe has earned global admiration after putting in strong performances to qualify unbeaten for the Super 8 stage. On their way to the Super 8s, the Chevrons beat Australia, Oman, [...]The post Not a fluke says ZANU PF legislator as Parliament hails Chevrons performance at T20 World Cup appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/not-a-fluke-says-zanu-pf-legislator-as-parliament-hails-chevrons-performance-at-t20-world-cup/", "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2026/02/23191529/fb_img_1771873552524-e1771902448276.jpg", "publishedAt": "2026-02-25 00:03:41", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "South African musician Naledi Aphiwe apologises after Xenophobic remark against Zimbabweans resurfaces", "description": "Not willing to risk facing the wrath of Zimbabweans when she comes to perform in the country in April, South African musician Naledi Aphiwe has apologised over a xenophobic remark she made online a few years ago. Naledi Aphiwe’s announcement as part of the line-up to perform at the Ama2k festival, to be held in [...]The post South African musician Naledi Aphiwe apologises after Xenophobic remark against Zimbabweans resurfaces appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/south-african-musician-naledi-aphiwe-apologises-after-xenophobic-remark-against-zimbabweans-resurfaces/", "image": "", "publishedAt": "2026-02-25 00:00:32", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "ZIMRA wins Supreme Court appeal against Pacific Cigarette Company", "description": "The Zimbabwe Revenue Authority (ZIMRA) has won a major Supreme Court appeal against Pacific Cigarette Company (Private) Limited after the court ruled that the company was not entitled to a tax clearance certificate (TCC) while owing more than US$19.5 million in taxes and operating under corporate rescue. In a unanimous judgment delivered in Harare on [...]The post ZIMRA wins Supreme Court appeal against Pacific Cigarette Company appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/zimra-wins-supreme-court-appeal-against-pacific-cigarette-company/", "image": "", "publishedAt": "2026-02-25 00:00:20", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "‘Harmonised borders vital for regional trade’", "description": "ADOPTING coordinated inspections and digital systems is critical to eliminating bottlenecks between Zimbabwe, Zambia, and South Africa, the government has said.Officially opening... To access this content, please purchase a subscription by clicking the button below and select a package of your choice!Subscriptions", "url": "https://dailynews.co.zw/harmonised-borders-vital-for-regional-trade/", "image": "", "publishedAt": "2026-02-24 23:58:00", "source": "Dailynews", "_source_api": "Newsdata.io"}, {"title": "CFAO Mobility hands Sables logistics boost", "description": "THE Zimbabwe Sables have scored a major off‐field victory, sealing a partnership with CFAO Mobility that will cover the team’s transport needs... To access this content, please purchase a subscription by clicking the button below and select a package of your choice!Subscriptions", "url": "https://dailynews.co.zw/cfao-mobility-hands-sables-logistics-boost/", "image": "", "publishedAt": "2026-02-24 23:57:00", "source": "Dailynews", "_source_api": "Newsdata.io"}]}