{"articles": [{"title": "Cecil: The Lion and the Dentist review – inside the horrific big cat killing that outraged the world", "description": "This documentary looks at the 2015 slaying of the majestic head of two lion prides in Zimbabwe, by a trophy-hunting American dentist. Sadly it raises more questions than it answers", "url": "https://www.theguardian.com/tv-and-radio/2026/feb/20/cecil-the-lion-and-the-dentist-review-channel-4", "image": "https://media.guim.co.uk/83c2849b66a0ffbe56dc71712bf6b62007813e77/859_140_3205_2564/500.jpg", "publishedAt": "2026-02-20T00:00:18Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "Aidan Chidarikire obituary", "description": "<strong>Other lives:</strong> Pharmacy services director in newly independent Zimbabwe", "url": "https://www.theguardian.com/world/2026/feb/19/aidan-chidarikire-obituary", "image": "https://media.guim.co.uk/15ef59544bd60da852af3ba972ac13c4e9aed4b4/0_60_1326_1061/500.jpg", "publishedAt": "2026-02-19T16:01:18Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "Zimbabwe stun Australia with 23-run victory at T20 World Cup – as it happened", "description": "Australia’s hopes of reaching the Super Eights are left hanging by a thread after Muzarabani takes four wickets to seal upset win", "url": "https://www.theguardian.com/sport/live/2026/feb/13/australia-v-zimbabwe-t20-world-cup-cricket-live", "image": "https://media.guim.co.uk/b3ede0bc83a99d291c709a31426c18151160657e/500_0_2500_2000/500.jpg", "publishedAt": "2026-02-13T09:31:17Z", "source": "The Guardian", "_source_api": "Guardian"}], "more": [{"title": "Zimbabweans abroad dismiss Ziyambi’s claim that diaspora voting depends on constitutional amendment", "description": "The Zimbabwe Diaspora Vote Initiative (ZDVI) has dismissed claims by Justice Minister Ziyambi Ziyambi that Zimbabweans living abroad will only be able to vote after the passage of the Constitutional Amendment Bill No. 3 of 2026, saying the two issues are unrelated. This comes after Ziyambi a few days ago indicated that diaspora voting would [...]The post Zimbabweans abroad dismiss Ziyambi’s claim that diaspora voting depends on constitutional amendment appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/zimbabweans-abroad-dismiss-ziyambis-claim-that-diaspora-voting-depends-on-constitutional-amendment/", "image": "", "publishedAt": "2026-02-24 00:03:46", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Constitutional Court throws out bid to overturn PVO Act", "description": "The Constitutional Court of Zimbabwe has dismissed an application seeking to invalidate the Private Voluntary Organisations Act 2025 and hold the President of Zimbabwe accountable for allegedly assenting to a law passed without proper public participation, ruling that no constitutional breach was established. In a judgment handed down on 16 February 2026, Justice Rita Makarau [...]The post Constitutional Court throws out bid to overturn PVO Act appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/constitutional-court-throws-out-bid-to-overturn-pvo-act/", "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg", "publishedAt": "2026-02-24 00:02:56", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "T20 World Cup 2026: 8 Teams Battle For Semi-Final Spots In Super 8", "description": "(MENAFN - AsiaNet News) After a brilliant group stage, eight teams - India, South Africa, West Indies, New Zealand, Sri Lanka, England, Zimbabwe, and Pakistan are battling it out for the ICC Men's ...", "url": "https://menafn.com/1110779963/T20-World-Cup-2026-8-Teams-Battle-For-Semi-Final-Spots-In-Super-8", "image": "https://menafn.com/updates/pr/2026-02/24/AN_11662image_story.jpg", "publishedAt": "2026-02-24 00:00:46", "source": "Menafn", "_source_api": "Newsdata.io"}, {"title": "ZNCC woos Korean companies to exhibit locally", "description": "THE Zimbabwe National Chamber of Commerce (ZNCC) recently engaged the Embassy of Korea in a development that is likely to see companies from the East Asian nation exhibiting at forthcoming events. An update shared by the Chamber confirms that ZNCC president Tapiwa Karoro and the chief economist Jephias Makiwa held an engagement with the Embassy [...]The post ZNCC woos Korean companies to exhibit locally appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/zncc-woos-korean-companies-to-exhibit-locally/", "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2026/02/23164948/south_korea-zncc.jpg", "publishedAt": "2026-02-24 00:00:43", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Chinese firm Livetouch ordered to pay US$380k to transporter in long-running debt saga", "description": "Chinese investment firm Livetouch Investments (Private) Limited has been ordered to pay US$380,000 to Avim Investments (Private) Limited after the High Court of Zimbabwe ruled that the former had no lawful authority to oppose the urgent application, a finding that cleared the way for immediate enforcement. Justice Regis Dembure confirmed an ex tempore ruling issued [...]The post Chinese firm Livetouch ordered to pay US$380k to transporter in long-running debt saga appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/chinese-firm-livetouch-ordered-to-pay-us380k-to-transporter-in-long-running-debt-saga/", "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/07061214/high-court.jpg", "publishedAt": "2026-02-24 00:00:34", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "It’s hard to meet someone like him – iShowSpeed says Superstar Jani was highlight of his Africa tour", "description": "A month after coming to Zimbabwe as part of his African tour, American YouTuber iShowSpeed is still smitten by his doppelganger, Mudiwa ‘Superstar’ Jani, whom he described as a highlight of the continental expedition. Jani’s breakthrough came when the YouTube streamer visited Mbare as part of the Harare tour. The encounter became the highlight of [...]The post It’s hard to meet someone like him – iShowSpeed says Superstar Jani was highlight of his Africa tour appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/its-hard-to-meet-someone-like-him-ishowspeed-says-superstar-jani-was-highlight-of-his-africa-tour/", "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2026/01/08071737/20260108_091544.jpg", "publishedAt": "2026-02-24 00:00:29", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Speak now or forever hold your peace", "description": "THE country stands at a generational crossroads. With the recent gazetting of the Constitution of Zimbabwe (Amendment) Bill (No. 3), the foundational... To access this content, please purchase a subscription by clicking the button below and select a package of your choice!Subscriptions", "url": "https://dailynews.co.zw/speak-now-or-forever-hold-your-peace/", "image": "", "publishedAt": "2026-02-24 00:00:00", "source": "Dailynews", "_source_api": "Newsdata.io"}, {"title": "Letter to my fellow Zim shareholders. . . why I intend to vote yes for Econet delisting", "description": "I am a professional investor, and I have been an investor in Econet since its original IPO in September 1998. I’m from...", "url": "https://dailynews.co.zw/letter-to-my-fellow-zim-shareholders-why-i-intend-to-vote-yes-for-econet-delisting/", "image": "", "publishedAt": "2026-02-23 23:59:00", "source": "Dailynews", "_source_api": "Newsdata.io"}, {"title": "We are ready to be audited — Zimura", "description": "THE Zimbabwe Music Rights Association (Zimura) says it has no objection to an audit and is ready to subject its books to... To access this content, please purchase a subscription by clicking the button below and select a package of your choice!Subscriptions", "url": "https://dailynews.co.zw/we-are-ready-to-be-audited-zimura/", "image": "", "publishedAt": "2026-02-23 23:59:00", "source": "Dailynews", "_source_api": "Newsdata.io"}, {"title": "Kombi driver jailed 3 years for sexually abusing child kidnap teen", "description": "Offence exposed after victim allegedly kidnapped toddler in central Bulawayo Source: Kombi driver jailed 3 years for sexually abusing child kidnap teen – Zimbabwe News Now Jailed Godwell Mumba BULAWAYO — A kombi driver who sexually abused his ex-girlfriend’s 14-year-old sister has been sentenced to three years in prison after his crime was exposed through [...]The post Kombi driver jailed 3 years for sexually abusing child kidnap teen appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/kombi-driver-jailed-3-years-for-sexually-abusing-child-kidnap-teen/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/IMG_5627.jpeg", "publishedAt": "2026-02-23 23:51:24", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "RBZ presents 2026 monetary policy statement this Friday", "description": "Source: RBZ presents 2026 monetary policy statement this Friday – herald Business Reporter Business leaders and financial markets have their gaze fixed on the Reserve Bank of Zimbabwe’s 2026 Monetary Policy Statement presentation scheduled for Friday, with expectations centred on interest rate direction, currency stability and measures to unlock productive credit. The central bank has [...]The post RBZ presents 2026 monetary policy statement this Friday appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/rbz-presents-2026-monetary-policy-statement-this-friday/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/RBZ.jpg", "publishedAt": "2026-02-23 23:28:39", "source": "Zimbabwe Situation"}, {"title": "Tobacco farmers push for decentralisation of auction floors", "description": "Source: Tobacco farmers push for decentralisation of auction floors – herald Edgar Vhera, edgar.vhera@zimpapers.co.zw FARMERS have urged the Tobacco Industry and Marketing Board (TIMB) to decentralise tobacco auction floors by operationalising the Tobacco Value Chain Transformation Plan 2 (TVCTP 2), covering the period 2026 to 2030. This emerged during a recent stakeholders meeting in Harare to [...]The post Tobacco farmers push for decentralisation of auction floors appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/tobacco-farmers-push-for-decentralisation-of-auction-floors/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/hdrf.jpg", "publishedAt": "2026-02-23 23:28:19", "source": "Zimbabwe Situation"}, {"title": "If ZANU-PF needs two more years to finish its “development programs” does that mean it isn’t confident of winning in 2028?", "description": "Source: If ZANU-PF needs two more years to finish its “development programs” does that mean it isn’t confident of winning in 2028? Fear can be repackaged and presented as strategy. Tendai Ruben Mbofana The political landscape in Zimbabwe has often been a theater of the absurd, but the latest narrative emerging from the corridors of [...]The post If ZANU-PF needs two more years to finish its “development programs” does that mean it isn’t confident of winning in 2028? appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/if-zanu-pf-needs-two-more-years-to-finish-its-development-programs-does-that-mean-it-isnt-confident-of-winning-in-2028/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/watermarked-9d28ecb2-a37c-4f07-82dd-319b2a9f1294-14.jpg", "publishedAt": "2026-02-23 23:27:54", "source": "Zimbabwe Situation"}, {"title": "NO MERCY EVEN FOR COPS IN CRACKDOWN", "description": "Source: NO MERCY EVEN FOR COPS IN CRACKDOWN – herald Arron Nyamayaro POLICE are not sparring anyone when it comes to their crackdown on rogue elements on the country’s roads. Even police officers are being caught up in the crackdown and an officer was fined yesterday for reckless driving. Constable Masuka, who is based in [...]The post NO MERCY EVEN FOR COPS IN CRACKDOWN appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/no-mercy-even-for-cops-in-crackdown/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/Untitled-5-20.jpg", "publishedAt": "2026-02-23 23:27:35", "source": "Zimbabwe Situation"}, {"title": "What went wrong with the Mugabe children?", "description": "Source: What went wrong with the Mugabe children? When things fall apart, questions are inevitably asked. Tendai Ruben Mbofana The tragic irony of the Mugabe legacy is no longer found in the history books of the liberation struggle but rather in the grim charge sheets of police stations across Southern Africa. To directly receive my [...]The post What went wrong with the Mugabe children? appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/what-went-wrong-with-the-mugabe-children/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/file_000000008604722f8990ffbee81b35d8-15.png", "publishedAt": "2026-02-23 23:26:37", "source": "Zimbabwe Situation"}]}