{"articles": [{"title": "Report responsibly on children issues: ZMC", "description": "Moffat Mungazi Post Reporter MEDIA coverage on issues involving children must always uphold professional and ethical standards so as to protect the minors’ safety and wellbeing, the Zimbabwe Media Commission...The post Report responsibly on children issues: ZMC appeared first on herald.", "url": "https://www.heraldonline.co.zw/report-responsibly-on-children-issues-zmc/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/02/Media-coverage.jpg", "publishedAt": "2026-02-24 09:23:34", "source": "The Herald", "_source_api": "Newsdata.io"}, {"title": "Illegal mining, sand poaching top EMA stakeholders meeting in Bulawayo", "description": "Mkhululi Ncube themkhust@gmail.com ILLEGAL mining and sand poaching operations in and around Bulawayo are the top of the agenda today as stakeholders meet to deliberate on the environmental impacts of...The post Illegal mining, sand poaching top EMA stakeholders meeting in Bulawayo appeared first on herald.", "url": "https://www.heraldonline.co.zw/illegal-mining-sand-poaching-top-ema-stakeholders-meeting-in-bulawayo/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-24-at-11.08.15.jpeg", "publishedAt": "2026-02-24 09:14:51", "source": "The Herald", "_source_api": "Newsdata.io"}, {"title": "Robert Mugabe’s son charged with attempted murder over Johannesburg shooting", "description": "Bellarmine Chatunga Mugabe, known for lavish lifestyle, also accused of theft and being illegal immigrant after man allegedly shot in back", "url": "https://www.theguardian.com/world/2026/feb/23/robert-mugabe-son-bellarmine-mugabe-charged-with-crimes", "image": "https://media.guim.co.uk/a777e1c818970c0301f21b6c3d44c79e5163732c/99_0_3832_3066/500.jpg", "publishedAt": "2026-02-23T13:48:51Z", "source": "The Guardian", "_source_api": "Guardian"}], "more": [{"title": "How the Skeleton of Mutapa Times is Based on Sarah Charlesworth's Work", "description": "Conceptual artist Sarah Charlesworth's 1979 study of how newspapers covered a solar eclipse inspired the framework behind The Mutapa Times.", "url": "article.html?slug=2020-04-20-how-the-skeleton-of-mutapa-times-is-based-on-sarah-charlesworths-work", "image": "/img/uploads/imageedit_1_5381951801.jpg", "publishedAt": "2020-04-20T00:00:00.000Z", "source": "The Mutapa Times", "cms": true}, {"title": "RBZ presents 2026 monetary policy statement this Friday", "description": "Source: RBZ presents 2026 monetary policy statement this Friday – herald Business Reporter Business leaders and financial markets have their gaze fixed on the Reserve Bank of Zimbabwe’s 2026 Monetary Policy Statement presentation scheduled for Friday, with expectations centred on", "url": "article.html?slug=2026-02-23-rbz-presents-2026-monetary-policy-statement-this-friday", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/RBZ.jpg", "publishedAt": "2026-02-23T23:28:00", "source": "The Mutapa Times", "cms": true}, {"title": "Govt Unveils Plan to Tackle Child Labour and Online Abuse", "description": "Government has approved a new five-year strategy aimed at strengthening child protection systems and addressing emerging threats such as online violence and child labour. Speaking during a post cabinet press briefing, Information, Publicity and Broadcasting Services Minister, Zhemu Soda said cabinet approved the National Action [...]The post Govt Unveils Plan to Tackle Child Labour and Online Abuse appeared first on 263Chat.", "url": "https://www.263chat.com/govt-unveils-new-five-year-plan-to-tackle-child-labour-and-online-abuse/", "image": "https://www.263chat.com/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-17-at-5.25.51-PM-1024x682.jpeg", "publishedAt": "2026-02-24 13:45:54", "source": "263chat", "_source_api": "Newsdata.io"}, {"title": "Walter Magaya’s Property To Be Auctioned Off Over Getbucks Debt, Days After Losing US$3M Case To Israeli Partner", "description": "Controversial preacher Walter Magaya faces a devastating financial double blow as his property heads to public auction over a debt to Getbucks Microfinance Bank, mere days after losing another case that ordered him to pay US$3 million (approximately R54 million) to an Israeli business partner. The Prophetic Healing and Deliverance Ministries leader now confronts the [...]The post Walter Magaya’s Property To Be Auctioned Off Over Getbucks Debt, Days After Losing US$3M Case To Israeli Partner appeared first on iHarare News.", "url": "https://iharare.com/walter-magayas-property-to-be-auctioned-off-over-getbucks-debt-days-after-losing-separate-us3m-case/", "image": "", "publishedAt": "2026-02-24 13:41:47", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "SANDF recovers two vehicles being smuggled in flooded Limpopo River into Zimbabwe", "description": "Thupeyo Muleya, thupeyo.muleya@zimpapers.co.zw South African National Defence Force members deployed to the border with Zimbabwe have recovered a Toyota Land Cruiser worth around R1,5 million that was being smuggled out...The post SANDF recovers two vehicles being smuggled in flooded Limpopo River into Zimbabwe appeared first on herald.", "url": "https://www.heraldonline.co.zw/sandf-recovers-two-vehicles-being-smuggled-in-flooded-limpopo-river-into-zimbabwe1-2/", "image": "", "publishedAt": "2026-02-24 13:39:40", "source": "H-metro", "_source_api": "Newsdata.io"}, {"title": "Rachel Kolisi’s “Man I Need” Bombshell — Is Siya in the Rearview?", "description": "Rachel Kolisi drops a shocking “Man I Need” confession, sparking speculation about Siya, marriage struggles, and possible new beginnings ahead.The post Rachel Kolisi’s “Man I Need” Bombshell — Is Siya in the Rearview? appeared first on iHarare News.", "url": "https://iharare.com/rachel-kolisis-man-i-need-bombshell-is-siya-in-the-rearview/", "image": "", "publishedAt": "2026-02-24 13:39:06", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Broken Bottle Attack: Kuwadzana Woman Faces Attempted Murder Charge", "description": "By Kudzaishe Chimonera A 23-year-old woman from Kuwadzana has appeared in court charged with attempted murder following an alleged violent assault involving a broken beer bottle. Rumbidzai Garaisa, of Kuwadzana 3 was arrested on 22 February after an incident earlier that morning at Kuwadzana 2 [...]The post Broken Bottle Attack: Kuwadzana Woman Faces Attempted Murder Charge appeared first on 263Chat.", "url": "https://www.263chat.com/broken-bottle-attack-kuwadzana-woman-faces-attempted-murder-charge/", "image": "https://www.263chat.com/wp-content/uploads/2024/04/Harare-Magistrates-Court.jpg", "publishedAt": "2026-02-24 13:25:52", "source": "263chat", "_source_api": "Newsdata.io"}, {"title": "Uebert Angel Missing After Rape Case Opened", "description": "By A Correspondent | ZimEye | A police case has reportedly been opened in Zimbabwe in connection with allegations against ... Continue reading \"Uebert Angel Missing After Rape Case Opened\"", "url": "https://www.zimeye.net/2026/02/24/uebert-angel-missing-after-rape-case-opened/", "image": "https://www.zimeye.net/wp-content/uploads/2024/06/FB_IMG_1719391601458.jpg", "publishedAt": "2026-02-24 13:06:35", "source": "Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "‘Not in My Village’: How Chief Bushu Is Taking On Child Marriage in Shamva", "description": "A local traditional leader is spearheading an ambitious campaign to end child marriage blending customary authority, religious influence and national law in what he calls a strategy of cultural intelligence. Chief Bushu from Mashonaland Central says protecting children particularly girls from early marriage has become [...]The post ‘Not in My Village’: How Chief Bushu Is Taking On Child Marriage in Shamva appeared first on 263Chat.", "url": "https://www.263chat.com/not-in-my-village-how-chief-bushu-is-taking-on-child-marriage-in-shamva/", "image": "https://www.263chat.com/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-24-at-12.27.00-PM.jpeg", "publishedAt": "2026-02-24 13:00:41", "source": "263chat", "_source_api": "Newsdata.io"}, {"title": "Temba Mliswa Backs Presidential Term Extension, Calls It ‘Extra Time’ for President Emmerson Mnangagwa", "description": "Temba Mliswa Backs Presidential Term Extension, Calls It ‘Extra Time’ for President Emmerson Mnangagwa Former MP Temba Mliswa has publicly supported the proposed extension of President Emmerson Mnangagwa’s term. He argued that disruptions caused by the COVID-19 pandemic and Cyclone Idai justify what he described as “injury time” for the presidency. Also Read: Cabinet Approves Bill [...]The post Temba Mliswa Backs Presidential Term Extension, Calls It ‘Extra Time’ for President Emmerson Mnangagwa appeared first on iHarare News.", "url": "https://iharare.com/temba-mliswa-backs-presidential-term-extension-calls-it-extra-time-for-president-emmerson-mnangagwa/", "image": "", "publishedAt": "2026-02-24 12:48:10", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Beware Scotland: Mnangagwa launches football club", "description": "Tongai Mnangagwa launches ambitious football club project, blending politics, youth empowerment and rising local football.The post Beware Scotland: Mnangagwa launches football club appeared first on iHarare News.", "url": "https://iharare.com/beware-scotland-mnangagwa-launches-football-club/", "image": "", "publishedAt": "2026-02-24 12:46:59", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Delta shares rally as Econet delisting vote reshapes market flows", "description": "HARARE – Shares in Delta Corporation attracted heightened investor interest on the Zimbabwe Stock Exchange (ZSE) ahead of Econet Wireless Zimbabwe’s extraordinary general meeting (EGM), with analysts pointing to portfolio rebalancing linked to the telecoms group’s proposed delisting. Market participants reported increased activity in Delta counters as uncertainty surrounding Econet’s shareholder vote drove investors toward [...]The post Delta shares rally as Econet delisting vote reshapes market flows appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/delta-shares-rally-as-econet-delisting-vote-reshapes-market-flows/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/01/ZSE-Stock.jpg", "publishedAt": "2026-02-24 12:44:14", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "Unplugged Zimbabwe Returns This March", "description": "The wait is almost over for Harare’s lifestyle enthusiasts. Unplugged, has officially announced its return for Saturday, March 28, 2026...", "url": "https://zimetro.co.zw/unplugged-zimbabwe-returns-this-march/", "image": "https://zimetro.co.zw/wp-content/uploads/2022/11/zimetro-logo.png", "publishedAt": "2026-02-24 09:15:38", "source": "Zimetro News", "_source_api": "Newsdata.io"}, {"title": "Power Struggle at Pockets Hill As Muswere Is Reassigned After Failed ZBC Board Coup", "description": "Harare, Zimbabwe | The dust is still settling on the most significant shift in President Emmerson Mnangagwa’s latest cabinet reshuffle: the removal of Jenfan Muswere from the influential Ministry of...", "url": "https://zimetro.co.zw/power-struggle-at-pockets-hill-as-muswere-is-reassigned-after-failed-zbc-board-coup/", "image": "https://zimetro.co.zw/wp-content/uploads/2022/11/zimetro-logo.png", "publishedAt": "2026-02-24 09:15:38", "source": "Zimetro News", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe President Approves Sweeping 2026 General Amnesty, Prioritizing Female Prisoners", "description": "In a move move to reshape the nation’s correctional landscape, the President of Zimbabwe has sanctioned a General Amnesty for 2026...", "url": "https://zimetro.co.zw/zimbabwe-president-approves-sweeping-2026-general-amnesty-prioritizing-female-prisoners/", "image": "https://zimetro.co.zw/wp-content/uploads/2022/11/zimetro-logo.png", "publishedAt": "2026-02-24 09:15:32", "source": "Zimetro News", "_source_api": "Newsdata.io"}, {"title": "‘Don’t Be Shocked If It Goes In Next Time’: Kaizer Chiefs Star Thabiso Monyane Says", "description": "Kaizer Chiefs Star Thabiso Monyane Laughs Off Missed Scissors Kick Ahead of Stellenbosch Clash Thabiso Monyane has brushed off online ridicule following his infamous missed scissors-kick attempt, insisting he remains confident in his ability to pull off spectacular goals. The defender, who has been deployed as a wing-back, was in high spirits on Monday afternoon [...]The post ‘Don’t Be Shocked If It Goes In Next Time’: Kaizer Chiefs Star Thabiso Monyane Says appeared first on iHarare News.", "url": "https://iharare.com/dont-be-shocked-if-it-goes-in-next-time-kaizer-chiefs-star-thabiso-monyane-says/", "image": "", "publishedAt": "2026-02-24 09:10:32", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "SA-based ZEP holders face new challenges", "description": "South Africa-based Zimbabwe Exemption Permit (ZEP) holders say they are being harassed, unlawfully detained and denied access to basic services - despite their permits being valid until Ma...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262374.html", "image": "https://img.bulawayo24.com/articles/zep_passport_stamp.png", "publishedAt": "2026-02-24 08:55:32", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}]}