{"articles": [{"title": "Zanu PF Matabeleland South PCC meets in Gwanda over Constitutional Amendment No. 3 Bill of 2026", "description": "Sukulwenkosi Dube-Matutu THE Zanu PF Matabeleland South Provincial Coordinating Committee (PCC) has gathered in Gwanda for a national address by the party’s leadership on the Constitutional Amendment No. 3 Bill...The post Zanu PF Matabeleland South PCC meets in Gwanda over Constitutional Amendment No. 3 Bill of 2026 appeared first on herald.", "url": "https://www.heraldonline.co.zw/zanu-pf-matabeleland-south-pcc-meets-in-gwanda-over-constitutional-amendment-no-3-bill-of-2026/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/03/WhatsApp-Image-2026-03-01-at-11.09.54.jpeg", "publishedAt": "2026-03-01 09:15:05", "source": "The Herald", "_source_api": "Newsdata.io"}, {"title": "Judgment date set in Chinese national fatal mine shooting case", "description": "Peter Matika peter.matika@chronicle.co.zw JUDGMENT has been reserved for Tuesday, 3 March 2026, in the murder trial of a Chinese national accused of fatally shooting an artisanal miner at a gold...The post Judgment date set in Chinese national fatal mine shooting case appeared first on herald.", "url": "https://www.heraldonline.co.zw/judgment-date-set-in-chinese-national-fatal-mine-shooting-case/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/site//2/COURT-GRAVEL-5-720x375-1.jpeg", "publishedAt": "2026-03-01 08:45:50", "source": "The Herald", "_source_api": "Newsdata.io"}, {"title": "DRIVERS DIE IN BUS AND TRUCK SMASH: Police warn rogue motorists", "description": "B-Metro Reporter A DEADLY smash on the Harare–Masvingo Road has left two drivers dead as the Zimbabwe Republic Police urges the public to report reckless motorists before more lives are...The post DRIVERS DIE IN BUS AND TRUCK SMASH: Police warn rogue motorists appeared first on herald.", "url": "https://www.heraldonline.co.zw/drivers-die-in-bus-and-truck-smash-police-warn-rogue-motorists/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2025/10/Accident-shatter.jpg", "publishedAt": "2026-03-01 08:36:27", "source": "The Herald", "_source_api": "Newsdata.io"}], "more": [{"title": "How the Skeleton of Mutapa Times is Based on Sarah Charlesworth's Work", "description": "Conceptual artist Sarah Charlesworth's 1979 study of how newspapers covered a solar eclipse inspired the framework behind The Mutapa Times.", "url": "article.html?slug=2020-04-20-how-the-skeleton-of-mutapa-times-is-based-on-sarah-charlesworths-work", "image": "/img/uploads/imageedit_1_5381951801.jpg", "publishedAt": "2020-04-20T00:00:00.000Z", "source": "The Mutapa Times", "cms": true}, {"title": "Madhuku & NCA Officials Attacked In Harare: Police Accused Of Assault", "description": "Lovemore Madhuku, Officials Attacked At NCA Offices In Harare: Opposition leader Lovemore Madhuku, who heads the National Constitutional Assembly (NCA), was allegedly attacked at his party’s offices in the capital this morning, in an incident that has sent shockwaves through political circles. The constitutional lawyer and outspoken government critic is currently receiving medical treatment at [...]The post Madhuku & NCA Officials Attacked In Harare: Police Accused Of Assault appeared first on iHarare News.", "url": "https://iharare.com/lovemore-madhuku-officials-attacked-at-nca-offices-police-accused-of-assault/", "image": "", "publishedAt": "2026-03-01 13:10:55", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Constitutional Changes: Mnangagwa Faces Moral Rebuke from Zimbabwe’s Top Church Bodies...", "description": "Tinashe Sambiri– Zimbabwe’s leading Christian bodies have issued a strong pastoral warning over the proposed Constitution of Zimbabwe Amendment (No. ... Continue reading \"Constitutional Changes: Mnangagwa Faces Moral Rebuke from Zimbabwe’s Top Church Bodies...\"", "url": "https://www.zimeye.net/2026/03/01/constitutional-changes-mnangagwa-faces-moral-rebuke-from-zimbabwes-top-church-bodies/", "image": "https://www.zimeye.net/wp-content/uploads/2026/02/IMG_20260227_091942.jpg", "publishedAt": "2026-03-01 13:00:00", "source": "Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Caught Red-Handed: Zimbabwe Finally Explains Why It Had To Ban All Raw Mineral & Lithium Exports", "description": "Zimbabwe Explains Why It Suspended Exports Of All Raw Mineral Ores & Lithium Concentrate The Zimbabwean government has confirmed that its dramatic suspension of all raw mineral ore and lithium concentrate exports is a direct strike against sophisticated smuggling syndicates who have been robbing the nation blind by misdeclaring valuable multi-mineral ores as low-grade, single-mineral [...]The post Caught Red-Handed: Zimbabwe Finally Explains Why It Had To Ban All Raw Mineral & Lithium Exports appeared first on iHarare News.", "url": "https://iharare.com/zimbabwe-finally-explains-why-it-had-to-ban-all-raw-mineral-lithium-exports/", "image": "", "publishedAt": "2026-03-01 12:37:43", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Prof Lovemore Madhuku Seriously Injured — Police Storm Party Offices in Harare", "description": "By A Correspondent | HARARE, Zimbabwe — National Constitutional Assembly (NCA) leader Professor Lovemore Madhuku has been injured after an ... Continue reading \"Prof Lovemore Madhuku Seriously Injured — Police Storm Party Offices in Harare\"", "url": "https://www.zimeye.net/2026/03/01/prof-lovemore-madhuku-seriously-injured-police-storm-party-offices-in-harare/", "image": "https://www.zimeye.net/wp-content/uploads/2026/03/cbc63245-c5bb-4409-bb37-fa0a28d7578a.jpeg", "publishedAt": "2026-03-01 12:00:23", "source": "Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Bless It Up bus in fatal head-on collision with a truck", "description": "The Zimbabwe Republic Police has confirmed a fatal road traffic accident that occurred on 28 February 2026 at the 87km peg along the Harare–Masvingo Road.A Bless It Up bus, carrying 32 passengers and ...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262553.html", "image": "https://img.bulawayo24.com/articles/accident_t.jpg", "publishedAt": "2026-03-01 11:48:29", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "Massive crackdown against ED2030 critics", "description": "Concerns are mounting among political activists and civic leaders over what they describe as an intensifying crackdown on dissent surrounding Constitutional Amendment Bill No. 3, which seeks to extend...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262550.html", "image": "https://img.bulawayo24.com/articles/bulawayo24.png", "publishedAt": "2026-03-01 11:34:44", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "Scottland FC partners with Liverpool FC", "description": "In a night brimming with glitz, glamour, and historic announcements, Scottland FC cemented its place as Zimbabwean football's rising powerhouse.During a star-studded kit and player unveiling ceremony ...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262548.html", "image": "https://img.bulawayo24.com/articles/bulawayo24.png", "publishedAt": "2026-03-01 11:33:47", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "SA-bound R4m illicit cigarettes intercepted near Beitbridge", "description": "The South African National Defence Force (SANDF) has confiscated illicit cigarettes and vehicles valued at more than R4 million during intelligence-driven operations near Beitbridge, Limpopo.Captain M...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262547.html", "image": "https://img.bulawayo24.com/articles/bulawayo24.png", "publishedAt": "2026-03-01 11:32:44", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "Tough rules beckon for trucks on Victoria Falls–Bulawayo road", "description": "The Government of Zimbabwe has unveiled plans to safeguard portions of the newly rehabilitated Victoria Falls–Bulawayo Road from damage caused by overloaded trucks, with measures including the constru...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262546.html", "image": "https://img.bulawayo24.com/articles/bulawayo-victoria-falls_road_detour.jpeg", "publishedAt": "2026-03-01 11:32:12", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe lands major UN tourism events", "description": "ZIMBABWE'S profile in global tourism governance is set to rise as the country is expected to host major United Nations (UN) tourism events this year, the country's Information, Publicity and Broadcast...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262542.html", "image": "https://img.bulawayo24.com/articles/bulawayo24.png", "publishedAt": "2026-03-01 11:11:47", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "ZIMURA Is Dying: Alick Macheso Threatens To Quit Over Funeral Lies & Unfair Treatment Of Musicians", "description": "Zimura Is Staggering Towards Its Death: Macheso Slams Organisation Over Lies & Unfair Treatment Of Musicians Zimura is staggering towards its death, Alick Macheso has declared, as he slammed the organisation over alleged lies and what he described as unfair treatment of musicians. The sungura legend said he is “embarrassed” by the turmoil rocking the [...]The post ZIMURA Is Dying: Alick Macheso Threatens To Quit Over Funeral Lies & Unfair Treatment Of Musicians appeared first on iHarare News.", "url": "https://iharare.com/zimura-is-dying-alick-macheso-threatens-to-quit-over-funeral-lies-unfair-treatment-of-musicians/", "image": "", "publishedAt": "2026-03-01 08:52:38", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Permanent secretary sits on board of company regulated by his ministry", "description": "Shareholder pressure on industry ministry secretary over dual role Source: Permanent secretary sits on board of company regulated by his ministry – Zimbabwe News Now Thomas Utete Wushe HARARE – The permanent secretary in the ministry of industry and trade has retained his position on the board of a private company regulated by his ministry, [...]The post Permanent secretary sits on board of company regulated by his ministry appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/permanent-secretary-sits-on-board-of-company-regulated-by-his-ministry/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/03/IMG_5664-1200x800-1.jpeg", "publishedAt": "2026-03-01 08:46:36", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Funds Unlocked: Zimbabwe To Recruit 3 000 Teachers In March, Ex-Staff Encouraged To Apply", "description": "Zimbabwe To Recruit 3 000 Teachers In March, Former Educators Encouraged To Apply Harare – A massive government recruitment drive kicks off tomorrow to fill 3 000 teaching posts across the nation, with a special plea for former educators who abandoned the classroom to return to the chalkboard. The Public Service Commission (PSC) has confirmed [...]The post Funds Unlocked: Zimbabwe To Recruit 3 000 Teachers In March, Ex-Staff Encouraged To Apply appeared first on iHarare News.", "url": "https://iharare.com/zimbabwe-to-recruit-3-000-teachers-in-march-ex-staff-encouraged-to-apply/", "image": "", "publishedAt": "2026-03-01 08:35:31", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Minister Says Private Schools Teaching French And Chinese Must Teach Zimbabwean History & Local Languages", "description": "Private Schools Teaching French, Chinese Must Teach Zimbabwean History And Local Languages The Government has directed that private schools in Zimbabwe, which offer instruction in French and Chinese, must now also teach Zimbabwean history and local languages. The move seeks to ensure that learners in all institutions are grounded in the country’s heritage. Minister of [...]The post Minister Says Private Schools Teaching French And Chinese Must Teach Zimbabwean History & Local Languages appeared first on iHarare News.", "url": "https://iharare.com/private-schools-teaching-french-chinese-must-teach-zimbabwean-history-and-local-languages/", "image": "", "publishedAt": "2026-03-01 08:15:59", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "T20 WC: SA's Maphaka, Nortje Strike Early Raza Stands Tall For ZIM", "description": "(MENAFN - AsiaNet News) Zimbabwe struggled to post a competitive total while batting first against South Africa in their final Super 8 fixture in the ongoing T20 World Cup. Early breakthroughs by ...", "url": "https://menafn.com/1110805450/T20-WC-SAs-Maphaka-Nortje-Strike-Early-Raza-Stands-Tall-For-ZIM", "image": "https://menafn.com/updates/pr/2026-03/01/AN_19f3aimage_story.jpg", "publishedAt": "2026-03-01 08:07:45", "source": "Menafn", "_source_api": "Newsdata.io"}]}