{"articles": [{"title": "Rising anger over ‘lop-sided’ and ‘immoral’ US health funding pacts with African countries", "description": "Zimbabwe refuses to sign agreement and Kenya faces a court case over data sharing as new aid deals come under scrutiny", "url": "https://www.theguardian.com/global-development/2026/feb/27/rising-anger-over-lop-sided-immoral-us-health-funding-pacts-africa-countries", "image": "https://media.guim.co.uk/052f71618f81a5e32d654d7d911f9002cd98f9e0/967_502_3452_2762/500.jpg", "publishedAt": "2026-02-27T07:00:34Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "Duty comes first: President", "description": "Zvamaida Murwira Senior Reporter MILITARY service will always come first over one’s personal interests, because a soldier must be ready to defend the country’s territorial integrity and hard-won independence, President...The post Duty comes first: President appeared first on herald.", "url": "https://www.heraldonline.co.zw/duty-comes-first-president/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/02/PP1.jpg", "publishedAt": "2026-02-27 22:10:42", "source": "The Herald", "_source_api": "Newsdata.io"}, {"title": "RBZ announces measures to boost ZiG, price stability", "description": "Senior Business Reporter THE Reserve Bank of Zimbabwe has announced several key monetary policy interventions, including slashing many bank charges and refining the foreign exchange trading regime as part of...The post RBZ announces measures to boost ZiG, price stability appeared first on herald.", "url": "https://www.heraldonline.co.zw/rbz-announces-measures-to-boost-zig-price-stability/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/02/JM1.jpg", "publishedAt": "2026-02-27 22:09:37", "source": "The Herald", "_source_api": "Newsdata.io"}], "more": [{"title": "How the Skeleton of Mutapa Times is Based on Sarah Charlesworth's Work", "description": "Conceptual artist Sarah Charlesworth's 1979 study of how newspapers covered a solar eclipse inspired the framework behind The Mutapa Times.", "url": "article.html?slug=2020-04-20-how-the-skeleton-of-mutapa-times-is-based-on-sarah-charlesworths-work", "image": "/img/uploads/imageedit_1_5381951801.jpg", "publishedAt": "2020-04-20T00:00:00.000Z", "source": "The Mutapa Times", "cms": true}, {"title": "Urban farming couple demonstrates power of small-scale agriculture", "description": "Judith Phiri, judith.phiri@sundaynews.co.zw AN urban farming couple in Bulawayo’s Buena Vista suburb, Mr Kay Shiri (71) and Mrs Beauty Shiri (66), are setting an example by maximising their small plot to grow crops that support food security and livelihoods. Urban agriculture in Zimbabwe has grown phenomenally in recent years, evolving from small-scale subsistence gardening into a [...]The post Urban farming couple demonstrates power of small-scale agriculture appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/urban-farming-couple-demonstrates-power-of-small-scale-agriculture/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/03/tyre.jpg", "publishedAt": "2026-03-01 05:44:10", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "New teacher recruitment drive begins tomorrow", "description": "Zimpapers Reporter A NATIONWIDE teacher recruitment drive will begin tomorrow across all 10 provinces to fill staffing gaps in public schools, following the release of funding for the exercise by Treasury. The Public Service Commission (PSC) has previously indicated that it plans to recruit 3 000 teachers during the first three months of this year. [...]The post New teacher recruitment drive begins tomorrow appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/new-teacher-recruitment-drive-begins-tomorrow/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/sites/2/2023/12/torerayi-moyo.jpg", "publishedAt": "2026-03-01 05:43:18", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "RBZ measures put more money back into people’s pockets", "description": "Rumbidzayi Zinyuke Senior Reporter Zimbabweans are set to benefit from sweeping reductions in bank charges after the Reserve Bank of Zimbabwe (RBZ) moved to cut balance inquiry fees, Point of Sale (POS) transaction costs and cash withdrawal charges, easing the financial burden on depositors and small businesses. The measures are expected to bring relief to [...]The post RBZ measures put more money back into people’s pockets appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/rbz-measures-put-more-money-back-into-peoples-pockets/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/sites/2/2018/03/0811-1-1-RBZ-BUILDING.jpg", "publishedAt": "2026-03-01 05:42:28", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Multi-mineral ores targeted . . . Govt moves to plug revenue leakages", "description": "Debra Matabvu THE recent suspension of exports of raw minerals and lithium concentrates is meant to prevent the smuggling of multi-mineral ores that would have been intentionally misdeclared as a single, lower-value or less-regulated minerals, enabling traffickers to bypass export restrictions, avoid taxes and conceal the presence of high-value resources, it has been revealed. The [...]The post Multi-mineral ores targeted . . . Govt moves to plug revenue leakages appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/multi-mineral-ores-targeted-govt-moves-to-plug-revenue-leakages/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/02/BrowserPreview_tmp-13-5.jpg", "publishedAt": "2026-03-01 05:40:54", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "193k benefit from Zimbabwe Resilience Building Fund", "description": "Sukulwenkosi Dube-Matutu, Mat South Bureau ABOUT 193 000 people from three districts in the country are set to benefit from the Zimbabwe Resilience Building Fund Phase 2 (ZRBF 2) Reclaim Project, which seeks to strengthen climate resilience and ensure sustainable livelihoods among vulnerable rural communities. Speaking on Wednesday during a ZRBF 2 Matabeleland South sensitisation [...]The post 193k benefit from Zimbabwe Resilience Building Fund appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/193k-benefit-from-zimbabwe-resilience-building-fund/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/03/Untitled-3-3.jpg", "publishedAt": "2026-03-01 05:39:30", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "City must fix water infrastructure to attract green investment — Councillor Coltart", "description": "Sikhumbuzo Moyo, Senior Reporter THE City of Bulawayo cannot attract green investment or sustain eco-industries without first addressing its water infrastructure challenges, Mayor Councillor David Coltart has said. Clr Coltart made the remarks during a Trade Effluent and Water Recycling Indaba organised by the Bulawayo City Council last week. The two-day workshop ran under the [...]The post City must fix water infrastructure to attract green investment — Councillor Coltart appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/city-must-fix-water-infrastructure-to-attract-green-investment-councillor-coltart/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2025/08/fr.jpg", "publishedAt": "2026-03-01 05:35:43", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "New classroom block transforms learning at Mberengwa school", "description": "Patrick Chitumba, Midlands Bureau MARY Nyoni, a Grade Five pupil at Gomututu Secondary School in Mberengwa East constituency, can finally bid farewell to lessons held in the scorching sun. A new classroom block, funded through the Constituency Development Fund (CDF), has been completed, offering a safer and more comfortable learning environment for her and her [...]The post New classroom block transforms learning at Mberengwa school appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/new-classroom-block-transforms-learning-at-mberengwa-school/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2025/12/fgrft.jpg", "publishedAt": "2026-03-01 05:34:45", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Redcliff slashes 2026 budget", "description": "Midlands Bureau THE Redcliff Municipality has reduced its 2026 budget to US$19 million, down from US$25 million the previous year, as part of efforts to align expenditure with available revenue while maintaining efficient service delivery. Redcliff Municipality public relations manager, Mr Michael Magoronga, confirmed the development. “The Municipality of Redcliff is pleased to announce that [...]The post Redcliff slashes 2026 budget appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/redcliff-slashes-2026-budget/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/site//3/The-motorised-grade-that-Redcliff-Municipality-received-from-Livetouch-Investments-as-part-of-a-land-deal6.jpg", "publishedAt": "2026-03-01 05:33:40", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "‘Mentor, employ young graduates to drive economic transformation’", "description": "Thupeyo Muleya, Beitbridge Bureau MINISTER of Youth Empowerment, Development and Vocational Training, Cde Tinoda Machakaire, has emphasised the importance of skills development in driving Zimbabwe’s economic growth and transformation. Speaking at the “Skills2Live and Knows No-Borders Project” graduation ceremony in Beitbridge on Thursday, the minister highlighted the Government’s commitment to empowering youth through vocational training. [...]The post ‘Mentor, employ young graduates to drive economic transformation’ appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/mentor-employ-young-graduates-to-drive-economic-transformation/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/site//2/Tinoda-Machakaire-.jpg", "publishedAt": "2026-03-01 05:32:57", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe lands major UN tourism events", "description": "By Xinhua ZIMBABWE’S profile in global tourism governance is set to rise as the country is expected to host major United Nations (UN) tourism events this year, the country’s Information, Publicity and Broadcasting Services Minister Zhemu Soda said. Speaking at a post-cabinet media briefing on Tuesday in Harare, Soda said the events will include the [...]The post Zimbabwe lands major UN tourism events appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/zimbabwe-lands-major-un-tourism-events/", "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2026/03/01052059/Screenshot_20260301-065723_3.jpg", "publishedAt": "2026-03-01 05:21:55", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "RBZ governor says still early days to reduce 35% interest rate", "description": "THE Reserve Bank of Zimbabwe (RBZ) has defended its position of maintaining the Bank Policy Rate at 35% arguing that it is still early days to shift it downwards. A bank policy rate or key interest rate is the benchmark interest rate set by a central bank to implement its monetary policy and influence the [...]The post RBZ governor says still early days to reduce 35% interest rate appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/rbz-says-still-early-days-to-reduce-35-interest-rate/", "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171559/mushayavanhu-rbz.jpg", "publishedAt": "2026-03-01 00:04:08", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Affidavit blunder sinks ex-cop’s court bid to challenge dismissal", "description": "A FORMER Zimbabwe Republic Police (ZRP) officer’s challenge against dismissal has collapsed after the High Court struck off his opposing affidavit and ruled that his own application was filed too late and had no merit. William Nengwekuru took the Police Service Commission and the Commissioner-General of Police to court, seeking a review of the decision [...]The post Affidavit blunder sinks ex-cop’s court bid to challenge dismissal appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/affidavit-blunder-sinks-ex-cops-court-bid-to-challenge-dismissal/", "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/07061214/high-court.jpg", "publishedAt": "2026-03-01 00:01:27", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "RBZ currency move must boost liquidity", "description": "THE Reserve Bank of Zimbabwe (RBZ) on Friday unveiled its 2026 Monetary Policy Statement, a document that signals both a coming-of-age for... To access this content, please purchase a subscription by clicking the button below and select a package of your choice!Subscriptions", "url": "https://dailynews.co.zw/rbz-currency-move-must-boost-liquidity/", "image": "", "publishedAt": "2026-03-01 00:00:00", "source": "Dailynews", "_source_api": "Newsdata.io"}, {"title": "Rich pickings for Scottland", "description": "ZIMBABWE league champions, Scottland netted at least US$2,5 million during the club’s high-profile kit unveiling ceremony held in Harare on Friday night.The... To access this content, please purchase a subscription by clicking the button below and select a package of your choice!Subscriptions", "url": "https://dailynews.co.zw/rich-pickings-for-scottland/", "image": "", "publishedAt": "2026-03-01 00:00:00", "source": "Dailynews", "_source_api": "Newsdata.io"}, {"title": "UK, EU buyers scout Zim horticulture", "description": "EIGHT European buyers will be in Zimbabwe this week to scout 11 horticulture firms for potential export deals to international markets.The trade... To access this content, please purchase a subscription by clicking the button below and select a package of your choice!Subscriptions", "url": "https://dailynews.co.zw/uk-eu-buyers-scout-zim-horticulture/", "image": "", "publishedAt": "2026-02-28 23:58:00", "source": "Dailynews", "_source_api": "Newsdata.io"}]}