{"articles": [{"title": "Zimbabwean breakout at T20 World Cup has fans rejoicing renaissance", "description": "Swelling fanbase has been in dreamland this past month as Zimbabwe have defied all expectations in the competition", "url": "https://www.theguardian.com/sport/2026/feb/25/zimbabwe-breakout-cricket-world-cup-supporters-rejoicing-renaissance", "image": "https://media.guim.co.uk/57170b6bfd404a0e029eb92825e336f3452038e3/183_0_1827_1462/500.jpg", "publishedAt": "2026-02-25T10:05:15Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "Zimbabwe rejects 'lopsided' US health aid deal over data concerns", "description": "Access to biological samples raised flags for Zimbabwe as the US did not want to share the benefits of its research.", "url": "https://www.bbc.com/news/articles/cwy6nd3664no", "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6ada/live/d161dbc0-1249-11f1-b048-c9424b2cf5fd.jpg", "publishedAt": "2026-02-25 13:39:40", "source": "The Bbc", "_source_api": "Newsdata.io"}, {"title": "South African army men recover two vehicles being smuggled in flooded Limpopo River into Zimbabwe", "description": "Thupeyo Muleya South African National Defence Force members deployed to patrol the border with Zimbabwe have recovered a Toyota Land Cruiser worth around R1,5 million that was being smuggled out...The post South African army men recover two vehicles being smuggled in flooded Limpopo River into Zimbabwe appeared first on herald.", "url": "https://www.heraldonline.co.zw/south-african-army-men-recover-two-vehicles-being-smuggled-in-flooded-limpopo-river-into-zimbabwe/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/sites/2/2020/08/South-African-Flag.jpg", "publishedAt": "2026-02-24 15:42:36", "source": "The Herald", "_source_api": "Newsdata.io"}], "more": [{"title": "How the Skeleton of Mutapa Times is Based on Sarah Charlesworth's Work", "description": "Conceptual artist Sarah Charlesworth's 1979 study of how newspapers covered a solar eclipse inspired the framework behind The Mutapa Times.", "url": "article.html?slug=2020-04-20-how-the-skeleton-of-mutapa-times-is-based-on-sarah-charlesworths-work", "image": "/img/uploads/imageedit_1_5381951801.jpg", "publishedAt": "2020-04-20T00:00:00.000Z", "source": "The Mutapa Times", "cms": true}, {"title": "Robert Mugabe’s son charged with attempted murder over Johannesburg shooting", "description": "Bellarmine Chatunga Mugabe, known for lavish lifestyle, also accused of theft and being illegal immigrant after man allegedly shot in back", "url": "article.html?slug=2026-02-23-robert-mugabes-son-charged-with-attempted-murder-over-johann", "image": "https://media.guim.co.uk/a777e1c818970c0301f21b6c3d44c79e5163732c/99_0_3832_3066/500.jpg", "publishedAt": "2026-02-23T13:48:00", "source": "The Mutapa Times", "cms": true}, {"title": "Woman Arrested After Selling Mt Pleasant House And Depositing US$480K In Botswana", "description": "Harare Woman Arrested For Depositing US$48OK In Botswana After Selling Mt Pleasant House A Harare woman is in deep trouble after she allegedly sold her plush Mount Pleasant home and attempted to spirit away nearly three-quarters of the cash to Botswana, flouting the country’s exchange control laws. Sixty-five-year-old Evelyn Sarah Bengesa appeared before Harare regional magistrate [...]The post Woman Arrested After Selling Mt Pleasant House And Depositing US$480K In Botswana appeared first on iHarare News.", "url": "https://iharare.com/woman-arrested-after-selling-mt-pleasant-house-and-depositing-funds-in-botswana/", "image": "", "publishedAt": "2026-02-26 18:20:35", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe loses to India to record second T20 World Cup defeat", "description": "The Zimbabwe senior men’s cricket team suffered their second consecutive defeat at the ongoing ICC Men’s T20 World Cup after losing by 72 runs to hosts India on Thursday at the MA Chidambaram Stadium in Chennai. The Chevrons put up a spirited fight but were ultimately outplayed by India, who posted a formidable total of [...]The post Zimbabwe loses to India to record second T20 World Cup defeat appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/zimbabwe-loses-to-india-to-record-second-t20-world-cup-defeat/", "image": "", "publishedAt": "2026-02-26 18:13:55", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "UK connects Zimbabwean farmers with UK and European buyers", "description": "(Harare) – Eight buyers from the United Kingdom and European Union will visit 11 Zimbabwean farm and food businesses that have primed their horticulture products for exports through their work with the International Trade Centre (ITC). The trade mission is organised by the UK Trade Partnerships (UKTP) Programme, funded by the UK government and implemented by ITC.", "url": "https://www.thezimbabwean.co/2026/02/uk-connects-zimbabwean-farmers-with-uk-and-european-buyers/", "image": "https://www.thezimbabwean.co/wp-content/uploads/2024/08/zimbabwe-horticulture-1200x600-1.png", "publishedAt": "2026-02-26 18:09:36", "source": "The Zimbabwean", "_source_api": "Newsdata.io"}, {"title": "India thrash Zimbabwe in T20 World Cup, S.Africa into semi-finals", "description": "‘We are a work in progress’ - Sikandar RazaThe post India thrash Zimbabwe in T20 World Cup, S.Africa into semi-finals appeared first on Zimbabwe News Now.", "url": "https://www.zimlive.com/india-thrash-zimbabwe-in-t20-world-cup-s-africa-into-semi-finals/", "image": "https://www.zimlive.com/wp-content/uploads/2026/02/IMG_5668.jpeg", "publishedAt": "2026-02-26 17:57:12", "source": "Zimbabwean News", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe Govt Fires Back At Doctors Over Rejected US$367M US Health Aid Package", "description": "Zimbabwe Govt Responds After Doctors Urge Re-Engagement With US Over Rejected US$367M Health Aid Package A furious Zimbabwean government has accused the country’s top public health physicians of being “out of order” for intervening in an explosive diplomatic standoff with the United States over a rejected US$367 million (approximately R6.8 billion) health aid package. The [...]The post Zimbabwe Govt Fires Back At Doctors Over Rejected US$367M US Health Aid Package appeared first on iHarare News.", "url": "https://iharare.com/zimbabwe-govt-fires-back-at-doctors-over-rejected-us367m-us-health-aid-package/", "image": "", "publishedAt": "2026-02-26 17:34:40", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "New OK Zimbabwe Board Fails To Save Retail Giant From Collapse", "description": "By Business Reporter-Despite the appointment of a new board late last year, OK Zimbabwe Limited has formally entered corporate rescue ... Continue reading \"New OK Zimbabwe Board Fails To Save Retail Giant From Collapse\"", "url": "https://www.zimeye.net/2026/02/26/new-ok-zimbabwe-board-fails-to-save-retail-giant-from-collapse/", "image": "https://www.zimeye.net/wp-content/uploads/2026/02/Ok-Zimbabwe.webp", "publishedAt": "2026-02-26 17:00:00", "source": "Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Econet Shareholders Approve ZSE Exit and InfraCo Restructuring", "description": "Minority shareholders of Econet Wireless Zimbabwe Limited (both institutional and retail) have voted overwhelmingly to approve the group’s voluntary delisting from the...", "url": "https://dailynews.co.zw/econet-shareholders-approve-zse-exit-and-infraco-restructuring/", "image": "", "publishedAt": "2026-02-26 16:49:48", "source": "Dailynews", "_source_api": "Newsdata.io"}, {"title": "If Zimbabwe feels cheated by the US in health deal then why are we beggars and not funding our own programs?", "description": "Beggars are not choosers, it is said.", "url": "https://www.thezimbabwean.co/2026/02/if-zimbabwe-feels-cheated-by-the-us-in-health-deal-then-why-are-we-beggars-and-not-funding-our-own-programs/", "image": "https://www.thezimbabwean.co/wp-content/uploads/2026/02/file_000000008604722f8990ffbee81b35d8.png", "publishedAt": "2026-02-26 16:29:12", "source": "The Zimbabwean", "_source_api": "Newsdata.io"}, {"title": "US describes Zimbabwe aid cut as “regrettable” after US$367m deal collapse", "description": "HARARE – The United States (US) has announced plans to wind down its health assistance to Zimbabwe following the government’s decision to withdraw from negotiations on a proposed US$367 million health cooperation agreement, in a move Washington described as “difficult and regrettable. In a statement released by the US Embassy in Harare on Tuesday, Pamela [...]The post US describes Zimbabwe aid cut as “regrettable” after US$367m deal collapse appeared first on Nehanda Radio.", "url": "https://nehandaradio.com/2026/02/26/us-describes-zimbabwe-aid-cut-as-regrettable-after-us367m-deal-collapse/", "image": "https://nehandaradio.com/wp-content/uploads/2025/06/Pamela-Tremont.webp", "publishedAt": "2026-02-26 16:28:42", "source": "Nehanda Radio", "_source_api": "Newsdata.io"}, {"title": "Retail giant OK Zimbabwe runs out of money and placed under corporate rescue", "description": "HARARE – OK Zimbabwe Limited has entered corporate rescue after its US$30.5 million recapitalisation plan failed to close a critical funding gap, leaving the country’s largest listed supermarket group struggling under mounting supplier debt, declining revenues and worsening liquidity constraints. The move follows stalled property disposals meant to raise US$10.5 million and growing pressure from [...]The post Retail giant OK Zimbabwe runs out of money and placed under corporate rescue appeared first on Nehanda Radio.", "url": "https://nehandaradio.com/2026/02/26/retail-giant-ok-zimbabwe-runs-out-of-money-and-placed-under-corporate-rescue/", "image": "https://nehandaradio.com/wp-content/uploads/2025/10/OK-Zimbabwe.webp", "publishedAt": "2026-02-26 16:13:22", "source": "Nehanda Radio", "_source_api": "Newsdata.io"}, {"title": "OK Zimbabwe enters corporate rescue as suppliers withdraw support", "description": "Board appoints corporate rescue practitioner in last-ditch effort to save retail giantThe post OK Zimbabwe enters corporate rescue as suppliers withdraw support appeared first on Zimbabwe News Now.", "url": "https://www.zimlive.com/ok-zimbabwe-enters-corporate-rescue-as-suppliers-withdraw-support/", "image": "", "publishedAt": "2026-02-26 16:10:39", "source": "Zimbabwean News", "_source_api": "Newsdata.io"}, {"title": "Chippa United Snatch Warriors Defender", "description": "Sports Correspondent – South African side Chippa United have completed the signing of Zimbabwe international Isheanesu Mauchi, bolstering their defensive ... Continue reading \"Chippa United Snatch Warriors Defender\"", "url": "https://www.zimeye.net/2026/02/26/chippa-united-snatch-warriors-defender/", "image": "https://www.zimeye.net/wp-content/uploads/2020/12/Young-Warriors-3-scaled-1.jpg", "publishedAt": "2026-02-26 16:00:00", "source": "Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Chatunga Mugabe faces 15-year prison sentence in South Africa, BUT Grace Mugabe wants him back home for good", "description": "JOHANNESBURG — The youngest son of the late Zimbabwean strongman Robert Mugabe, Bellarmine Chatunga Mugabe, is currently languishing in a South African prison cell, facing a legal storm that could see him behind bars for up to 15 years. The 29-year-old, known more for his flamboyant lifestyle and champagne-drenched social media posts than for any [...]The post Chatunga Mugabe faces 15-year prison sentence in South Africa, BUT Grace Mugabe wants him back home for good first appeared on My Zimbabwe News.", "url": "https://www.myzimbabwe.co.zw/news/186031-chatunga-mugabe-faces-15-year-prison-sentence-in-south-africa-but-grace-mugabe-wants-him-back-home-for-good.html", "image": "https://www.myzimbabwe.co.zw/wp-content/uploads/2026/02/grace-mugabe-worred-chatunga-arrested.jpg", "publishedAt": "2026-02-26 15:36:08", "source": "My Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Liquid Resets Finances After Debt Repayment, Secures US$410m Fresh Funding", "description": "JOHANNESBURG – Liquid Intelligent Technologies has completed a significant refinancing exercise, repaying key debt facilities while lining up new funding to support expansion across Africa’s fast-evolving digital infrastructure landscape. The company, a subsidiary of Cassava Technologies, confirmed the full repayment of its South African rand term loan and US dollar revolving credit facility, a move [...]The post Liquid Resets Finances After Debt Repayment, Secures US$410m Fresh Funding appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/liquid-resets-finances-after-debt-repayment-secures-us410m-fresh-funding/", "image": "https://thezimbabwemail.com/wp-content/uploads/2025/12/Liquid-Telecoms-990x646.png", "publishedAt": "2026-02-26 14:32:35", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "Watch: Passion Java Claims Zim Dollar Shall Be At Par With US Dollar In 2040", "description": "Tinashe Sambiri – Controversial preacher Passion Java has once again made headlines, this time endorsing an extension of President Emmerson ... Continue reading \"Watch: Passion Java Claims Zim Dollar Shall Be At Par With US Dollar In 2040\"", "url": "https://www.zimeye.net/2026/02/26/watch-passion-java-claims-zim-dollar-shall-be-at-par-with-us-dollar-in-2040/", "image": "https://www.zimeye.net/wp-content/uploads/2026/02/IMG_20260225_062534.jpg", "publishedAt": "2026-02-26 14:30:00", "source": "Zimbabwe News", "_source_api": "Newsdata.io"}]}