{"articles": [{"title": "Rising anger over ‘lop-sided’ and ‘immoral’ US health funding pacts with African countries", "description": "Zimbabwe refuses to sign agreement and Kenya faces a court case over data sharing as new aid deals come under scrutiny", "url": "https://www.theguardian.com/global-development/2026/feb/27/rising-anger-over-lop-sided-immoral-us-health-funding-pacts-africa-countries", "image": "https://media.guim.co.uk/052f71618f81a5e32d654d7d911f9002cd98f9e0/967_502_3452_2762/500.jpg", "publishedAt": "2026-02-27T07:00:34Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "Zimbabwean breakout at T20 World Cup has fans rejoicing renaissance", "description": "Swelling fanbase has been in dreamland this past month as Zimbabwe have defied all expectations in the competition", "url": "https://www.theguardian.com/sport/2026/feb/25/zimbabwe-breakout-cricket-world-cup-supporters-rejoicing-renaissance", "image": "https://media.guim.co.uk/57170b6bfd404a0e029eb92825e336f3452038e3/183_0_1827_1462/500.jpg", "publishedAt": "2026-02-25T10:05:15Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "Zimbabwe rejects 'lopsided' US health aid deal over data concerns", "description": "Access to biological samples raised flags for Zimbabwe as the US did not want to share the benefits of its research.", "url": "https://www.bbc.com/news/articles/cwy6nd3664no", "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6ada/live/d161dbc0-1249-11f1-b048-c9424b2cf5fd.jpg", "publishedAt": "2026-02-25 13:39:40", "source": "The Bbc", "_source_api": "Newsdata.io"}], "more": [{"title": "How the Skeleton of Mutapa Times is Based on Sarah Charlesworth's Work", "description": "Conceptual artist Sarah Charlesworth's 1979 study of how newspapers covered a solar eclipse inspired the framework behind The Mutapa Times.", "url": "article.html?slug=2020-04-20-how-the-skeleton-of-mutapa-times-is-based-on-sarah-charlesworths-work", "image": "/img/uploads/imageedit_1_5381951801.jpg", "publishedAt": "2020-04-20T00:00:00.000Z", "source": "The Mutapa Times", "cms": true}, {"title": "Robert Mugabe’s son charged with attempted murder over Johannesburg shooting", "description": "Bellarmine Chatunga Mugabe, known for lavish lifestyle, also accused of theft and being illegal immigrant after man allegedly shot in back", "url": "article.html?slug=2026-02-23-robert-mugabes-son-charged-with-attempted-murder-over-johann", "image": "https://media.guim.co.uk/a777e1c818970c0301f21b6c3d44c79e5163732c/99_0_3832_3066/500.jpg", "publishedAt": "2026-02-23T13:48:00", "source": "The Mutapa Times", "cms": true}, {"title": "Chivayo pledges $1 million to Zimbabwe cricket team", "description": "He says it’s reward for qualifying to the Top EightsThe post Chivayo pledges $1 million to Zimbabwe cricket team appeared first on Zimbabwe News Now.", "url": "https://www.zimlive.com/chivayo-pledges-1-million-to-zimbabwe-cricket-team/", "image": "", "publishedAt": "2026-02-26 20:32:43", "source": "Zimbabwean News", "_source_api": "Newsdata.io"}, {"title": "'Minister Machakaire must first attend Chitepo School of Ideology'", "description": "Minister Tino Machakaire’s policy on first attending Hebert Chitepo School of Ideology and making it mandatory before one can get a job is intellectually lazy. Machakaire is detached from reality.The ...", "url": "https://bulawayo24.com/index-id-opinion-sc-columnist-byo-262454.html", "image": "https://img.bulawayo24.com/articles/bulawayo24.png", "publishedAt": "2026-02-26 20:23:13", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "Police block PPRIZ constitutional amendment bill discussion", "description": "Police in Bulawayo have reportedly blocked a public meeting organised by the Public Policy Research Institute of Zimbabwe (PPRIZ) to discuss Constitutional Amendment No. 3 Bill, 2026. The event had be...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262452.html", "image": "https://img.bulawayo24.com/articles/bulawayo24.png", "publishedAt": "2026-02-26 19:59:38", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "Bail ruling for detained journalist set for Friday", "description": "The bail ruling in the case of detained journalist Gideon Madzikatidze of Bulawayo24 will be delivered on Friday, 27 February 2026, at the Harare Magistrates’ Court.Magistrate Ruth Moyo reserved her r...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262451.html", "image": "https://img.bulawayo24.com/articles/bulawayo24.png", "publishedAt": "2026-02-26 19:56:02", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "Brian Bennett’s Heroic Unbeaten 97 In Vain As India Eliminate Zimbabwe From T20 World Cup", "description": "Brian Bennett Smashes 97 Against India But Zimbabwe Bow Out Of T20 World Cup A sensational unbeaten knock of 97 runs from Zimbabwe’s young sensation Brian Bennett was the only shining light in an otherwise dominant performance by India, who crushed the Chevrons by 72 runs at the T20 World Cup to book their spot [...]The post Brian Bennett’s Heroic Unbeaten 97 In Vain As India Eliminate Zimbabwe From T20 World Cup appeared first on iHarare News.", "url": "https://iharare.com/brian-bennetts-heroic-97-in-vain-as-india-eliminate-zimbabwe-from-t20-world-cup/", "image": "https://iharare.com/wp-content/uploads/2022/03/Brian-Bennet-Vs-India-2-EspnCricInfo-1280px-t.webp", "publishedAt": "2026-02-26 19:30:11", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "If Zimbabwe feels cheated by the US in health deal then why are we beggars and not funding our own programs?", "description": "Source: If Zimbabwe feels cheated by the US in health deal then why are we beggars and not funding our own programs? Beggars are not choosers, it is said. Tendai Ruben Mbofana There is a peculiar brand of arrogance that only a beggar who feels entitled to the contents of a benefactor’s wallet can truly [...]The post If Zimbabwe feels cheated by the US in health deal then why are we beggars and not funding our own programs? appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/if-zimbabwe-feels-cheated-by-the-us-in-health-deal-then-why-are-we-beggars-and-not-funding-our-own-programs/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/file_000000008604722f8990ffbee81b35d8-18.png", "publishedAt": "2026-02-26 19:29:58", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Constitutional Amendment Bill Number 3 Contribution", "description": "Source: Constitutional Amendment Bill Number 3 Contribution Dear Clerk of Parliament Parliament of ZimbabweThank you for inviting Zimbabweans to contribute giving their views on the recently gazetted Constitutional Amendment Bill Number three. I hope that Zimbabweans will overwhelmingly contribute, and that their views will be taken on Board. My view is that this Bill has [...]The post Constitutional Amendment Bill Number 3 Contribution appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/constitutional-amendment-bill-number-3-contribution/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/parliament-zimbabwe.jpg", "publishedAt": "2026-02-26 19:29:53", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Tungwarara accepted into the Zanu-PF Central Committee", "description": "Source: Tungwarara accepted into the Zanu-PF Central Committee – herald Joseph Madzimure Zimpapers Politics Hub The Politburo on Wednesday confirmed the cooption of Presidential Advisor, Paul Tungwarara, into the Central Committee for Manicaland province. He replaced Cde Doroth Mabika who was elected Zanu PF Manicaland provincial chairlady. Zanu PF secretary for information and publicity, Cde [...]The post Tungwarara accepted into the Zanu-PF Central Committee appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/tungwarara-accepted-into-the-zanu-pf-central-committee/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/Untitled-80.jpg", "publishedAt": "2026-02-26 19:29:45", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "City of Harare replaces water pipes", "description": "Source: City of Harare replaces water pipes – herald Diana Nherera The City of Harare is replacing water pipes along Merlewood Drive near ED Mnangagwa Road (formerly Enterprise Road). In a notice, acting town clerk, Engineer Phakamile Mabhena Moyo, said the pipe replacement works, which started on Tuesday, are expected to end on Saturday. “During [...]The post City of Harare replaces water pipes appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/city-of-harare-replaces-water-pipes/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/BrowserPreview_tmp-43-2.jpg", "publishedAt": "2026-02-26 19:29:01", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Minister Soda urges media to keep public informed to drive Vision 2030", "description": "Source: Minister Soda urges media to keep public informed to drive Vision 2030 – herald Wallace Ruzvidzo Herald Reporter Minister of Information, Publicity and Broadcasting Services Dr Zhemu Soda has stressed the vital role of the media in keeping Zimbabweans well informed, saying timely and accurate public information is essential to supporting the nation’s drive [...]The post Minister Soda urges media to keep public informed to drive Vision 2030 appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/minister-soda-urges-media-to-keep-public-informed-to-drive-vision-2030/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/BrowserPreview_tmp-60.jpg", "publishedAt": "2026-02-26 19:28:14", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Woman Arrested After Selling Mt Pleasant House And Depositing US$480K In Botswana", "description": "Harare Woman Arrested For Depositing US$48OK In Botswana After Selling Mt Pleasant House A Harare woman is in deep trouble after she allegedly sold her plush Mount Pleasant home and attempted to spirit away nearly three-quarters of the cash to Botswana, flouting the country’s exchange control laws. Sixty-five-year-old Evelyn Sarah Bengesa appeared before Harare regional magistrate [...]The post Woman Arrested After Selling Mt Pleasant House And Depositing US$480K In Botswana appeared first on iHarare News.", "url": "https://iharare.com/woman-arrested-after-selling-mt-pleasant-house-and-depositing-funds-in-botswana/", "image": "", "publishedAt": "2026-02-26 18:20:35", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe loses to India to record second T20 World Cup defeat", "description": "The Zimbabwe senior men’s cricket team suffered their second consecutive defeat at the ongoing ICC Men’s T20 World Cup after losing by 72 runs to hosts India on Thursday at the MA Chidambaram Stadium in Chennai. The Chevrons put up a spirited fight but were ultimately outplayed by India, who posted a formidable total of [...]The post Zimbabwe loses to India to record second T20 World Cup defeat appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/zimbabwe-loses-to-india-to-record-second-t20-world-cup-defeat/", "image": "", "publishedAt": "2026-02-26 18:13:55", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "UK connects Zimbabwean farmers with UK and European buyers", "description": "(Harare) – Eight buyers from the United Kingdom and European Union will visit 11 Zimbabwean farm and food businesses that have primed their horticulture products for exports through their work with the International Trade Centre (ITC). The trade mission is organised by the UK Trade Partnerships (UKTP) Programme, funded by the UK government and implemented by ITC.", "url": "https://www.thezimbabwean.co/2026/02/uk-connects-zimbabwean-farmers-with-uk-and-european-buyers/", "image": "https://www.thezimbabwean.co/wp-content/uploads/2024/08/zimbabwe-horticulture-1200x600-1.png", "publishedAt": "2026-02-26 18:09:36", "source": "The Zimbabwean", "_source_api": "Newsdata.io"}, {"title": "India thrash Zimbabwe in T20 World Cup, S.Africa into semi-finals", "description": "‘We are a work in progress’ - Sikandar RazaThe post India thrash Zimbabwe in T20 World Cup, S.Africa into semi-finals appeared first on Zimbabwe News Now.", "url": "https://www.zimlive.com/india-thrash-zimbabwe-in-t20-world-cup-s-africa-into-semi-finals/", "image": "https://www.zimlive.com/wp-content/uploads/2026/02/IMG_5668.jpeg", "publishedAt": "2026-02-26 17:57:12", "source": "Zimbabwean News", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe Govt Fires Back At Doctors Over Rejected US$367M US Health Aid Package", "description": "Zimbabwe Govt Responds After Doctors Urge Re-Engagement With US Over Rejected US$367M Health Aid Package A furious Zimbabwean government has accused the country’s top public health physicians of being “out of order” for intervening in an explosive diplomatic standoff with the United States over a rejected US$367 million (approximately R6.8 billion) health aid package. The [...]The post Zimbabwe Govt Fires Back At Doctors Over Rejected US$367M US Health Aid Package appeared first on iHarare News.", "url": "https://iharare.com/zimbabwe-govt-fires-back-at-doctors-over-rejected-us367m-us-health-aid-package/", "image": "", "publishedAt": "2026-02-26 17:34:40", "source": "Iharare News", "_source_api": "Newsdata.io"}]}