{"articles": [{"title": "Rising anger over ‘lop-sided’ and ‘immoral’ US health funding pacts with African countries", "description": "Zimbabwe refuses to sign agreement and Kenya faces a court case over data sharing as new aid deals come under scrutiny", "url": "https://www.theguardian.com/global-development/2026/feb/27/rising-anger-over-lop-sided-immoral-us-health-funding-pacts-africa-countries", "image": "https://media.guim.co.uk/052f71618f81a5e32d654d7d911f9002cd98f9e0/967_502_3452_2762/500.jpg", "publishedAt": "2026-02-27T07:00:34Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "Zimbabwean breakout at T20 World Cup has fans rejoicing renaissance", "description": "Swelling fanbase has been in dreamland this past month as Zimbabwe have defied all expectations in the competition", "url": "https://www.theguardian.com/sport/2026/feb/25/zimbabwe-breakout-cricket-world-cup-supporters-rejoicing-renaissance", "image": "https://media.guim.co.uk/57170b6bfd404a0e029eb92825e336f3452038e3/183_0_1827_1462/500.jpg", "publishedAt": "2026-02-25T10:05:15Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "Zimbabwe rejects 'lopsided' US health aid deal over data concerns", "description": "Access to biological samples raised flags for Zimbabwe as the US did not want to share the benefits of its research.", "url": "https://www.bbc.com/news/articles/cwy6nd3664no", "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6ada/live/d161dbc0-1249-11f1-b048-c9424b2cf5fd.jpg", "publishedAt": "2026-02-25 13:39:40", "source": "The Bbc", "_source_api": "Newsdata.io"}], "more": [{"title": "How the Skeleton of Mutapa Times is Based on Sarah Charlesworth's Work", "description": "Conceptual artist Sarah Charlesworth's 1979 study of how newspapers covered a solar eclipse inspired the framework behind The Mutapa Times.", "url": "article.html?slug=2020-04-20-how-the-skeleton-of-mutapa-times-is-based-on-sarah-charlesworths-work", "image": "/img/uploads/imageedit_1_5381951801.jpg", "publishedAt": "2020-04-20T00:00:00.000Z", "source": "The Mutapa Times", "cms": true}, {"title": "2 500 jobs in US$260m Varun deal . . . President poised to open firm’s new beer, snacks-making plants", "description": "Debra Matabvu-Senior Reporter VARUN Beverages Ltd has invested more than US$260 million in new beer and snacks manufacturing plants, set to be officially opened by President Mnangagwa in the coming months, as the company expands its food and beverage portfolio in Zimbabwe. The investment is part of a broader wave of foreign direct commitment into [...]The post 2 500 jobs in US$260m Varun deal . . . President poised to open firm’s new beer, snacks-making plants appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/2-500-jobs-in-us260m-varun-deal-president-poised-to-open-firms-new-beer-snacks-making-plants/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/02/President-and-Varun-bosses.jpg", "publishedAt": "2026-02-27 03:30:46", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Insiza farmers begin early preparations for ZITF livestock showcase", "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw FARMERS in Insiza District have begun preparations for this year’s Zimbabwe International Trade Fair (ZITF), with livestock producers already selecting and grooming animals for exhibition in what Government has described as a display of foresight and commercial discipline. Permanent Secretary in the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development, Professor Obert [...]The post Insiza farmers begin early preparations for ZITF livestock showcase appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/insiza-farmers-begin-early-preparations-for-zitf-livestock-showcase/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/02/ghhj.jpg", "publishedAt": "2026-02-27 03:15:42", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Government steps in to revive Mzinyathini Irrigation Scheme", "description": "Nothando Zondo, cherrelncz@gmail.com GOVERNMENT and its partners have come to the rescue of Mzinyathini Irrigation Scheme in Umzingwane District, with upgrade works underway in a move expected to improve food security in the area. The 45-hectare scheme, established in 1956 and historically reliant on a canal system drawing water from Umzingwane Dam, had been idle for [...]The post Government steps in to revive Mzinyathini Irrigation Scheme appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/government-steps-in-to-revive-mzinyathini-irrigation-scheme/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/02/fhfh-1.jpg", "publishedAt": "2026-02-27 03:13:23", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Rural dairy output rises as Presidential Silage Scheme bears fruit in Umzingwane", "description": "Nothando Zondo, cherrelncz@gmail.com GOVERNMENT efforts to industrialise rural communities through targeted dairy interventions are beginning to show tangible results in Mlomoliwoto, Umzingwane District. The Presidential Silage Inputs Scheme — introduced to improve both the quality and availability of livestock feed — has reshaped the local dairy sector by providing subsidised silage inputs, enabling farmers to maintain [...]The post Rural dairy output rises as Presidential Silage Scheme bears fruit in Umzingwane appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/rural-dairy-output-rises-as-presidential-silage-scheme-bears-fruit-in-umzingwane/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/02/Untitled-5-34.jpg", "publishedAt": "2026-02-27 03:12:27", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Mentors with a mission: Empowering girls to fight HIV and the odds", "description": "Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw THE role of mentoring adolescent girls and young women is not one being taken lightly by National Aids Council (NAC) Sista2Sista programme mentors as it involves safeguarding the youngsters against ills such as HIV infection, teenage pregnancies and Sexually Transmitted Infections (STIs). Under the programme, ambassadors have been trained to mentor 50 adolescent [...]The post Mentors with a mission: Empowering girls to fight HIV and the odds appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/mentors-with-a-mission-empowering-girls-to-fight-hiv-and-the-odds/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/02/Untitled-5-37.jpg", "publishedAt": "2026-02-27 03:11:35", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Teenage pregnancy in Mangwe: A tale of a people who have lost their collective soul", "description": "Father Hlakanipha Mbongolwane, hlaks1980@gmail.com MANGWE District in Matabeleland South Province is a rainbow district. While it is predominantly Kalanga-speaking, it is home to people from all walks of life. It is famed for amacimbi (mopane worms) and is strategically positioned with three borders — Matsilotje, Plumtree and Maitengwe. However, the district’s proximity to border points and [...]The post Teenage pregnancy in Mangwe: A tale of a people who have lost their collective soul appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/teenage-pregnancy-in-mangwe-a-tale-of-a-people-who-have-lost-their-collective-soul/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/02/Untitled-5-38.jpg", "publishedAt": "2026-02-27 03:10:33", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Councils fail to account for funds after ZINARA’s ZWG358 million disbursement for road maintenance", "description": "The Zimbabwe National Road Administration (ZINARA) disbursed over ZWG350 million to local authorities for road maintenance in 2025, but the lack of accountability by some councils has raised concerns over the utilisation of the funds. This was revealed by ZINARA Chief Executive Officer Nkosinathi Ncube during an appearance before the Parliamentary Portfolio Committee on Transport [...]The post Councils fail to account for funds after ZINARA’s ZWG358 million disbursement for road maintenance appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/councils-fail-to-account-for-funds-after-zinaras-zwg9billion-disbursement-for-road-maintenance/", "image": "", "publishedAt": "2026-02-27 00:05:04", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe owes Valterra Platinum $100 million in unpaid export proceeds", "description": "Reuters South Africa’s Valterra Platinum (VALJ.J), said on Wednesday it is owed $100 million in 2025 export proceeds by Zimbabwe’s government, which has started making some payments to clear the arrears. Zimbabwe requires all exporters to retain only 70% of their proceeds in foreign currency, with the balance being converted to local currency. Valterra and [...]The post Zimbabwe owes Valterra Platinum $100 million in unpaid export proceeds appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/zimbabwe-owes-valterra-platinum-100-million-in-unpaid-export-proceeds/", "image": "", "publishedAt": "2026-02-27 00:02:14", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe pushes manufacturers to use local raw materials under new strategy", "description": "Industry and Commerce Minister Dr Mangaliso Ndlovu has revealed that the government will soon roll out a Local Content Strategy aimed at promoting the use of locally manufactured raw materials in Zimbabwe’s manufacturing sector. The move comes as Zimbabwe continues to spend an estimated US$1.5 billion annually on industrial consumables, with basic imports such as [...]The post Zimbabwe pushes manufacturers to use local raw materials under new strategy appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/zimbabwe-pushes-manufacturers-to-use-local-raw-materials-under-new-strategy/", "image": "", "publishedAt": "2026-02-27 00:00:41", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "ZIMRA, Buy Zimbabwe in joint blitz to curb smuggling of goods", "description": "The Zimbabwe Revenue Authority (ZIMRA) and Buy Zimbabwe have intensified efforts to curb the smuggling of goods at various entry points, a practice identified as a major threat to local industry. Authorities in Zimbabwe have long struggled to combat the illegal importation of goods due to porous border posts and corruption. As a result, the [...]The post ZIMRA, Buy Zimbabwe in joint blitz to curb smuggling of goods appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/zimra-buy-zimbabwe-in-joint-blitz-to-curb-smuggling-of-goods/", "image": "", "publishedAt": "2026-02-27 00:00:26", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Pedros enters Zim, to create 600 jobs", "description": "Popular South African fast-food chain, Pedros Flame Grilled Chicken (Pedros), is set to enter the Zimbabwean market with plans to open 10...", "url": "https://dailynews.co.zw/pedros-enters-zim-to-create-600-jobs/", "image": "", "publishedAt": "2026-02-26 23:58:00", "source": "Dailynews", "_source_api": "Newsdata.io"}, {"title": "Africa’s Critical Minerals Moment: Why Zimbabwe’s Lithium Export Ban Signals a Continental Industrial Pivot", "description": "When Zimbabwe announced an immediate suspension on the export of raw lithium and other unprocessed minerals in late February 2026, the reaction was swift. Market traditionalists warned of distortion. Traders predicted supply disruptions. Some framed the move as economic nationalism. Yet to interpret Zimbabwe’s decision in isolation is to miss the structural shift underway across [...]The post Africa’s Critical Minerals Moment: Why Zimbabwe’s Lithium Export Ban Signals a Continental Industrial Pivot appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/africas-critical-minerals-moment-why-zimbabwes-lithium-export-ban-signals-a-continental-industrial-pivot/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/02/Zimbabwe-lithium.jpeg", "publishedAt": "2026-02-26 22:37:29", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "Econet to Delist from ZSE as Masiyiwa Unveils US$3 Billion AI and Infrastructure Vision", "description": "HARARE – Shareholders of Econet Wireless Zimbabwe have voted to delist the telecommunications group from the Zimbabwe Stock Exchange (ZSE), drawing the curtain on a 26-year chapter as a publicly traded company and signalling a strategic pivot towards an ambitious US$3 billion technology and infrastructure expansion. The resolution was approved at an extraordinary general meeting in [...]The post Econet to Delist from ZSE as Masiyiwa Unveils US$3 Billion AI and Infrastructure Vision appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/econet-to-delist-from-zse-as-masiyiwa-unveils-us3-billion-ai-and-infrastructure-vision/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/02/Econet-InfraCo.jpg", "publishedAt": "2026-02-26 22:21:17", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "Chivayo pledges $1 million to Zimbabwe cricket team", "description": "He says it’s reward for qualifying to the Top EightsThe post Chivayo pledges $1 million to Zimbabwe cricket team appeared first on Zimbabwe News Now.", "url": "https://www.zimlive.com/chivayo-pledges-1-million-to-zimbabwe-cricket-team/", "image": "", "publishedAt": "2026-02-26 20:32:43", "source": "Zimbabwean News", "_source_api": "Newsdata.io"}, {"title": "'Minister Machakaire must first attend Chitepo School of Ideology'", "description": "Minister Tino Machakaire’s policy on first attending Hebert Chitepo School of Ideology and making it mandatory before one can get a job is intellectually lazy. Machakaire is detached from reality.The ...", "url": "https://bulawayo24.com/index-id-opinion-sc-columnist-byo-262454.html", "image": "https://img.bulawayo24.com/articles/bulawayo24.png", "publishedAt": "2026-02-26 20:23:13", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}]}