{"articles": [{"title": "Rising anger over ‘lop-sided’ and ‘immoral’ US health funding pacts with African countries", "description": "Zimbabwe refuses to sign agreement and Kenya faces a court case over data sharing as new aid deals come under scrutiny", "url": "https://www.theguardian.com/global-development/2026/feb/27/rising-anger-over-lop-sided-immoral-us-health-funding-pacts-africa-countries", "image": "https://media.guim.co.uk/052f71618f81a5e32d654d7d911f9002cd98f9e0/967_502_3452_2762/500.jpg", "publishedAt": "2026-02-27T07:00:34Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "Duty comes first: President", "description": "Zvamaida Murwira Senior Reporter MILITARY service will always come first over one’s personal interests, because a soldier must be ready to defend the country’s territorial integrity and hard-won independence, President...The post Duty comes first: President appeared first on herald.", "url": "https://www.heraldonline.co.zw/duty-comes-first-president/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/02/PP1.jpg", "publishedAt": "2026-02-27 22:10:42", "source": "The Herald", "_source_api": "Newsdata.io"}, {"title": "RBZ announces measures to boost ZiG, price stability", "description": "Senior Business Reporter THE Reserve Bank of Zimbabwe has announced several key monetary policy interventions, including slashing many bank charges and refining the foreign exchange trading regime as part of...The post RBZ announces measures to boost ZiG, price stability appeared first on herald.", "url": "https://www.heraldonline.co.zw/rbz-announces-measures-to-boost-zig-price-stability/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/02/JM1.jpg", "publishedAt": "2026-02-27 22:09:37", "source": "The Herald", "_source_api": "Newsdata.io"}], "more": [{"title": "How the Skeleton of Mutapa Times is Based on Sarah Charlesworth's Work", "description": "Conceptual artist Sarah Charlesworth's 1979 study of how newspapers covered a solar eclipse inspired the framework behind The Mutapa Times.", "url": "article.html?slug=2020-04-20-how-the-skeleton-of-mutapa-times-is-based-on-sarah-charlesworths-work", "image": "/img/uploads/imageedit_1_5381951801.jpg", "publishedAt": "2020-04-20T00:00:00.000Z", "source": "The Mutapa Times", "cms": true}, {"title": "The Silent Purge: Why Top ZANU-PF and Police Officials are Suddenly “Retiring” Before 2030", "description": "By Investigative Correspondent HARARE — The corridors of power at the ZANU-PF headquarters in Harare are usually alive with the hum of political machinations, but lately, a different kind of sound has taken over: the quiet, methodical clicking of a door being locked from the inside. As the ruling party intensifies its push for a [...]The post The Silent Purge: Why Top ZANU-PF and Police Officials are Suddenly “Retiring” Before 2030 first appeared on My Zimbabwe News.", "url": "https://www.myzimbabwe.co.zw/news/186073-the-silent-purge-why-top-zanu-pf-and-police-officials-are-suddenly-retiring-before-2030.html", "image": "https://www.myzimbabwe.co.zw/wp-content/uploads/2024/11/mnangagwa-and-police-commissioner-general-godwin-maanga.jpg", "publishedAt": "2026-02-28 08:51:12", "source": "My Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "ZACC Arrests Businessman Over Alleged Grocery Smuggling", "description": "The Zimbabwe Anti-Corruption Commission (ZACC) has arrested a company director accused of masterminding a grocery smuggling scheme that allegedly prejudiced the Zimbabwe Revenue Authority (ZIMRA) of nearly ZAR3 million in unpaid import duty. In a statement, ZACC confirmed the arrest of Profutunny Investments (Pvt) Ltd [...]The post ZACC Arrests Businessman Over Alleged Grocery Smuggling appeared first on 263Chat.", "url": "https://www.263chat.com/zacc-arrests-businessman-over-alleged-grocery-smuggling/", "image": "https://www.263chat.com/wp-content/uploads/2021/08/arrested-handcuffed.jpg", "publishedAt": "2026-02-28 08:42:17", "source": "263chat", "_source_api": "Newsdata.io"}, {"title": "Zim Doc Says “Don’t Rinse After Brushing,” Social Media Goes Wild 🦷🔥", "description": "By Dorrothy Moyo | 🦷 Zimbabwean Doctor Sparks Online Debate Over “No Rinse” Toothbrushing Advice Harare, Zimbabwe – A Zimbabwean ... Continue reading \"Zim Doc Says “Don’t Rinse After Brushing,” Social Media Goes Wild 🦷🔥\"", "url": "https://www.zimeye.net/2026/02/28/zim-doc-says-dont-rinse-after-brushing-social-media-goes-wild-%F0%9F%A6%B7%F0%9F%94%A5/", "image": "https://www.zimeye.net/wp-content/uploads/2026/02/IMG_0410.jpeg", "publishedAt": "2026-02-28 08:30:13", "source": "Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Scottland FC Jersey Signed by President Mnangagwa Sells for US$1 Million", "description": "Scottland FC Jersey Signed by President Mnangagwa Sells for US$1 Million A Scottland FC jersey signed by President Emmerson Mnangagwa has been purchased for an astonishing US$1 million in what has been described as a historic and symbolic transaction. The jersey was jointly acquired by Sakunda Holdings and Fossil Contracting, marking a rare convergence of [...]The post Scottland FC Jersey Signed by President Mnangagwa Sells for US$1 Million appeared first on iHarare News.", "url": "https://iharare.com/scottland-fc-jersey-signed-by-president-mnangagwa-sells-for-us1-million/", "image": "", "publishedAt": "2026-02-28 08:29:56", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "ZELO hails govt ban on lithium concentrate export", "description": "The Zimbabwe Environmental Law Organisation (ZELO) has welcomed the Government’s decision to ban the export of lithium concentrate, saying the move will help curb mineral leakages and strengthen accou...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262512.html", "image": "https://img.bulawayo24.com/articles/lithium_ore.jpg", "publishedAt": "2026-02-28 07:06:04", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "VP Mohadi to officiate at ASI Convention at Solusi University", "description": "Amos Mpofu, mpofuamos41@gmail.com Vice President Kembo Mohadi, is today expected to officiate at the 2026 Annual Convention of the Adventist-Laymen’s Services and Industries (ASI) under the Zimbabwe West Union Conference (ZWUC)...The post VP Mohadi to officiate at ASI Convention at Solusi University appeared first on herald.", "url": "https://www.heraldonline.co.zw/vp-mohadi-to-officiate-at-asi-convention-at-solusi-university/", "image": "", "publishedAt": "2026-02-28 07:05:18", "source": "H-metro", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe’s manufactured exports surge to US$571 million", "description": "Amos Mpofu, mpofuamos41@gmail.com ZIMBABWE has recorded a sharp rise in locally manufactured goods and export earnings, with Government reaffirming its commitment to building an export-driven, youth-powered economy. An estimated 80...The post Zimbabwe’s manufactured exports surge to US$571 million appeared first on herald.", "url": "https://www.heraldonline.co.zw/zimbabwes-manufactured-exports-surge-to-us571-million/", "image": "", "publishedAt": "2026-02-28 06:54:06", "source": "H-metro", "_source_api": "Newsdata.io"}, {"title": "ZiG’s Secret Death Warrant: The Real Reason Why 2030 Mono-Currency Plot and US-Dollar Ban Deadline Were Scrapped", "description": "In a move that has quietly reverberated through Zimbabwe’s financial landscape, the Reserve Bank of Zimbabwe (RBZ) recently executed a monumental U-turn, abandoning its long-held 2030 deadline for the nation’s return to a single, local currency. While official pronouncements from the central bank cite the pursuit of “market stability” and “business confidence” as the primary [...]The post ZiG’s Secret Death Warrant: The Real Reason Why 2030 Mono-Currency Plot and US-Dollar Ban Deadline Were Scrapped first appeared on My Zimbabwe News.", "url": "https://www.myzimbabwe.co.zw/news/186071-zigs-secret-death-warrant-the-real-reason-why-2030-mono-currency-plot-and-us-dollar-ban-deadline-were-scrapped.html", "image": "https://www.myzimbabwe.co.zw/wp-content/uploads/2024/08/john-mushayavanhu-rbz-govenor.jpg", "publishedAt": "2026-02-28 06:46:54", "source": "My Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Churches sound alarm over Mnangagwa term extension plan", "description": "Amendments will ‘deeply wound the nation’s trust and the moral standing of the Second Republic’The post Churches sound alarm over Mnangagwa term extension plan appeared first on Zimbabwe News Now.", "url": "https://www.zimlive.com/churches-sound-alarm-over-mnangagwa-term-extension-plan/", "image": "https://www.zimlive.com/wp-content/uploads/2025/02/E46FD900-C7A7-4A0E-8A8E-C7D2EC3D1D27.jpeg", "publishedAt": "2026-02-28 06:29:15", "source": "Zimbabwean News", "_source_api": "Newsdata.io"}, {"title": "The 2030 “Constitutional Coup”: Why the New 7-Year Term is a Trap for Zimbabweans", "description": "HARARE – A controversial constitutional amendment is quietly reshaping Zimbabwe’s political landscape, a move critics are decrying as a “third term by stealth” and a “constitutional coup.” While the ruling ZANU-PF party defends the proposal as a necessary measure for stability and continued development, a deeper investigation reveals a calculated strategy to entrench President Emmerson [...]The post The 2030 “Constitutional Coup”: Why the New 7-Year Term is a Trap for Zimbabweans first appeared on My Zimbabwe News.", "url": "https://www.myzimbabwe.co.zw/news/186068-the-2030-constitutional-coup-why-the-new-7-year-term-is-a-trap-for-zimbabweans.html", "image": "https://www.myzimbabwe.co.zw/wp-content/uploads/2026/02/General-Chiwenga-angry-ziyambi-ziyambi-mnangagwa-laughing.jpg", "publishedAt": "2026-02-28 06:00:10", "source": "My Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "RBZ Drops 2030 Deadline for Multi-Currency Exit, Sets Economic Conditions for ZiG Transition", "description": "RBZ Drops 2030 Deadline for Multi-Currency Exit, Sets Economic Conditions for ZiG Transition The Reserve Bank of Zimbabwe (RBZ) has scrapped its fixed 2030 deadline for ending the multi-currency system, signalling a major policy shift as authorities move toward a conditions-based approach before adopting a monocurrency regime. RBZ Governor John Mushayavanhu said the central bank [...]The post RBZ Drops 2030 Deadline for Multi-Currency Exit, Sets Economic Conditions for ZiG Transition appeared first on iHarare News.", "url": "https://iharare.com/rbz-drops-2030-deadline-for-multi-currency-exit-sets-economic-conditions-for-zig-transition/", "image": "", "publishedAt": "2026-02-28 05:37:44", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "THE FALL OF A STAR: Gift Amuli’s US$4,000 Fraud Storm and the Dark Side of the Music Industry", "description": "HARARE – The Zimbabwean music industry, a vibrant but often challenging landscape for its artists, finds itself grappling with a scandal that has cast a harsh light on its underlying struggles. At the centre of this storm is the legendary “Wamatakas” hitmaker, Gift Amuli, now embroiled in a US$4,000 fraud allegation that has left many [...]The post THE FALL OF A STAR: Gift Amuli’s US$4,000 Fraud Storm and the Dark Side of the Music Industry first appeared on My Zimbabwe News.", "url": "https://www.myzimbabwe.co.zw/entertainment/186065-the-fall-of-a-star-gift-amulis-us4000-fraud-storm-and-the-dark-side-of-the-music-industry.html", "image": "https://www.myzimbabwe.co.zw/wp-content/uploads/2026/02/gift-amuli.jpg", "publishedAt": "2026-02-28 05:32:18", "source": "My Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe’s processing for white gold deepens with another sulphate plant", "description": "Construction for another lithium sulphate plant in Zimbabwe has begun, as demand for lithium globally continues to surge.", "url": "https://www.thezimbabwean.co/2026/02/zimbabwes-processing-for-white-gold-deepens-with-another-sulphate-plant/", "image": "", "publishedAt": "2026-02-28 05:22:54", "source": "The Zimbabwean", "_source_api": "Newsdata.io"}, {"title": "Mpilo Hospital seeks new Chief Medical Officer", "description": "Source: Mpilo Hospital seeks new Chief Medical Officer – CITEZW Mpilo Central Hospital in Bulawayo The Ministry of Health and Child Care has advertised several senior positions in its latest internal vacancy circulars, including the substantive post of Chief Medical Officer (CMO) at Mpilo Central Hospital in Bulawayo. The vacancy arises following the retirement of Dr [...]The post Mpilo Hospital seeks new Chief Medical Officer appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/mpilo-hospital-seeks-new-chief-medical-officer/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/Mpilo-Hospital.jpg", "publishedAt": "2026-02-28 05:08:27", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Castle Lager Premiership", "description": "Zimbabwe Premier Soccer League season 2025/26 : Find Fixtures, results, latest table, statistics and Latest news all hereThe post Castle Lager Premiership appeared first on Soccer24.", "url": "https://www.soccer24.co.zw/2026/02/28/castle-lager-premiership/", "image": "", "publishedAt": "2026-02-28 00:32:30", "source": "Soccer24", "_source_api": "Newsdata.io"}]}