{"articles": [{"title": "Zimbabwean breakout at T20 World Cup has fans rejoicing renaissance", "description": "Swelling fanbase has been in dreamland this past month as Zimbabwe have defied all expectations in the competition", "url": "https://www.theguardian.com/sport/2026/feb/25/zimbabwe-breakout-cricket-world-cup-supporters-rejoicing-renaissance", "image": "https://media.guim.co.uk/57170b6bfd404a0e029eb92825e336f3452038e3/183_0_1827_1462/500.jpg", "publishedAt": "2026-02-25T10:05:15Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "Zimbabwe rejects 'lopsided' US health aid deal over data concerns", "description": "Access to biological samples raised flags for Zimbabwe as the US did not want to share the benefits of its research.", "url": "https://www.bbc.com/news/articles/cwy6nd3664no", "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6ada/live/d161dbc0-1249-11f1-b048-c9424b2cf5fd.jpg", "publishedAt": "2026-02-25 13:39:40", "source": "The Bbc", "_source_api": "Newsdata.io"}, {"title": "South African army men recover two vehicles being smuggled in flooded Limpopo River into Zimbabwe", "description": "Thupeyo Muleya South African National Defence Force members deployed to patrol the border with Zimbabwe have recovered a Toyota Land Cruiser worth around R1,5 million that was being smuggled out...The post South African army men recover two vehicles being smuggled in flooded Limpopo River into Zimbabwe appeared first on herald.", "url": "https://www.heraldonline.co.zw/south-african-army-men-recover-two-vehicles-being-smuggled-in-flooded-limpopo-river-into-zimbabwe/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/sites/2/2020/08/South-African-Flag.jpg", "publishedAt": "2026-02-24 15:42:36", "source": "The Herald", "_source_api": "Newsdata.io"}], "more": [{"title": "How the Skeleton of Mutapa Times is Based on Sarah Charlesworth's Work", "description": "Conceptual artist Sarah Charlesworth's 1979 study of how newspapers covered a solar eclipse inspired the framework behind The Mutapa Times.", "url": "article.html?slug=2020-04-20-how-the-skeleton-of-mutapa-times-is-based-on-sarah-charlesworths-work", "image": "/img/uploads/imageedit_1_5381951801.jpg", "publishedAt": "2020-04-20T00:00:00.000Z", "source": "The Mutapa Times", "cms": true}, {"title": "Robert Mugabe’s son charged with attempted murder over Johannesburg shooting", "description": "Bellarmine Chatunga Mugabe, known for lavish lifestyle, also accused of theft and being illegal immigrant after man allegedly shot in back", "url": "article.html?slug=2026-02-23-robert-mugabes-son-charged-with-attempted-murder-over-johann", "image": "https://media.guim.co.uk/a777e1c818970c0301f21b6c3d44c79e5163732c/99_0_3832_3066/500.jpg", "publishedAt": "2026-02-23T13:48:00", "source": "The Mutapa Times", "cms": true}, {"title": "Lithium prices soar after Zimbabwe suspends export", "description": "Reuters China’s lithium price surged on Thursday after Zimbabwe suspended raw mineral exports, sparking concerns over supply disruptions, at a time when growing energy storage demand is projected to drive a boom in the market. The most traded lithium carbonate contract on the Guangzhou Futures Exchange jumped 6.07% to 178,020 yuan ($26,043.45) a metric ton [...]The post Lithium prices soar after Zimbabwe suspends export appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/lithium-prices-soar-after-zimbabwe-suspends-export/", "image": "", "publishedAt": "2026-02-26 09:21:31", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "China’s lithium price soars after Zimbabwe suspends exports", "description": "Market fears over supply disruptionsThe post China’s lithium price soars after Zimbabwe suspends exports appeared first on Zimbabwe News Now.", "url": "https://www.zimlive.com/chinas-lithium-price-soars-after-zimbabwe-suspends-export/", "image": "https://www.zimlive.com/wp-content/uploads/2026/02/IMG_5653.jpeg", "publishedAt": "2026-02-26 09:01:42", "source": "Zimbabwean News", "_source_api": "Newsdata.io"}, {"title": "Parliament of Zimbabwe Invites Citizens to Comment on the Constitutional Amendment Bill No. 3", "description": "Parliament of Zimbabwe Invites Citizens to Comment on the Constitutional Amendment Bill No. 3 The Parliament of Zimbabwe has called on citizens to submit their views on the proposed Constitutional Amendment Bill No. 3. This legislation could significantly alter key provisions relating to presidential selection and tenure, among other governance issues In a statement issued [...]The post Parliament of Zimbabwe Invites Citizens to Comment on the Constitutional Amendment Bill No. 3 appeared first on iHarare News.", "url": "https://iharare.com/parliament-of-zimbabwe-invites-citizens-to-comment-on-the-constitutional-amendment-bill-no-3/", "image": "", "publishedAt": "2026-02-26 09:00:52", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Govt Lithium Export Ban Sparks Hope for Value Addition", "description": "Government’s decision to ban the export of raw minerals including lithium concentrate has been welcomed by industry groups as a major step towards boosting local manufacturing and maximising returns from the country’s natural resources. The move announced on Wednesday by Mines and Mining Development Minister [...]The post Govt Lithium Export Ban Sparks Hope for Value Addition appeared first on 263Chat.", "url": "https://www.263chat.com/govt-lithium-export-ban-sparks-hope-for-value-addition/", "image": "https://www.263chat.com/wp-content/uploads/2023/01/lithium-mining.webp", "publishedAt": "2026-02-26 08:56:17", "source": "263chat", "_source_api": "Newsdata.io"}, {"title": "Zimra, Buy Zimbabwe Join Forces to Tackle Smuggling Crisis", "description": "The Zimbabwe Revenue Authority (Zimra) has partnered with a local industry lobby group in a renewed push to combat rampant smuggling, a practice blamed for undermining domestic manufacturers and flooding the market with counterfeit goods. The authority said it is working with Buy Zimbabwe to [...]The post Zimra, Buy Zimbabwe Join Forces to Tackle Smuggling Crisis appeared first on 263Chat.", "url": "https://www.263chat.com/zimra-buy-zimbabwe-join-forces-to-tackle-smuggling-crisis/", "image": "https://www.263chat.com/wp-content/uploads/2024/05/Buy-Zimbabwe.jpg", "publishedAt": "2026-02-26 08:43:47", "source": "263chat", "_source_api": "Newsdata.io"}, {"title": "Chatunga Bellarmine Mugabe Case NOT Collapsing: Top Investigator Dismisses Media Speculation Over Missing Gun", "description": "Chatunga Bellarmine Mugabe Case Will Not Be Dismissed, Says Investigator The dramatic case against Robert Mugabe’s son Chatunga Bellarmine Mugabe is NOT falling apart, despite a storm of social media speculation and a crucial missing weapon. Top private investigator Mike Bolhuis has moved swiftly to crush any suggestion that the lack of a firearm will [...]The post Chatunga Bellarmine Mugabe Case NOT Collapsing: Top Investigator Dismisses Media Speculation Over Missing Gun appeared first on iHarare News.", "url": "https://iharare.com/chatunga-bellarmine-mugabe-case-not-collapsing-top-investigator-dismisses-media-speculation/", "image": "", "publishedAt": "2026-02-26 08:37:18", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Chihota Man Kills Own Mother For Solar Panels And Cellphones, Then Joins Search Party", "description": "Man Joins Villagers In Search For Own Mom After Killing Her, Hiding Her Body & Selling Her Goods A 19-year-old Chihota man coldly joined villagers in the desperate search for his missing mother after he had already brutally murdered her, hidden her decomposing body in a disused toilet, and begun selling off her belongings for [...]The post Chihota Man Kills Own Mother For Solar Panels And Cellphones, Then Joins Search Party appeared first on iHarare News.", "url": "https://iharare.com/chihota-man-kills-own-mother-for-solar-panels-and-cellphones/", "image": "", "publishedAt": "2026-02-26 08:07:40", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "NetOne extends off-peak data hours, targets tourists with special packages", "description": "Mobile operator says change allows more Zimbabweans to update and download overnightThe post NetOne extends off-peak data hours, targets tourists with special packages appeared first on Zimbabwe News Now.", "url": "https://www.zimlive.com/netone-extends-off-peak-data-hours-targets-tourists-with-special-packages/", "image": "", "publishedAt": "2026-02-26 07:51:11", "source": "Zimbabwean News", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe's ban causes lithium prices jump", "description": "China's lithium price surged on Thursday after Zimbabwe suspended all raw mineral exports, stoking fears of supply disruptions at a time when rising energy storage demand has already been fuelling a m...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262435.html", "image": "https://img.bulawayo24.com/articles/Lithium-Mining.jpeg", "publishedAt": "2026-02-26 07:32:11", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "South Africa's Mashaile calls for regional crackdown on Chivayo", "description": "Retired Interpol ambassador and security strategist Andy Mashaile has called for a coordinated regional law enforcement crackdown following the issuance of a warrant of arrest for high-profile Zimbabw...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262434.html", "image": "https://img.bulawayo24.com/articles/chivayo_and_chivayo.jpg", "publishedAt": "2026-02-26 07:27:48", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "Prophet Walter Magaya Linked to Drug Scandal After Police Raid at Yadah Hotel", "description": "Prophet Walter Magaya Linked to Drug Scandal After Police Raid at Yadah Hotel The founder of PHD Ministries, Prophet Walter Magaya, has been drawn into a widening drug trafficking scandal following a police raid at his hotel. Detectives reportedly uncovered a substantial stash of medicines during a search operation at Yadah Hotel, triggering criminal proceedings [...]The post Prophet Walter Magaya Linked to Drug Scandal After Police Raid at Yadah Hotel appeared first on iHarare News.", "url": "https://iharare.com/prophet-walter-magaya-linked-to-drug-scandal-after-police-raid-at-yadah-hotel/", "image": "", "publishedAt": "2026-02-26 06:33:32", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Fresh faces, Big chance: Rassie Erasmus names youth-laced Springboks squad", "description": "Rassie Erasmus unveils a youth-laced Springboks squad, giving fresh faces big chances to shine in upcoming international rugby tests soon.The post Fresh faces, Big chance: Rassie Erasmus names youth-laced Springboks squad appeared first on iHarare News.", "url": "https://iharare.com/fresh-faces-big-chance-rassie-erasmus-names-youth-laced-springboks-squad/", "image": "", "publishedAt": "2026-02-26 05:57:44", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Retail giant OK Zimbabwe goes under corporate rescue after massive losses, revenue collapse", "description": "EMBATTLED retail giant OK Zimbabwe has been placed under Corporate Rescue following a resolution passed by its board of directors, as the company battles a deepening financial crisis marked by heavy losses, store closures and declining creditor confidence. Once regarded as one of Zimbabwe’s largest and most dominant retail chains, the company is now navigating [...]The post Retail giant OK Zimbabwe goes under corporate rescue after massive losses, revenue collapse appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/retail-giant-ok-zimbabwe-goes-under-corporate-rescue-after-massive-losses-revenue-collapse/", "image": "", "publishedAt": "2026-02-26 05:42:55", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Why Zimbabwe rejected a million-dollar US health funding deal", "description": "Zimbabwe’s rejection of a million-dollar US health funding deal sparks debate over aid dependence, economic policy, national interests and accountability.The post Why Zimbabwe rejected a million-dollar US health funding deal appeared first on iHarare News.", "url": "https://iharare.com/why-zimbabwe-rejected-a-million-dollar-us-health-funding-deal/", "image": "", "publishedAt": "2026-02-26 05:38:59", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Parliament invites public input on Constitutional Amendment (No.3) Bill which proposes extension of presidential term", "description": "The Parliament of Zimbabwe has invited the public to submit their views on the proposed Constitution of Zimbabwe Amendment (No. 3) Bill (H.B. 1), 2026, following its recent gazetting. The proposed amendment includes extending the presidential term from the current five years to seven years and introducing a parliamentary process for the election of the [...]The post Parliament invites public input on Constitutional Amendment (No.3) Bill which proposes extension of presidential term appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/parliament-invites-public-input-on-constitutional-amendment-no-3-bill-which-proposes-extension-of-presidential-term/", "image": "", "publishedAt": "2026-02-26 05:30:45", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}]}