{"articles": [{"title": "Zimbabwean breakout at T20 World Cup has fans rejoicing renaissance", "description": "Swelling fanbase has been in dreamland this past month as Zimbabwe have defied all expectations in the competition", "url": "https://www.theguardian.com/sport/2026/feb/25/zimbabwe-breakout-cricket-world-cup-supporters-rejoicing-renaissance", "image": "https://media.guim.co.uk/57170b6bfd404a0e029eb92825e336f3452038e3/183_0_1827_1462/500.jpg", "publishedAt": "2026-02-25T10:05:15Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "Zimbabwe rejects 'lopsided' US health aid deal over data concerns", "description": "Access to biological samples raised flags for Zimbabwe as the US did not want to share the benefits of its research.", "url": "https://www.bbc.com/news/articles/cwy6nd3664no", "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6ada/live/d161dbc0-1249-11f1-b048-c9424b2cf5fd.jpg", "publishedAt": "2026-02-25 13:39:40", "source": "The Bbc", "_source_api": "Newsdata.io"}, {"title": "South African army men recover two vehicles being smuggled in flooded Limpopo River into Zimbabwe", "description": "Thupeyo Muleya South African National Defence Force members deployed to patrol the border with Zimbabwe have recovered a Toyota Land Cruiser worth around R1,5 million that was being smuggled out...The post South African army men recover two vehicles being smuggled in flooded Limpopo River into Zimbabwe appeared first on herald.", "url": "https://www.heraldonline.co.zw/south-african-army-men-recover-two-vehicles-being-smuggled-in-flooded-limpopo-river-into-zimbabwe/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/sites/2/2020/08/South-African-Flag.jpg", "publishedAt": "2026-02-24 15:42:36", "source": "The Herald", "_source_api": "Newsdata.io"}], "more": [{"title": "How the Skeleton of Mutapa Times is Based on Sarah Charlesworth's Work", "description": "Conceptual artist Sarah Charlesworth's 1979 study of how newspapers covered a solar eclipse inspired the framework behind The Mutapa Times.", "url": "article.html?slug=2020-04-20-how-the-skeleton-of-mutapa-times-is-based-on-sarah-charlesworths-work", "image": "/img/uploads/imageedit_1_5381951801.jpg", "publishedAt": "2020-04-20T00:00:00.000Z", "source": "The Mutapa Times", "cms": true}, {"title": "Robert Mugabe’s son charged with attempted murder over Johannesburg shooting", "description": "Bellarmine Chatunga Mugabe, known for lavish lifestyle, also accused of theft and being illegal immigrant after man allegedly shot in back", "url": "article.html?slug=2026-02-23-robert-mugabes-son-charged-with-attempted-murder-over-johann", "image": "https://media.guim.co.uk/a777e1c818970c0301f21b6c3d44c79e5163732c/99_0_3832_3066/500.jpg", "publishedAt": "2026-02-23T13:48:00", "source": "The Mutapa Times", "cms": true}, {"title": "Zambia pushed back on U.S. health funding deal to protect interests, government says", "description": "Reuters Zambia has pushed back on part of a deal worth more than $1 billion in global health aid from the United States because it does not align with the country’s interests, the government said on Wednesday, as health advocates warned the deal links the money to mining access and has data-sharing risks. The deal [...]The post Zambia pushed back on U.S. health funding deal to protect interests, government says appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/zambia-pushed-back-on-u-s-health-funding-deal-to-protect-interests-government-says/", "image": "", "publishedAt": "2026-02-26 13:13:50", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Scott Sakupwanya Backs Black Rhinos FC with US$460 000 Sponsorship Package and Luxury Team Bus", "description": "Scott Sakupwanya Backs Black Rhinos FC with US$460 000 Sponsorship Package and Luxury Team Bus Businessman and legislator Pedzai Sakupwanya has bankrolled Black Rhinos F.C. with a US$460 000 sponsorship package ahead of the 2026 Division One season. The sponsorship deal was channelled through his company, Betterbrands Gold. Also Read: Scott Sakupwanya Donates US$100,000 to Simba [...]The post Scott Sakupwanya Backs Black Rhinos FC with US$460 000 Sponsorship Package and Luxury Team Bus appeared first on iHarare News.", "url": "https://iharare.com/scott-sakupwanya-backs-black-rhinos-fc-with-us460-000-sponsorship-package-and-luxury-team-bus/", "image": "https://iharare.com/wp-content/uploads/2026/02/MixCollage-26-Feb-2026-02-40-PM-4337.jpg", "publishedAt": "2026-02-26 12:56:12", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Simplifying The Proposed Zimbabwe Constitutional Amendment Bill No. 3: A Simple Guide For Ordinary Zimbabweans", "description": "Following the Cabinet’s approval of the draft Constitution of Zimbabwe Amendment (No. 3) Bill earlier this February, a whirlwind of legislative activity and public debate has swept across the nation and social media platforms. The formal gazetting of the Bill on February 16, 2026, officially triggered a 90-day window for public scrutiny, yet the weeks [...]The post Simplifying The Proposed Zimbabwe Constitutional Amendment Bill No. 3: A Simple Guide For Ordinary Zimbabweans appeared first on iHarare News.", "url": "https://iharare.com/simplifying-zimbabwe-constitutional-amendment-bill-no-3/", "image": "", "publishedAt": "2026-02-26 12:52:53", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Global lithium price goes up as Zimbabwe BANS exports: Why the world has SUDDENLY PANICKED over Zimbabwe’s raw mineral ban", "description": "HARARE – In a move that has reverberated across international markets, Zimbabwe has imposed an immediate and indefinite ban on the export of all raw minerals and lithium concentrates. Announced on Wednesday, 25 February 2026, by Minister of Mines and Mining Development Polite Kambamura, this decisive action includes all minerals already in transit, effectively halting [...]The post Global lithium price goes up as Zimbabwe BANS exports: Why the world has SUDDENLY PANICKED over Zimbabwe’s raw mineral ban first appeared on My Zimbabwe News.", "url": "https://www.myzimbabwe.co.zw/blog/186027-global-lithium-price-goes-up-as-zimbabwe-bans-exports-why-the-world-has-suddenly-panicked-over-zimbabwes-raw-mineral-ban.html", "image": "https://www.myzimbabwe.co.zw/wp-content/uploads/2026/02/zimbabwe-mining-minerals-data.jpg", "publishedAt": "2026-02-26 12:49:09", "source": "My Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Stewart Murisa distances himself from Arsenal's Teashaun", "description": "Former Castle Soccer Star of the Year Stewart Murisa has clarified that he is not related to highly rated London-based teenager Teashaun Murisa, who has signed his first professional contract with Eng...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262448.html", "image": "https://img.bulawayo24.com/articles/bulawayo24.png", "publishedAt": "2026-02-26 12:43:15", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "SHOCKING DNA details: What USA wanted from Zimbabweans and why Mnangagwa refused a US$367 million dangerous deal", "description": "The $367 Million US Health Deal Collapse: What Data Did Washington Really Want From Our DNA? Zimbabwe has made a stunning move by walking away from a US$367 million health funding deal with the United States, citing “sovereignty” and “data concerns.” To the average citizen, rejecting such a massive sum during a health crisis seems [...]The post SHOCKING DNA details: What USA wanted from Zimbabweans and why Mnangagwa refused a US$367 million dangerous deal first appeared on My Zimbabwe News.", "url": "https://www.myzimbabwe.co.zw/news/186025-shocking-dna-details-what-usa-wanted-from-zimbabweans-and-why-mnangagwa-refused-a-us367-million-dangerous-deal.html", "image": "https://www.myzimbabwe.co.zw/wp-content/uploads/2024/08/mnangagwa-national-sports-speech.jpg", "publishedAt": "2026-02-26 12:34:05", "source": "My Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Zambia emulates Zimbabwe, pushed back on US health funding deal", "description": "Zambia has pushed back on part of a deal worth more than $1 billion in global health aid from the United States because it does not align with the country’s interests, the government said on Wednesday, as health advocates warned the deal links the money to mining access and has data-sharing risks. The deal governs [...]The post Zambia emulates Zimbabwe, pushed back on US health funding deal appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/zambia-emulates-zimbabwe-pushed-back-on-us-health-funding-deal/", "image": "https://thezimbabwemail.com/wp-content/uploads/2025/11/Zimbabwean-President-Mnangagwa-and-Zambia-President-Hakainde-Hichilema.jpeg", "publishedAt": "2026-02-26 12:27:43", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "Congo Tightens Cobalt Exports, Sending Shockwaves Through Global Battery Supply Chains", "description": "KINSHASA, DRC – The Democratic Republic of Congo’s tightening of cobalt export controls has triggered fresh volatility in global battery metal markets, drawing renewed attention to China’s heavy reliance on imported raw materials despite its dominance in mineral processing. Congo, the world’s largest producer of cobalt intermediates, moved to restrict shipments as part of a [...]The post Congo Tightens Cobalt Exports, Sending Shockwaves Through Global Battery Supply Chains appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/congo-tightens-cobalt-exports-sending-shockwaves-through-global-battery-supply-chains/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/02/Congo-Tightens-Cobalt-Exports-8.jpg", "publishedAt": "2026-02-26 12:24:15", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "Lithium prices soar after Zimbabwe suspends export", "description": "Reuters China’s lithium price surged on Thursday after Zimbabwe suspended raw mineral exports, sparking concerns over supply disruptions, at a time when growing energy storage demand is projected to drive a boom in the market. The most traded lithium carbonate contract on the Guangzhou Futures Exchange jumped 6.07% to 178,020 yuan ($26,043.45) a metric ton [...]The post Lithium prices soar after Zimbabwe suspends export appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/lithium-prices-soar-after-zimbabwe-suspends-export/", "image": "", "publishedAt": "2026-02-26 09:21:31", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "China’s lithium price soars after Zimbabwe suspends exports", "description": "Market fears over supply disruptionsThe post China’s lithium price soars after Zimbabwe suspends exports appeared first on Zimbabwe News Now.", "url": "https://www.zimlive.com/chinas-lithium-price-soars-after-zimbabwe-suspends-export/", "image": "https://www.zimlive.com/wp-content/uploads/2026/02/IMG_5653.jpeg", "publishedAt": "2026-02-26 09:01:42", "source": "Zimbabwean News", "_source_api": "Newsdata.io"}, {"title": "Parliament of Zimbabwe Invites Citizens to Comment on the Constitutional Amendment Bill No. 3", "description": "Parliament of Zimbabwe Invites Citizens to Comment on the Constitutional Amendment Bill No. 3 The Parliament of Zimbabwe has called on citizens to submit their views on the proposed Constitutional Amendment Bill No. 3. This legislation could significantly alter key provisions relating to presidential selection and tenure, among other governance issues In a statement issued [...]The post Parliament of Zimbabwe Invites Citizens to Comment on the Constitutional Amendment Bill No. 3 appeared first on iHarare News.", "url": "https://iharare.com/parliament-of-zimbabwe-invites-citizens-to-comment-on-the-constitutional-amendment-bill-no-3/", "image": "", "publishedAt": "2026-02-26 09:00:52", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Govt Lithium Export Ban Sparks Hope for Value Addition", "description": "Government’s decision to ban the export of raw minerals including lithium concentrate has been welcomed by industry groups as a major step towards boosting local manufacturing and maximising returns from the country’s natural resources. The move announced on Wednesday by Mines and Mining Development Minister [...]The post Govt Lithium Export Ban Sparks Hope for Value Addition appeared first on 263Chat.", "url": "https://www.263chat.com/govt-lithium-export-ban-sparks-hope-for-value-addition/", "image": "https://www.263chat.com/wp-content/uploads/2023/01/lithium-mining.webp", "publishedAt": "2026-02-26 08:56:17", "source": "263chat", "_source_api": "Newsdata.io"}, {"title": "Zimra, Buy Zimbabwe Join Forces to Tackle Smuggling Crisis", "description": "The Zimbabwe Revenue Authority (Zimra) has partnered with a local industry lobby group in a renewed push to combat rampant smuggling, a practice blamed for undermining domestic manufacturers and flooding the market with counterfeit goods. The authority said it is working with Buy Zimbabwe to [...]The post Zimra, Buy Zimbabwe Join Forces to Tackle Smuggling Crisis appeared first on 263Chat.", "url": "https://www.263chat.com/zimra-buy-zimbabwe-join-forces-to-tackle-smuggling-crisis/", "image": "https://www.263chat.com/wp-content/uploads/2024/05/Buy-Zimbabwe.jpg", "publishedAt": "2026-02-26 08:43:47", "source": "263chat", "_source_api": "Newsdata.io"}, {"title": "Chatunga Bellarmine Mugabe Case NOT Collapsing: Top Investigator Dismisses Media Speculation Over Missing Gun", "description": "Chatunga Bellarmine Mugabe Case Will Not Be Dismissed, Says Investigator The dramatic case against Robert Mugabe’s son Chatunga Bellarmine Mugabe is NOT falling apart, despite a storm of social media speculation and a crucial missing weapon. Top private investigator Mike Bolhuis has moved swiftly to crush any suggestion that the lack of a firearm will [...]The post Chatunga Bellarmine Mugabe Case NOT Collapsing: Top Investigator Dismisses Media Speculation Over Missing Gun appeared first on iHarare News.", "url": "https://iharare.com/chatunga-bellarmine-mugabe-case-not-collapsing-top-investigator-dismisses-media-speculation/", "image": "", "publishedAt": "2026-02-26 08:37:18", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Chihota Man Kills Own Mother For Solar Panels And Cellphones, Then Joins Search Party", "description": "Man Joins Villagers In Search For Own Mom After Killing Her, Hiding Her Body & Selling Her Goods A 19-year-old Chihota man coldly joined villagers in the desperate search for his missing mother after he had already brutally murdered her, hidden her decomposing body in a disused toilet, and begun selling off her belongings for [...]The post Chihota Man Kills Own Mother For Solar Panels And Cellphones, Then Joins Search Party appeared first on iHarare News.", "url": "https://iharare.com/chihota-man-kills-own-mother-for-solar-panels-and-cellphones/", "image": "", "publishedAt": "2026-02-26 08:07:40", "source": "Iharare News", "_source_api": "Newsdata.io"}]}