{"articles": [{"title": "Zimbabwean breakout at T20 World Cup has fans rejoicing renaissance", "description": "Swelling fanbase has been in dreamland this past month as Zimbabwe have defied all expectations in the competition", "url": "https://www.theguardian.com/sport/2026/feb/25/zimbabwe-breakout-cricket-world-cup-supporters-rejoicing-renaissance", "image": "https://media.guim.co.uk/57170b6bfd404a0e029eb92825e336f3452038e3/183_0_1827_1462/500.jpg", "publishedAt": "2026-02-25T10:05:15Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "Zimbabwe rejects 'lopsided' US health aid deal over data concerns", "description": "Access to biological samples raised flags for Zimbabwe as the US did not want to share the benefits of its research.", "url": "https://www.bbc.com/news/articles/cwy6nd3664no", "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6ada/live/d161dbc0-1249-11f1-b048-c9424b2cf5fd.jpg", "publishedAt": "2026-02-25 13:39:40", "source": "The Bbc", "_source_api": "Newsdata.io"}, {"title": "South African army men recover two vehicles being smuggled in flooded Limpopo River into Zimbabwe", "description": "Thupeyo Muleya South African National Defence Force members deployed to patrol the border with Zimbabwe have recovered a Toyota Land Cruiser worth around R1,5 million that was being smuggled out...The post South African army men recover two vehicles being smuggled in flooded Limpopo River into Zimbabwe appeared first on herald.", "url": "https://www.heraldonline.co.zw/south-african-army-men-recover-two-vehicles-being-smuggled-in-flooded-limpopo-river-into-zimbabwe/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/sites/2/2020/08/South-African-Flag.jpg", "publishedAt": "2026-02-24 15:42:36", "source": "The Herald", "_source_api": "Newsdata.io"}], "more": [{"title": "How the Skeleton of Mutapa Times is Based on Sarah Charlesworth's Work", "description": "Conceptual artist Sarah Charlesworth's 1979 study of how newspapers covered a solar eclipse inspired the framework behind The Mutapa Times.", "url": "article.html?slug=2020-04-20-how-the-skeleton-of-mutapa-times-is-based-on-sarah-charlesworths-work", "image": "/img/uploads/imageedit_1_5381951801.jpg", "publishedAt": "2020-04-20T00:00:00.000Z", "source": "The Mutapa Times", "cms": true}, {"title": "Robert Mugabe’s son charged with attempted murder over Johannesburg shooting", "description": "Bellarmine Chatunga Mugabe, known for lavish lifestyle, also accused of theft and being illegal immigrant after man allegedly shot in back", "url": "article.html?slug=2026-02-23-robert-mugabes-son-charged-with-attempted-murder-over-johann", "image": "https://media.guim.co.uk/a777e1c818970c0301f21b6c3d44c79e5163732c/99_0_3832_3066/500.jpg", "publishedAt": "2026-02-23T13:48:00", "source": "The Mutapa Times", "cms": true}, {"title": "Zimbabwe women fall to New Zealand in T20I series opener", "description": "The New Zealand women’s national cricket team, the White Ferns, secured a 92-run victory over Zimbabwe in the opening match of their T20 International series at Seddon Park. After Zimbabwe won the toss and elected to bowl, they were immediately put on the back foot. New Zealand’s captain, Amelia Kerr, led from the front with [...]The post Zimbabwe women fall to New Zealand in T20I series opener appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/zimbabwe-women-fall-to-new-zealand-in-t20i-series-opener/", "image": "", "publishedAt": "2026-02-26 00:10:42", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Interpol veteran calls for regional crackdown on Zimbabwe’s high-flying Chivayo wanted by Hawks", "description": "IOL Retired Interpol ambassador and security strategist Andy Mashaile has called for a regional law enforcement crackdown following the issuance of a warrant of arrest for high-profile Zimbabwean socialite and Zanu PF deputy secretary for information and publicity in Harare province, Joachim Chivayo, also known as G6. Earlier this week, IOL reported that the Directorate for Priority Crime [...]The post Interpol veteran calls for regional crackdown on Zimbabwe’s high-flying Chivayo wanted by Hawks appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/interpol-veteran-calls-for-regional-crackdown-on-zimbabwes-high-flying-chivayo-wanted-by-hawks/", "image": "https://iol-prod.appspot.com/image/5df625adabb4f18224589fb6a91f08f4293469d7=w700", "publishedAt": "2026-02-26 00:05:03", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "NGO petitions Parliament to enact new law protecting Zimbabwe’s senior citizens, pensioners", "description": "A non-governmental organisation, Power of Touch Institution, has petitioned Parliament to enact legislation specifically designed to protect senior citizens, pensioners and retired professionals amid growing concerns over their welfare. Presenting the petition on Monday before the Parliament of Zimbabwe’s Portfolio Committee on Public Service and Social Welfare, the organisation’s leaders, Francis Dembetembe and Beatrice Sithole, [...]The post NGO petitions Parliament to enact new law protecting Zimbabwe’s senior citizens, pensioners appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/ngo-petitions-parliament-to-enact-new-law-protecting-zimbabwes-senior-citizens-pensioners/", "image": "", "publishedAt": "2026-02-26 00:00:51", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Let monetary policy anchor people’s hope", "description": "THE nation tomorrow turns its eyes toward the Reserve Bank of Zimbabwe (RBZ) as it presents the 2026 Monetary Policy Statement (MPS).For... To access this content, please purchase a subscription by clicking the button below and select a package of your choice!Subscriptions", "url": "https://dailynews.co.zw/let-monetary-policy-anchor-peoples-hope/", "image": "", "publishedAt": "2026-02-26 00:00:00", "source": "Dailynews", "_source_api": "Newsdata.io"}, {"title": "Zimpost, Telco partner to power green logistics", "description": "ZIMBABWE Posts (Zimpost) is shedding its traditional image to become the heartbeat of the nation’s green revolution following a recent landmark strategic... To access this content, please purchase a subscription by clicking the button below and select a package of your choice!Subscriptions", "url": "https://dailynews.co.zw/zimpost-telco-partner-to-power-green-logistics/", "image": "", "publishedAt": "2026-02-26 00:00:00", "source": "Dailynews", "_source_api": "Newsdata.io"}, {"title": "Stage set for Nama awards night", "description": "DIRECTOR of the National Arts Council of Zimbabwe (Nacz), Napoleon Nyanhi, says preparations are complete for the 24th edition of the National... To access this content, please purchase a subscription by clicking the button below and select a package of your choice!Subscriptions", "url": "https://dailynews.co.zw/stage-set-for-nama-awards-night/", "image": "", "publishedAt": "2026-02-26 00:00:00", "source": "Dailynews", "_source_api": "Newsdata.io"}, {"title": "‘Keep the ZiG & all prices stable’", "description": "CONSUMERS want the governor of the Reserve Bank of Zimbabwe (RBZ), John Mushayavanhu, to prioritise the interests of the needy in his... To access this content, please purchase a subscription by clicking the button below and select a package of your choice!Subscriptions", "url": "https://dailynews.co.zw/keep-the-zig-all-prices-stable/", "image": "", "publishedAt": "2026-02-26 00:00:00", "source": "Dailynews", "_source_api": "Newsdata.io"}, {"title": "Zimra, Buy Zim launch smuggling blitz", "description": "THE Zimbabwe Revenue Authority (Zimra) and Buy Zimbabwe have launched a joint enforcement blitz to curb smuggling and protect local industry from... To access this content, please purchase a subscription by clicking the button below and select a package of your choice!Subscriptions", "url": "https://dailynews.co.zw/zimra-buy-zim-launch-smuggling-blitz/", "image": "", "publishedAt": "2026-02-25 23:59:00", "source": "Dailynews", "_source_api": "Newsdata.io"}, {"title": "All set for golf season opener", "description": "THE Julius Robinson Trophy — which serves as the season opener for the Zimbabwe Golf Association (ZGA) amateur — will take place... To access this content, please purchase a subscription by clicking the button below and select a package of your choice!Subscriptions", "url": "https://dailynews.co.zw/all-set-for-golf-season-opener/", "image": "", "publishedAt": "2026-02-25 23:57:00", "source": "Dailynews", "_source_api": "Newsdata.io"}, {"title": "Tungwarara finally co‐opted into Zanu‐PF Central Committee", "description": "Special Presidential Empowerment Advisor Paul Tungwarara has been congratulated following his co‐option into the Zanu‐PF Central Committee, a development that comes after earlier internal disputes over his inclusion in the party’s second‐highest decision‐making body. Several Zanu‐PF‐aligned Economic Development affiliates applauded Tungwarara’s elevation, noting that he has long supported their activities, including Teachers4ED, Patriotic Vendors4ED, Mapostori4ED, [...]The post Tungwarara finally co‐opted into Zanu‐PF Central Committee appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/tungwarara-finally-co-opted-into-zanu-pf-central-committee/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/01/Tungwarara.jpeg", "publishedAt": "2026-02-25 22:46:05", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "Terms of Reference: Zimbabwe Circular Economy Taskforce (Proposed Framework)", "description": "1. Purpose of the Zimbabwe Circular Economy Taskforce Zimbabwe is committed to advancing sustainable economic growth, resource efficiency, and environmental stewardship in line with national development priorities, including Vision 2030 and broader climate resilience objectives. To support this transition, the Government of Zimbabwe shall establish a Zimbabwe Circular Economy Taskforce (“the Taskforce”). The Taskforce will [...]The post Terms of Reference: Zimbabwe Circular Economy Taskforce (Proposed Framework) appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/terms-of-reference-zimbabwe-circular-economy-taskforce-proposed-framework/", "image": "https://thezimbabwemail.com/wp-content/uploads/2025/12/Zimbabwe-The-Circular-Economy.png", "publishedAt": "2026-02-25 21:37:39", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "Police dismiss social media claims they are looking for Chivayo", "description": "The Zimbabwe Republic Police have dismissed social media claims suggesting they issued a statement indicating that Joachim Chivayo is wanted in South Africa, describing the circulating post as fake.Th...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262424.html", "image": "https://img.bulawayo24.com/articles/bulawayo24.png", "publishedAt": "2026-02-25 21:06:51", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "Six Practical Strategies for Growth Outperformance in Zimbabwean Business", "description": "Growth has always been central to business success, but in Zimbabwe’s operating environment, it has taken on a deeper significance. For many firms, growth is no longer simply about expansion or increased revenue; it is about resilience, relevance, and long‐term survival in a landscape shaped by currency pressures, shifting consumer behaviour, and evolving regional competition. [...]The post Six Practical Strategies for Growth Outperformance in Zimbabwean Business appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/six-practical-strategies-for-growth-outperformance-in-zimbabwean-business/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/02/Management-strategy-planning-meeting.jpg", "publishedAt": "2026-02-25 19:21:26", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe Explains Why It Rejected US$367M US Health Funding For Lifesaving HIV, TB, And Malaria Programs", "description": "US$367 Million Rejected: Zimbabwe Government Details Reasons For Turning Away US Health Aid The Zimbabwean government has finally broken its silence to explain exactly why President Emmerson Mnangagwa rejected a massive US$367 million (approximately R6.8 billion) health funding package from the United States—money that was bankrolling lifesaving HIV, TB, and malaria treatment for millions of [...]The post Zimbabwe Explains Why It Rejected US$367M US Health Funding For Lifesaving HIV, TB, And Malaria Programs appeared first on iHarare News.", "url": "https://iharare.com/us367-million-rejected-zimbabwe-government-details-reasons-for-turning-away-us-health-aid/", "image": "", "publishedAt": "2026-02-25 19:18:41", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Tungwarara co-opted into Zanu-PF's Central Committee", "description": "Zanu-PF's highest decision-making body, the Politburo, has confirmed the co-option of Special Investment Advisor to President Emmerson Mnangagwa, Paul Tempter Tungwarara, into the party's Central Comm...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262423.html", "image": "https://img.bulawayo24.com/articles/tungwarara_mnangagwa_tungwarara_mnangagwa.png", "publishedAt": "2026-02-25 19:09:11", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}]}