{"articles": [{"title": "Zanu PF Matabeleland South PCC meets in Gwanda over Constitutional Amendment No. 3 Bill of 2026", "description": "Sukulwenkosi Dube-Matutu THE Zanu PF Matabeleland South Provincial Coordinating Committee (PCC) has gathered in Gwanda for a national address by the party’s leadership on the Constitutional Amendment No. 3 Bill...The post Zanu PF Matabeleland South PCC meets in Gwanda over Constitutional Amendment No. 3 Bill of 2026 appeared first on herald.", "url": "https://www.heraldonline.co.zw/zanu-pf-matabeleland-south-pcc-meets-in-gwanda-over-constitutional-amendment-no-3-bill-of-2026/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/03/WhatsApp-Image-2026-03-01-at-11.09.54.jpeg", "publishedAt": "2026-03-01 09:15:05", "source": "The Herald", "_source_api": "Newsdata.io"}, {"title": "Judgment date set in Chinese national fatal mine shooting case", "description": "Peter Matika peter.matika@chronicle.co.zw JUDGMENT has been reserved for Tuesday, 3 March 2026, in the murder trial of a Chinese national accused of fatally shooting an artisanal miner at a gold...The post Judgment date set in Chinese national fatal mine shooting case appeared first on herald.", "url": "https://www.heraldonline.co.zw/judgment-date-set-in-chinese-national-fatal-mine-shooting-case/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/site//2/COURT-GRAVEL-5-720x375-1.jpeg", "publishedAt": "2026-03-01 08:45:50", "source": "The Herald", "_source_api": "Newsdata.io"}, {"title": "DRIVERS DIE IN BUS AND TRUCK SMASH: Police warn rogue motorists", "description": "B-Metro Reporter A DEADLY smash on the Harare–Masvingo Road has left two drivers dead as the Zimbabwe Republic Police urges the public to report reckless motorists before more lives are...The post DRIVERS DIE IN BUS AND TRUCK SMASH: Police warn rogue motorists appeared first on herald.", "url": "https://www.heraldonline.co.zw/drivers-die-in-bus-and-truck-smash-police-warn-rogue-motorists/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2025/10/Accident-shatter.jpg", "publishedAt": "2026-03-01 08:36:27", "source": "The Herald", "_source_api": "Newsdata.io"}], "more": [{"title": "How the Skeleton of Mutapa Times is Based on Sarah Charlesworth's Work", "description": "Conceptual artist Sarah Charlesworth's 1979 study of how newspapers covered a solar eclipse inspired the framework behind The Mutapa Times.", "url": "article.html?slug=2020-04-20-how-the-skeleton-of-mutapa-times-is-based-on-sarah-charlesworths-work", "image": "/img/uploads/imageedit_1_5381951801.jpg", "publishedAt": "2020-04-20T00:00:00.000Z", "source": "The Mutapa Times", "cms": true}, {"title": "ZIMURA Is Dying: Alick Macheso Threatens To Quit Over Funeral Lies & Unfair Treatment Of Musicians", "description": "Zimura Is Staggering Towards Its Death: Macheso Slams Organisation Over Lies & Unfair Treatment Of Musicians Zimura is staggering towards its death, Alick Macheso has declared, as he slammed the organisation over alleged lies and what he described as unfair treatment of musicians. The sungura legend said he is “embarrassed” by the turmoil rocking the [...]The post ZIMURA Is Dying: Alick Macheso Threatens To Quit Over Funeral Lies & Unfair Treatment Of Musicians appeared first on iHarare News.", "url": "https://iharare.com/zimura-is-dying-alick-macheso-threatens-to-quit-over-funeral-lies-unfair-treatment-of-musicians/", "image": "", "publishedAt": "2026-03-01 08:52:38", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Permanent secretary sits on board of company regulated by his ministry", "description": "Shareholder pressure on industry ministry secretary over dual role Source: Permanent secretary sits on board of company regulated by his ministry – Zimbabwe News Now Thomas Utete Wushe HARARE – The permanent secretary in the ministry of industry and trade has retained his position on the board of a private company regulated by his ministry, [...]The post Permanent secretary sits on board of company regulated by his ministry appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/permanent-secretary-sits-on-board-of-company-regulated-by-his-ministry/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/03/IMG_5664-1200x800-1.jpeg", "publishedAt": "2026-03-01 08:46:36", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Funds Unlocked: Zimbabwe To Recruit 3 000 Teachers In March, Ex-Staff Encouraged To Apply", "description": "Zimbabwe To Recruit 3 000 Teachers In March, Former Educators Encouraged To Apply Harare – A massive government recruitment drive kicks off tomorrow to fill 3 000 teaching posts across the nation, with a special plea for former educators who abandoned the classroom to return to the chalkboard. The Public Service Commission (PSC) has confirmed [...]The post Funds Unlocked: Zimbabwe To Recruit 3 000 Teachers In March, Ex-Staff Encouraged To Apply appeared first on iHarare News.", "url": "https://iharare.com/zimbabwe-to-recruit-3-000-teachers-in-march-ex-staff-encouraged-to-apply/", "image": "", "publishedAt": "2026-03-01 08:35:31", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Minister Says Private Schools Teaching French And Chinese Must Teach Zimbabwean History & Local Languages", "description": "Private Schools Teaching French, Chinese Must Teach Zimbabwean History And Local Languages The Government has directed that private schools in Zimbabwe, which offer instruction in French and Chinese, must now also teach Zimbabwean history and local languages. The move seeks to ensure that learners in all institutions are grounded in the country’s heritage. Minister of [...]The post Minister Says Private Schools Teaching French And Chinese Must Teach Zimbabwean History & Local Languages appeared first on iHarare News.", "url": "https://iharare.com/private-schools-teaching-french-chinese-must-teach-zimbabwean-history-and-local-languages/", "image": "", "publishedAt": "2026-03-01 08:15:59", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "T20 WC: SA's Maphaka, Nortje Strike Early Raza Stands Tall For ZIM", "description": "(MENAFN - AsiaNet News) Zimbabwe struggled to post a competitive total while batting first against South Africa in their final Super 8 fixture in the ongoing T20 World Cup. Early breakthroughs by ...", "url": "https://menafn.com/1110805450/T20-WC-SAs-Maphaka-Nortje-Strike-Early-Raza-Stands-Tall-For-ZIM", "image": "https://menafn.com/updates/pr/2026-03/01/AN_19f3aimage_story.jpg", "publishedAt": "2026-03-01 08:07:45", "source": "Menafn", "_source_api": "Newsdata.io"}, {"title": "Why Chatunga Mugabe CAN’T apply for bail... Found with FAKE documents... MULTIPLE GUNS used to shoot gardener", "description": "JOHANNESBURG – In the leaf-shrouded, high-walled sanctuary of Hyde Park, where Johannesburg’s old money meets its new political elite, the silence of the affluent suburb was shattered by the crack of gunfire on a Thursday morning that has since unspooled into a forensic nightmare for the Mugabe dynasty. Bellarmine Chatunga Mugabe, the 29-year-old youngest son [...]The post Why Chatunga Mugabe CAN’T apply for bail... Found with FAKE documents... MULTIPLE GUNS used to shoot gardener first appeared on My Zimbabwe News.", "url": "https://www.myzimbabwe.co.zw/news/186096-why-chatunga-mugabe-cant-apply-for-bail-found-with-fake-documents-multiple-guns-used-to-shoot-gardener.html", "image": "https://www.myzimbabwe.co.zw/wp-content/uploads/2026/02/Chatunga-mugabe-arrested-in-court-shocked.jpg", "publishedAt": "2026-03-01 07:46:01", "source": "My Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Urban farming couple demonstrates power of small-scale agriculture", "description": "Judith Phiri, judith.phiri@sundaynews.co.zw AN urban farming couple in Bulawayo’s Buena Vista suburb, Mr Kay Shiri (71) and Mrs Beauty Shiri (66), are setting an example by maximising their small plot to grow crops that support food security and livelihoods. Urban agriculture in Zimbabwe has grown phenomenally in recent years, evolving from small-scale subsistence gardening into a [...]The post Urban farming couple demonstrates power of small-scale agriculture appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/urban-farming-couple-demonstrates-power-of-small-scale-agriculture/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/03/tyre.jpg", "publishedAt": "2026-03-01 05:44:10", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "New teacher recruitment drive begins tomorrow", "description": "Zimpapers Reporter A NATIONWIDE teacher recruitment drive will begin tomorrow across all 10 provinces to fill staffing gaps in public schools, following the release of funding for the exercise by Treasury. The Public Service Commission (PSC) has previously indicated that it plans to recruit 3 000 teachers during the first three months of this year. [...]The post New teacher recruitment drive begins tomorrow appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/new-teacher-recruitment-drive-begins-tomorrow/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/sites/2/2023/12/torerayi-moyo.jpg", "publishedAt": "2026-03-01 05:43:18", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "RBZ measures put more money back into people’s pockets", "description": "Rumbidzayi Zinyuke Senior Reporter Zimbabweans are set to benefit from sweeping reductions in bank charges after the Reserve Bank of Zimbabwe (RBZ) moved to cut balance inquiry fees, Point of Sale (POS) transaction costs and cash withdrawal charges, easing the financial burden on depositors and small businesses. The measures are expected to bring relief to [...]The post RBZ measures put more money back into people’s pockets appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/rbz-measures-put-more-money-back-into-peoples-pockets/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/sites/2/2018/03/0811-1-1-RBZ-BUILDING.jpg", "publishedAt": "2026-03-01 05:42:28", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Multi-mineral ores targeted . . . Govt moves to plug revenue leakages", "description": "Debra Matabvu THE recent suspension of exports of raw minerals and lithium concentrates is meant to prevent the smuggling of multi-mineral ores that would have been intentionally misdeclared as a single, lower-value or less-regulated minerals, enabling traffickers to bypass export restrictions, avoid taxes and conceal the presence of high-value resources, it has been revealed. The [...]The post Multi-mineral ores targeted . . . Govt moves to plug revenue leakages appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/multi-mineral-ores-targeted-govt-moves-to-plug-revenue-leakages/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/02/BrowserPreview_tmp-13-5.jpg", "publishedAt": "2026-03-01 05:40:54", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "193k benefit from Zimbabwe Resilience Building Fund", "description": "Sukulwenkosi Dube-Matutu, Mat South Bureau ABOUT 193 000 people from three districts in the country are set to benefit from the Zimbabwe Resilience Building Fund Phase 2 (ZRBF 2) Reclaim Project, which seeks to strengthen climate resilience and ensure sustainable livelihoods among vulnerable rural communities. Speaking on Wednesday during a ZRBF 2 Matabeleland South sensitisation [...]The post 193k benefit from Zimbabwe Resilience Building Fund appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/193k-benefit-from-zimbabwe-resilience-building-fund/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/03/Untitled-3-3.jpg", "publishedAt": "2026-03-01 05:39:30", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "City must fix water infrastructure to attract green investment — Councillor Coltart", "description": "Sikhumbuzo Moyo, Senior Reporter THE City of Bulawayo cannot attract green investment or sustain eco-industries without first addressing its water infrastructure challenges, Mayor Councillor David Coltart has said. Clr Coltart made the remarks during a Trade Effluent and Water Recycling Indaba organised by the Bulawayo City Council last week. The two-day workshop ran under the [...]The post City must fix water infrastructure to attract green investment — Councillor Coltart appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/city-must-fix-water-infrastructure-to-attract-green-investment-councillor-coltart/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2025/08/fr.jpg", "publishedAt": "2026-03-01 05:35:43", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "New classroom block transforms learning at Mberengwa school", "description": "Patrick Chitumba, Midlands Bureau MARY Nyoni, a Grade Five pupil at Gomututu Secondary School in Mberengwa East constituency, can finally bid farewell to lessons held in the scorching sun. A new classroom block, funded through the Constituency Development Fund (CDF), has been completed, offering a safer and more comfortable learning environment for her and her [...]The post New classroom block transforms learning at Mberengwa school appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/new-classroom-block-transforms-learning-at-mberengwa-school/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2025/12/fgrft.jpg", "publishedAt": "2026-03-01 05:34:45", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Redcliff slashes 2026 budget", "description": "Midlands Bureau THE Redcliff Municipality has reduced its 2026 budget to US$19 million, down from US$25 million the previous year, as part of efforts to align expenditure with available revenue while maintaining efficient service delivery. Redcliff Municipality public relations manager, Mr Michael Magoronga, confirmed the development. “The Municipality of Redcliff is pleased to announce that [...]The post Redcliff slashes 2026 budget appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/redcliff-slashes-2026-budget/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/site//3/The-motorised-grade-that-Redcliff-Municipality-received-from-Livetouch-Investments-as-part-of-a-land-deal6.jpg", "publishedAt": "2026-03-01 05:33:40", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "‘Mentor, employ young graduates to drive economic transformation’", "description": "Thupeyo Muleya, Beitbridge Bureau MINISTER of Youth Empowerment, Development and Vocational Training, Cde Tinoda Machakaire, has emphasised the importance of skills development in driving Zimbabwe’s economic growth and transformation. Speaking at the “Skills2Live and Knows No-Borders Project” graduation ceremony in Beitbridge on Thursday, the minister highlighted the Government’s commitment to empowering youth through vocational training. [...]The post ‘Mentor, employ young graduates to drive economic transformation’ appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/mentor-employ-young-graduates-to-drive-economic-transformation/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/site//2/Tinoda-Machakaire-.jpg", "publishedAt": "2026-03-01 05:32:57", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}]}