{"articles": [{"title": "Rising anger over ‘lop-sided’ and ‘immoral’ US health funding pacts with African countries", "description": "Zimbabwe refuses to sign agreement and Kenya faces a court case over data sharing as new aid deals come under scrutiny", "url": "https://www.theguardian.com/global-development/2026/feb/27/rising-anger-over-lop-sided-immoral-us-health-funding-pacts-africa-countries", "image": "https://media.guim.co.uk/052f71618f81a5e32d654d7d911f9002cd98f9e0/967_502_3452_2762/500.jpg", "publishedAt": "2026-02-27T07:00:34Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "Zimbabwean breakout at T20 World Cup has fans rejoicing renaissance", "description": "Swelling fanbase has been in dreamland this past month as Zimbabwe have defied all expectations in the competition", "url": "https://www.theguardian.com/sport/2026/feb/25/zimbabwe-breakout-cricket-world-cup-supporters-rejoicing-renaissance", "image": "https://media.guim.co.uk/57170b6bfd404a0e029eb92825e336f3452038e3/183_0_1827_1462/500.jpg", "publishedAt": "2026-02-25T10:05:15Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "Zimbabwe rejects 'lopsided' US health aid deal over data concerns", "description": "Access to biological samples raised flags for Zimbabwe as the US did not want to share the benefits of its research.", "url": "https://www.bbc.com/news/articles/cwy6nd3664no", "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6ada/live/d161dbc0-1249-11f1-b048-c9424b2cf5fd.jpg", "publishedAt": "2026-02-25 13:39:40", "source": "The Bbc", "_source_api": "Newsdata.io"}], "more": [{"title": "How the Skeleton of Mutapa Times is Based on Sarah Charlesworth's Work", "description": "Conceptual artist Sarah Charlesworth's 1979 study of how newspapers covered a solar eclipse inspired the framework behind The Mutapa Times.", "url": "article.html?slug=2020-04-20-how-the-skeleton-of-mutapa-times-is-based-on-sarah-charlesworths-work", "image": "/img/uploads/imageedit_1_5381951801.jpg", "publishedAt": "2020-04-20T00:00:00.000Z", "source": "The Mutapa Times", "cms": true}, {"title": "Robert Mugabe’s son charged with attempted murder over Johannesburg shooting", "description": "Bellarmine Chatunga Mugabe, known for lavish lifestyle, also accused of theft and being illegal immigrant after man allegedly shot in back", "url": "article.html?slug=2026-02-23-robert-mugabes-son-charged-with-attempted-murder-over-johann", "image": "https://media.guim.co.uk/a777e1c818970c0301f21b6c3d44c79e5163732c/99_0_3832_3066/500.jpg", "publishedAt": "2026-02-23T13:48:00", "source": "The Mutapa Times", "cms": true}, {"title": "Councils fail to account for funds after ZINARA’s ZWG358 million disbursement for road maintenance", "description": "The Zimbabwe National Road Administration (ZINARA) disbursed over ZWG350 million to local authorities for road maintenance in 2025, but the lack of accountability by some councils has raised concerns over the utilisation of the funds. This was revealed by ZINARA Chief Executive Officer Nkosinathi Ncube during an appearance before the Parliamentary Portfolio Committee on Transport [...]The post Councils fail to account for funds after ZINARA’s ZWG358 million disbursement for road maintenance appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/councils-fail-to-account-for-funds-after-zinaras-zwg9billion-disbursement-for-road-maintenance/", "image": "", "publishedAt": "2026-02-27 00:05:04", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe owes Valterra Platinum $100 million in unpaid export proceeds", "description": "Reuters South Africa’s Valterra Platinum (VALJ.J), said on Wednesday it is owed $100 million in 2025 export proceeds by Zimbabwe’s government, which has started making some payments to clear the arrears. Zimbabwe requires all exporters to retain only 70% of their proceeds in foreign currency, with the balance being converted to local currency. Valterra and [...]The post Zimbabwe owes Valterra Platinum $100 million in unpaid export proceeds appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/zimbabwe-owes-valterra-platinum-100-million-in-unpaid-export-proceeds/", "image": "", "publishedAt": "2026-02-27 00:02:14", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe pushes manufacturers to use local raw materials under new strategy", "description": "Industry and Commerce Minister Dr Mangaliso Ndlovu has revealed that the government will soon roll out a Local Content Strategy aimed at promoting the use of locally manufactured raw materials in Zimbabwe’s manufacturing sector. The move comes as Zimbabwe continues to spend an estimated US$1.5 billion annually on industrial consumables, with basic imports such as [...]The post Zimbabwe pushes manufacturers to use local raw materials under new strategy appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/zimbabwe-pushes-manufacturers-to-use-local-raw-materials-under-new-strategy/", "image": "", "publishedAt": "2026-02-27 00:00:41", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "ZIMRA, Buy Zimbabwe in joint blitz to curb smuggling of goods", "description": "The Zimbabwe Revenue Authority (ZIMRA) and Buy Zimbabwe have intensified efforts to curb the smuggling of goods at various entry points, a practice identified as a major threat to local industry. Authorities in Zimbabwe have long struggled to combat the illegal importation of goods due to porous border posts and corruption. As a result, the [...]The post ZIMRA, Buy Zimbabwe in joint blitz to curb smuggling of goods appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/zimra-buy-zimbabwe-in-joint-blitz-to-curb-smuggling-of-goods/", "image": "", "publishedAt": "2026-02-27 00:00:26", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Pedros enters Zim, to create 600 jobs", "description": "Popular South African fast-food chain, Pedros Flame Grilled Chicken (Pedros), is set to enter the Zimbabwean market with plans to open 10...", "url": "https://dailynews.co.zw/pedros-enters-zim-to-create-600-jobs/", "image": "", "publishedAt": "2026-02-26 23:58:00", "source": "Dailynews", "_source_api": "Newsdata.io"}, {"title": "Africa’s Critical Minerals Moment: Why Zimbabwe’s Lithium Export Ban Signals a Continental Industrial Pivot", "description": "When Zimbabwe announced an immediate suspension on the export of raw lithium and other unprocessed minerals in late February 2026, the reaction was swift. Market traditionalists warned of distortion. Traders predicted supply disruptions. Some framed the move as economic nationalism. Yet to interpret Zimbabwe’s decision in isolation is to miss the structural shift underway across [...]The post Africa’s Critical Minerals Moment: Why Zimbabwe’s Lithium Export Ban Signals a Continental Industrial Pivot appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/africas-critical-minerals-moment-why-zimbabwes-lithium-export-ban-signals-a-continental-industrial-pivot/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/02/Zimbabwe-lithium.jpeg", "publishedAt": "2026-02-26 22:37:29", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "Econet to Delist from ZSE as Masiyiwa Unveils US$3 Billion AI and Infrastructure Vision", "description": "HARARE – Shareholders of Econet Wireless Zimbabwe have voted to delist the telecommunications group from the Zimbabwe Stock Exchange (ZSE), drawing the curtain on a 26-year chapter as a publicly traded company and signalling a strategic pivot towards an ambitious US$3 billion technology and infrastructure expansion. The resolution was approved at an extraordinary general meeting in [...]The post Econet to Delist from ZSE as Masiyiwa Unveils US$3 Billion AI and Infrastructure Vision appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/econet-to-delist-from-zse-as-masiyiwa-unveils-us3-billion-ai-and-infrastructure-vision/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/02/Econet-InfraCo.jpg", "publishedAt": "2026-02-26 22:21:17", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "Chivayo pledges $1 million to Zimbabwe cricket team", "description": "He says it’s reward for qualifying to the Top EightsThe post Chivayo pledges $1 million to Zimbabwe cricket team appeared first on Zimbabwe News Now.", "url": "https://www.zimlive.com/chivayo-pledges-1-million-to-zimbabwe-cricket-team/", "image": "", "publishedAt": "2026-02-26 20:32:43", "source": "Zimbabwean News", "_source_api": "Newsdata.io"}, {"title": "'Minister Machakaire must first attend Chitepo School of Ideology'", "description": "Minister Tino Machakaire’s policy on first attending Hebert Chitepo School of Ideology and making it mandatory before one can get a job is intellectually lazy. Machakaire is detached from reality.The ...", "url": "https://bulawayo24.com/index-id-opinion-sc-columnist-byo-262454.html", "image": "https://img.bulawayo24.com/articles/bulawayo24.png", "publishedAt": "2026-02-26 20:23:13", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "Police block PPRIZ constitutional amendment bill discussion", "description": "Police in Bulawayo have reportedly blocked a public meeting organised by the Public Policy Research Institute of Zimbabwe (PPRIZ) to discuss Constitutional Amendment No. 3 Bill, 2026. The event had be...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262452.html", "image": "https://img.bulawayo24.com/articles/bulawayo24.png", "publishedAt": "2026-02-26 19:59:38", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "Bail ruling for detained journalist set for Friday", "description": "The bail ruling in the case of detained journalist Gideon Madzikatidze of Bulawayo24 will be delivered on Friday, 27 February 2026, at the Harare Magistrates’ Court.Magistrate Ruth Moyo reserved her r...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262451.html", "image": "https://img.bulawayo24.com/articles/bulawayo24.png", "publishedAt": "2026-02-26 19:56:02", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "Brian Bennett’s Heroic Unbeaten 97 In Vain As India Eliminate Zimbabwe From T20 World Cup", "description": "Brian Bennett Smashes 97 Against India But Zimbabwe Bow Out Of T20 World Cup A sensational unbeaten knock of 97 runs from Zimbabwe’s young sensation Brian Bennett was the only shining light in an otherwise dominant performance by India, who crushed the Chevrons by 72 runs at the T20 World Cup to book their spot [...]The post Brian Bennett’s Heroic Unbeaten 97 In Vain As India Eliminate Zimbabwe From T20 World Cup appeared first on iHarare News.", "url": "https://iharare.com/brian-bennetts-heroic-97-in-vain-as-india-eliminate-zimbabwe-from-t20-world-cup/", "image": "https://iharare.com/wp-content/uploads/2022/03/Brian-Bennet-Vs-India-2-EspnCricInfo-1280px-t.webp", "publishedAt": "2026-02-26 19:30:11", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "If Zimbabwe feels cheated by the US in health deal then why are we beggars and not funding our own programs?", "description": "Source: If Zimbabwe feels cheated by the US in health deal then why are we beggars and not funding our own programs? Beggars are not choosers, it is said. Tendai Ruben Mbofana There is a peculiar brand of arrogance that only a beggar who feels entitled to the contents of a benefactor’s wallet can truly [...]The post If Zimbabwe feels cheated by the US in health deal then why are we beggars and not funding our own programs? appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/if-zimbabwe-feels-cheated-by-the-us-in-health-deal-then-why-are-we-beggars-and-not-funding-our-own-programs/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/file_000000008604722f8990ffbee81b35d8-18.png", "publishedAt": "2026-02-26 19:29:58", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Constitutional Amendment Bill Number 3 Contribution", "description": "Source: Constitutional Amendment Bill Number 3 Contribution Dear Clerk of Parliament Parliament of ZimbabweThank you for inviting Zimbabweans to contribute giving their views on the recently gazetted Constitutional Amendment Bill Number three. I hope that Zimbabweans will overwhelmingly contribute, and that their views will be taken on Board. My view is that this Bill has [...]The post Constitutional Amendment Bill Number 3 Contribution appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/constitutional-amendment-bill-number-3-contribution/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/parliament-zimbabwe.jpg", "publishedAt": "2026-02-26 19:29:53", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Tungwarara accepted into the Zanu-PF Central Committee", "description": "Source: Tungwarara accepted into the Zanu-PF Central Committee – herald Joseph Madzimure Zimpapers Politics Hub The Politburo on Wednesday confirmed the cooption of Presidential Advisor, Paul Tungwarara, into the Central Committee for Manicaland province. He replaced Cde Doroth Mabika who was elected Zanu PF Manicaland provincial chairlady. Zanu PF secretary for information and publicity, Cde [...]The post Tungwarara accepted into the Zanu-PF Central Committee appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/tungwarara-accepted-into-the-zanu-pf-central-committee/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/Untitled-80.jpg", "publishedAt": "2026-02-26 19:29:45", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}]}