{"articles": [{"title": "Zimbabwean breakout at T20 World Cup has fans rejoicing renaissance", "description": "Swelling fanbase has been in dreamland this past month as Zimbabwe have defied all expectations in the competition", "url": "https://www.theguardian.com/sport/2026/feb/25/zimbabwe-breakout-cricket-world-cup-supporters-rejoicing-renaissance", "image": "https://media.guim.co.uk/57170b6bfd404a0e029eb92825e336f3452038e3/183_0_1827_1462/500.jpg", "publishedAt": "2026-02-25T10:05:15Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "Zimbabwe rejects 'lopsided' US health aid deal over data concerns", "description": "Access to biological samples raised flags for Zimbabwe as the US did not want to share the benefits of its research.", "url": "https://www.bbc.com/news/articles/cwy6nd3664no", "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6ada/live/d161dbc0-1249-11f1-b048-c9424b2cf5fd.jpg", "publishedAt": "2026-02-25 13:39:40", "source": "The Bbc", "_source_api": "Newsdata.io"}, {"title": "South African army men recover two vehicles being smuggled in flooded Limpopo River into Zimbabwe", "description": "Thupeyo Muleya South African National Defence Force members deployed to patrol the border with Zimbabwe have recovered a Toyota Land Cruiser worth around R1,5 million that was being smuggled out...The post South African army men recover two vehicles being smuggled in flooded Limpopo River into Zimbabwe appeared first on herald.", "url": "https://www.heraldonline.co.zw/south-african-army-men-recover-two-vehicles-being-smuggled-in-flooded-limpopo-river-into-zimbabwe/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/sites/2/2020/08/South-African-Flag.jpg", "publishedAt": "2026-02-24 15:42:36", "source": "The Herald", "_source_api": "Newsdata.io"}], "more": [{"title": "How the Skeleton of Mutapa Times is Based on Sarah Charlesworth's Work", "description": "Conceptual artist Sarah Charlesworth's 1979 study of how newspapers covered a solar eclipse inspired the framework behind The Mutapa Times.", "url": "article.html?slug=2020-04-20-how-the-skeleton-of-mutapa-times-is-based-on-sarah-charlesworths-work", "image": "/img/uploads/imageedit_1_5381951801.jpg", "publishedAt": "2020-04-20T00:00:00.000Z", "source": "The Mutapa Times", "cms": true}, {"title": "RBZ presents 2026 monetary policy statement this Friday", "description": "Source: RBZ presents 2026 monetary policy statement this Friday – herald Business Reporter Business leaders and financial markets have their gaze fixed on the Reserve Bank of Zimbabwe’s 2026 Monetary Policy Statement presentation scheduled for Friday, with expectations centred on", "url": "article.html?slug=2026-02-23-rbz-presents-2026-monetary-policy-statement-this-friday", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/RBZ.jpg", "publishedAt": "2026-02-23T23:28:00", "source": "The Mutapa Times", "cms": true}, {"title": "Robert Mugabe’s son charged with attempted murder over Johannesburg shooting", "description": "Bellarmine Chatunga Mugabe, known for lavish lifestyle, also accused of theft and being illegal immigrant after man allegedly shot in back", "url": "article.html?slug=2026-02-23-robert-mugabes-son-charged-with-attempted-murder-over-johann", "image": "https://media.guim.co.uk/a777e1c818970c0301f21b6c3d44c79e5163732c/99_0_3832_3066/500.jpg", "publishedAt": "2026-02-23T13:48:00", "source": "The Mutapa Times", "cms": true}, {"title": "Tungwarara Co-opted Into Zanu PF Central Committee", "description": "The ruling ZANU-PF party has approved the appointment of businessman Paul Tungwarara to its Central Committee in what party officials describe as a move aimed at injecting fresh ideas into its leadership. Announcing the decision after Politburo deliberations, ZANU-PF Secretary for Information and Publicity Christopher [...]The post Tungwarara Co-opted Into Zanu PF Central Committee appeared first on 263Chat.", "url": "https://www.263chat.com/tungwarara-co-opted-into-zanu-pf-central-committee/", "image": "https://www.263chat.com/wp-content/uploads/2026/02/image-54.png", "publishedAt": "2026-02-25 18:50:59", "source": "263chat", "_source_api": "Newsdata.io"}, {"title": "Health, Economic Growth, and Zimbabwe’s NDS2: Investing in a Productive Population", "description": "Zimbabwe’s National Development Strategy 2 (NDS2) aims to achieve industrialisation, private-sector-led growth, and enhanced human capital. Yet these ambitions depend on a foundational driver too often overlooked: population health. Health is not merely a social good; it is an economic strategy. By Brighton Musonza Evidence from global and regional contexts shows that healthier populations are [...]The post Health, Economic Growth, and Zimbabwe’s NDS2: Investing in a Productive Population appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/health-economic-growth-and-zimbabwes-nds2-investing-in-a-productive-population/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/02/Make-an-image-of-Zimbabwean-men-and-women-happy-and-laughing-in-an-industrial-production-factory-plant-990x660.png", "publishedAt": "2026-02-25 18:47:28", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "Ex-Football Stars Abbas Amidu And Reuben Mhlanga Sentenced To 12 Years For Drug Trafficking", "description": "Abbas Amidu And Reuben Mhlanga’s Dramatic Fall: 12 Years In Prison For 750kg Of Dagga In a stunning fall from grace, former football stars Abbas Amidu and Reuben Mhlanga have been sentenced to 12 years in prison each after being caught with a massive haul of dagga. The two, who once played for top clubs [...]The post Ex-Football Stars Abbas Amidu And Reuben Mhlanga Sentenced To 12 Years For Drug Trafficking appeared first on iHarare News.", "url": "https://iharare.com/ex-football-stars-abbas-amidu-and-reuben-mhlanga-sentenced-to-12-years-for-drug-trafficking/", "image": "", "publishedAt": "2026-02-25 18:45:01", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe prospect Teshaun Murisa signs professional contract with Arsenal", "description": "The 17-year-old Teshaun Murisa has been at Arsenal since he was just six years old and has now signed a senior contract 11 years after joining them. With his family alongside him at the Sobha Realty Training Centre, Teshaun put into perspective what a momentous day this was in his young career. “I’m very [...]The post Zimbabwe prospect Teshaun Murisa signs professional contract with Arsenal appeared first on ZIMBUZZ.", "url": "https://zimbuzz.co.zw/2026/02/25/zimbabwe-prospect-teshaun-murisa-signs-professional-contract-with-arsenal/", "image": "https://zimbuzz.co.zw/wp-content/uploads/2026/02/teshaun-article-image_mfejzo0t.jpg", "publishedAt": "2026-02-25 18:38:31", "source": "Zimbuzz", "_source_api": "Newsdata.io"}, {"title": "Plumtree fugitive Cabangani 'Predator' Mathe re‐arrested after deportation from Malawi", "description": "Dangerous fugitive Cabangani \"Predator\" Mathe has been re‐arrested following his deportation from Malawi, bringing an end to his cross‐border escape. Mathe, a 38‐year‐old former businessman from Plumt...", "url": "https://bulawayo24.com/index-id-news-sc-regional-byo-262422.html", "image": "https://img.bulawayo24.com/articles/WhatsApp_Image_2026-02-25_at_18.19.49.jpeg", "publishedAt": "2026-02-25 18:36:56", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "Jay-Z’s Roc Nation Locked in Representation Dispute Over Rising Football Star", "description": "Jay-Z’s sports agency Roc Nation is embroiled in a cross-border legal dispute with Maxidel Management over the representation rights of highly rated forward Yan Diomande, a conflict that could complicate the player’s anticipated summer transfer. Roc Nation recently announced the signing of the 19-year-old Yan Diomande, adding the RB Leipzig attacker to its roster of [...]The post Jay-Z’s Roc Nation Locked in Representation Dispute Over Rising Football Star appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/jay-zs-roc-nation-locked-in-representation-dispute-over-rising-football-star/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/02/Jay-Z.webp", "publishedAt": "2026-02-25 18:29:56", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "New Zealand Cruise to Victory Over Zimbabwe Women", "description": "By Kudzaiishe Zvaguma Zimbabwe senior Women’s cricket team suffered a heavy defeat to New Zealand in the opening Twenty20 International of their tour as the hosts secured a commanding 92-run win at Seddon Park on Wednesday. After winning the toss and electing to field, Zimbabwe [...]The post New Zealand Cruise to Victory Over Zimbabwe Women appeared first on 263Chat.", "url": "https://www.263chat.com/new-zealand-cruise-to-victory-over-zimbabwe-women/", "image": "https://www.263chat.com/wp-content/uploads/2026/02/image-53-1024x768.png", "publishedAt": "2026-02-25 18:15:49", "source": "263chat", "_source_api": "Newsdata.io"}, {"title": "Inside Prophet Passion Java’s SECOND DIVORCE: Here are the finer details the man of God won’t tell you!", "description": "HARARE – Prophet Passion Java (born Panganai Java), a figure synonymous with flamboyant spirituality and controversial pronouncements, recently announced the official dissolution of his marriage to Ethiopian-born Prophetess Lily Java. He cited a decision reached with “maturity, understanding, and peace”. However, for those familiar with the intricate dynamics of high-profile religious figures in Zimbabwe, such [...]The post Inside Prophet Passion Java’s SECOND DIVORCE: Here are the finer details the man of God won’t tell you! first appeared on My Zimbabwe News.", "url": "https://www.myzimbabwe.co.zw/news/186015-inside-prophet-passion-javas-second-divorce-here-are-the-finer-details-the-man-of-god-wont-tell-you.html", "image": "https://www.myzimbabwe.co.zw/wp-content/uploads/2026/02/Passion-Java-and-Lily-Java.jpg", "publishedAt": "2026-02-25 18:08:40", "source": "My Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Chivhu man arrested in connection with murder and attempted murder at Mudavanhu Village", "description": "Police in Chivhu have arrested a 74‐year‐old man in connection with a murder and attempted murder incident that occurred in Mudavanhu Village.The Zimbabwe Republic Police confirmed the arrest of Never...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262420.html", "image": "https://img.bulawayo24.com/articles/bulawayo24.png", "publishedAt": "2026-02-25 18:05:46", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "Patriotic Vendors4ED to unveil initiative in Mat North", "description": "Patriotic Vendors4ED says it is set to roll out a groundbreaking provincial launch in Matabeleland North, describing the upcoming event as an initiative \"never seen before\" in the province.The launch ...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262418.html", "image": "https://img.bulawayo24.com/articles/bulawayo24.png", "publishedAt": "2026-02-25 18:02:13", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "Chinese and Indian car brands taking over dealerships across South Africa", "description": "CAPE TOWN – Super Group has reported a stronger interim performance, with its dealership operations benefiting from sustained demand for competitively priced vehicles from Chinese and Indian manufacturers — a shift carrying growing relevance for Zimbabwe and the broader regional automotive market. In interim results for the six months ended 31 December 2025, according to [...]The post Chinese and Indian car brands taking over dealerships across South Africa appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/chinese-and-indian-car-brands-taking-over-dealerships-across-south-africa/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/02/Chinese-and-Indian-car-brands-taking-over-dealerships-across-South-Africa.webp", "publishedAt": "2026-02-25 16:43:45", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "Lock Brothers Bring Tourists to Harare", "description": "By Sports Reporter-One of Zimbabwe’s top tennis exports, Benjamin Lock, has pledged to bring his international tennis and golf associates to ... Continue reading \"Lock Brothers Bring Tourists to Harare\"", "url": "https://www.zimeye.net/2026/02/25/lock-brothers-bring-tourists-to-harare/", "image": "https://www.zimeye.net/wp-content/uploads/2026/02/54fe51de-0843-43ca-8b48-5678504d1028.png", "publishedAt": "2026-02-25 16:16:04", "source": "Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Mnangagwa Urges Allies to ‘Lead from the Front’ Amid Growing Economic Pressures", "description": "HARARE – President Emmerson Mnangagwa has called on members of the ruling ZANU PF Politburo to “lead from the front,” pressing senior party officials to drive implementation of Government programmes under the National Development Strategy 2 (NDS2). Addressing the party’s 390th Politburo Session at ZANU PF Headquarters in Harare on Thursday, Mnangagwa declared that the [...]The post Mnangagwa Urges Allies to ‘Lead from the Front’ Amid Growing Economic Pressures appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/mnangagwa-urges-allies-to-lead-from-the-front-amid-growing-economic-pressures/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/02/President-Mnangagwa.jpg", "publishedAt": "2026-02-25 16:11:17", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "ED Says 2026 Offers ‘Immense Opportunities’ for Economic Transformation", "description": "By Tinomudaishe Muzanenhamo President Emmerson Mnangagwa has said the country is entering a year of significant opportunity for economic growth and social transformation urging members of the ruling ZANU-PF to intensify efforts to drive development in line with the country’s Vision 2030 agenda. Addressing the [...]The post ED Says 2026 Offers ‘Immense Opportunities’ for Economic Transformation appeared first on 263Chat.", "url": "https://www.263chat.com/ed-says-2026-offers-immense-opportunities-for-economic-transformation/", "image": "https://www.263chat.com/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-25-at-5.18.32-PM-1024x682.jpeg", "publishedAt": "2026-02-25 15:38:20", "source": "263chat", "_source_api": "Newsdata.io"}, {"title": "Digital Fragmentation Is Becoming Zimbabwe’s Invisible Business Tax: Here’s How Smart Firms Are Responding", "description": "HARARE – Zimbabwean businesses have embraced digital tools with urgency. From CRMs to ERPs, accounting platforms to analytics dashboards, organisations are layering technology to improve efficiency, visibility, and control. Yet for many firms, the expected gains are colliding with an uncomfortable reality. More software does not always produce more performance. In fact, for a growing [...]The post Digital Fragmentation Is Becoming Zimbabwe’s Invisible Business Tax: Here’s How Smart Firms Are Responding appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/digital-fragmentation-is-becoming-zimbabwes-invisible-business-tax-heres-how-smart-firms-are-responding/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/02/Digital-AI.jpg", "publishedAt": "2026-02-25 15:36:42", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}]}