{"articles": [{"title": "Zimbabwean breakout at T20 World Cup has fans rejoicing renaissance", "description": "Swelling fanbase has been in dreamland this past month as Zimbabwe have defied all expectations in the competition", "url": "https://www.theguardian.com/sport/2026/feb/25/zimbabwe-breakout-cricket-world-cup-supporters-rejoicing-renaissance", "image": "https://media.guim.co.uk/57170b6bfd404a0e029eb92825e336f3452038e3/183_0_1827_1462/500.jpg", "publishedAt": "2026-02-25T10:05:15Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "Zimbabwe rejects 'lopsided' US health aid deal over data concerns", "description": "Access to biological samples raised flags for Zimbabwe as the US did not want to share the benefits of its research.", "url": "https://www.bbc.com/news/articles/cwy6nd3664no", "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6ada/live/d161dbc0-1249-11f1-b048-c9424b2cf5fd.jpg", "publishedAt": "2026-02-25 13:39:40", "source": "The Bbc", "_source_api": "Newsdata.io"}, {"title": "South African army men recover two vehicles being smuggled in flooded Limpopo River into Zimbabwe", "description": "Thupeyo Muleya South African National Defence Force members deployed to patrol the border with Zimbabwe have recovered a Toyota Land Cruiser worth around R1,5 million that was being smuggled out...The post South African army men recover two vehicles being smuggled in flooded Limpopo River into Zimbabwe appeared first on herald.", "url": "https://www.heraldonline.co.zw/south-african-army-men-recover-two-vehicles-being-smuggled-in-flooded-limpopo-river-into-zimbabwe/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/sites/2/2020/08/South-African-Flag.jpg", "publishedAt": "2026-02-24 15:42:36", "source": "The Herald", "_source_api": "Newsdata.io"}], "more": [{"title": "How the Skeleton of Mutapa Times is Based on Sarah Charlesworth's Work", "description": "Conceptual artist Sarah Charlesworth's 1979 study of how newspapers covered a solar eclipse inspired the framework behind The Mutapa Times.", "url": "article.html?slug=2020-04-20-how-the-skeleton-of-mutapa-times-is-based-on-sarah-charlesworths-work", "image": "/img/uploads/imageedit_1_5381951801.jpg", "publishedAt": "2020-04-20T00:00:00.000Z", "source": "The Mutapa Times", "cms": true}, {"title": "RBZ presents 2026 monetary policy statement this Friday", "description": "Source: RBZ presents 2026 monetary policy statement this Friday – herald Business Reporter Business leaders and financial markets have their gaze fixed on the Reserve Bank of Zimbabwe’s 2026 Monetary Policy Statement presentation scheduled for Friday, with expectations centred on", "url": "article.html?slug=2026-02-23-rbz-presents-2026-monetary-policy-statement-this-friday", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/RBZ.jpg", "publishedAt": "2026-02-23T23:28:00", "source": "The Mutapa Times", "cms": true}, {"title": "Robert Mugabe’s son charged with attempted murder over Johannesburg shooting", "description": "Bellarmine Chatunga Mugabe, known for lavish lifestyle, also accused of theft and being illegal immigrant after man allegedly shot in back", "url": "article.html?slug=2026-02-23-robert-mugabes-son-charged-with-attempted-murder-over-johann", "image": "https://media.guim.co.uk/a777e1c818970c0301f21b6c3d44c79e5163732c/99_0_3832_3066/500.jpg", "publishedAt": "2026-02-23T13:48:00", "source": "The Mutapa Times", "cms": true}, {"title": "Top Zimbabwe tennis duo the Lock brothers to bring tourists to Harare", "description": "HARARE - One of the Lock brothers, Benjamin is excited with developments at The Hills Luxury Golf Estate to the extent he has committed to bringing his tennis and golf friends to Harare to experience the city’s developing golf estate.The post Top Zimbabwe tennis duo the Lock brothers to bring tourists to Harare appeared first on Nehanda Radio.", "url": "https://nehandaradio.com/2026/02/25/top-zimbabwe-tennis-duo-the-lock-brothers-to-bring-tourists-to-harare/", "image": "https://nehandaradio.com/wp-content/uploads/2026/02/Benjamin-Lock-and-Michael-Chideme-at-The-Hills-Golf-Estate.webp", "publishedAt": "2026-02-25 13:30:01", "source": "Nehanda Radio", "_source_api": "Newsdata.io"}, {"title": "Interpol veteran calls for regional crackdown on Zimbabwe’s high-flying Chivayo family", "description": "SOUTH Africa’s retired Interpol ambassador and security strategist, Andy Mashaile has called for a regional law enforcement crackdown following the issuance of a warrant of arrest for high-profile Zimbabwean socialite and Zanu PF deputy secretary for information and publicity in Harare province, Joachim Chivayo, also known as G6. Earlier this week, IOL reported that the [...]The post Interpol veteran calls for regional crackdown on Zimbabwe’s high-flying Chivayo family appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/sa-interpol-veteran-calls-for-regional-crackdown-on-zimbabwes-high-flying-chivayo-family/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/02/Wicknell-and-Joachim-Chivayo.jpg", "publishedAt": "2026-02-25 13:29:28", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "Rick Ross, Omah Lay to headline ‘Hustle and Heritage’ in Zimbabwe", "description": "Zimbabwean music fans are gearing up for a star-studded weekend as Rick Ross and Omah Lay are set to arrive in the country on Friday ahead of the highly anticipated show, Hustle and Heritage. The international stars will share the stage with top local acts including “,”zimbabwe singer”], Freeman EXQ”], Takuraimbabwe singer”], ashl”,”zimbabwe singer”], Tamy [...]The post Rick Ross, Omah Lay to headline ‘Hustle and Heritage’ in Zimbabwe appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/rick-ross-omah-lay-to-headline-hustle-and-heritage-in-zimbabwe/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/01/Rick-Ross.jpg", "publishedAt": "2026-02-25 13:18:09", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "$TRONG WARNING to car owners as ZRP launches Zimbabwe’s most aggressive ‘NO MERCY’ traffic blitz, even fellow police officers are being FINED!", "description": "HARARE – Before the morning sun has barely cleared the horizon over the capital, for the thousands of motorists navigating the potholed arteries of Harare, the day would have already descended into a tactical battle for survival. The streets of Zimbabwe’s largest city have become a “war zone” as the Zimbabwe Republic Police (ZRP) launches [...]The post $TRONG WARNING to car owners as ZRP launches Zimbabwe’s most aggressive ‘NO MERCY’ traffic blitz, even fellow police officers are being FINED! first appeared on My Zimbabwe News.", "url": "https://www.myzimbabwe.co.zw/news/186011-trong-warning-to-car-owners-as-zrp-launches-zimbabwes-most-aggressive-no-mercy-traffic-blitz-even-fellow-police-officers-are-being-fined.html", "image": "https://www.myzimbabwe.co.zw/wp-content/uploads/2024/08/impounded-vehicles-zrp-police-zinara-vid.webp", "publishedAt": "2026-02-25 12:53:42", "source": "My Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Public Health Doctors Call for Dialogue After Zimbabwe–US Health Funding Talks Stall", "description": "HARARE – The Zimbabwe College of Public Health Physicians (ZCPHP) has called for renewed dialogue following the breakdown of negotiations between Zimbabwe and the United States over a proposed health funding Memorandum of Understanding (MoU). In a statement, the association of public health doctors cautioned that abrupt financing shifts could destabilise essential health programmes, particularly [...]The post Public Health Doctors Call for Dialogue After Zimbabwe–US Health Funding Talks Stall appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/public-health-doctors-call-for-dialogue-after-zimbabwe-us-health-funding-talks-stall/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/02/Doctor.png", "publishedAt": "2026-02-25 12:32:21", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "Mnangagwa Blocks US Health Funding, Citing Threats to Sovereignty", "description": "Tinashe Sambiri– Zimbabwe has officially rejected a proposed health funding agreement from the United States, with President Emmerson Mnangagwa directing ... Continue reading \"Mnangagwa Blocks US Health Funding, Citing Threats to Sovereignty\"", "url": "https://www.zimeye.net/2026/02/25/mnangagwa-blocks-us-health-funding-citing-threats-to-sovereignty/", "image": "https://www.zimeye.net/wp-content/uploads/2026/02/IMG_20260223_055404.jpg", "publishedAt": "2026-02-25 12:30:00", "source": "Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Phil Collins, Lauryn Hill, INXS, Iron Maiden, Luther Vandross and Shakira get Rock Hall nominations", "description": "NEW YORK — Phil Collins, Mariah Carey, Lauryn Hill, INXS, Iron Maiden, Luther Vandross and Shakira are some the 2026 nominees for induction into the Rock & Roll Hall of Fame, a wide net that includes rap, metal, R&B, hip-hop, Britpop, blues rock and pop. The hall revealed the list of 17 performer nominees Wednesday, [...]The post Phil Collins, Lauryn Hill, INXS, Iron Maiden, Luther Vandross and Shakira get Rock Hall nominations appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/phil-collins-lauryn-hill-inxs-iron-maiden-luther-vandross-and-shakira-get-rock-hall-nominations/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/02/Luther-Vandross.webp", "publishedAt": "2026-02-25 12:25:04", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe, Zambia, Mozambique validate boundary coordinates", "description": "The Zambia–Zimbabwe–Mozambique Tripartite Technical Committee is convening a six-day meeting from February 23–28 in Luangwa District to finalise and validate the computation of coordinates for the tri-junction river boundary point. Committee Chairperson Kelvin Chibangula, who also serves as Assistant Surveyor General at the Ministry of Lands and Natural Resources, said the meeting seeks to address [...]The post Zimbabwe, Zambia, Mozambique validate boundary coordinates appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/zimbabwe-zambia-mozambique-validate-boundary-coordinates/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/02/The-Zambia-Zimbabwe-Mozambique-Tripartite-Technical-Committee.jpg", "publishedAt": "2026-02-25 12:12:40", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "GENERAL CHIWENGA VS ZIYAMBI ZIYAMBI: The Secret ZANU PF Fight Over ‘One Man, One Vote’ That You Were Not Told About!", "description": "HARARE – To the casual observer, it looked like a minor disagreement between two senior government officials. Justice Minister Ziyambi Ziyambi made a seemingly academic point, claiming the liberation struggle was not primarily about “one man, one vote.” Days later, Vice President, General (retired) Constantino Chiwenga, the nation’s second-in-command, publicly corrected him, insisting that the [...]The post GENERAL CHIWENGA VS ZIYAMBI ZIYAMBI: The Secret ZANU PF Fight Over ‘One Man, One Vote’ That You Were Not Told About! first appeared on My Zimbabwe News.", "url": "https://www.myzimbabwe.co.zw/news/186006-general-chiwenga-vs-ziyambi-ziyambi-the-secret-zanu-pf-fight-over-one-man-one-vote-that-you-were-not-told-about.html", "image": "https://www.myzimbabwe.co.zw/wp-content/uploads/2026/02/General-Chiwenga-angry-ziyambi-ziyambi-mnangagwa-laughing.jpg", "publishedAt": "2026-02-25 11:54:12", "source": "My Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe Sables Receive Vehicle Sponsorship Ahead of Australia 2027 World Cup", "description": "Zimbabwe Sables Receive Vehicle Sponsorship Ahead of Australia 2027 World Cup The Zimbabwe Rugby Union has sealed a strategic partnership with CFAO Mobility Zimbabwe, which will provide crucial transport support to the senior national team. This comes as the Sables intensify their preparations for the 2027 World Cup campaign. The sponsorship package, unveiled yesterday, includes [...]The post Zimbabwe Sables Receive Vehicle Sponsorship Ahead of Australia 2027 World Cup appeared first on iHarare News.", "url": "https://iharare.com/zimbabwe-sables-receive-vehicle-sponsorship-ahead-of-australia-2027-world-cup/", "image": "", "publishedAt": "2026-02-25 09:23:34", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe Suspends Raw Mineral Exports", "description": "Government has suspended the export of all raw minerals and lithium concentrates with immediate effect, in a move the government says is aimed at protecting national interests and boosting value addition. Addressing journalists in Harare, Mines and Mining Development Minister, Polite Kambamura said the ban [...]The post Zimbabwe Suspends Raw Mineral Exports appeared first on 263Chat.", "url": "https://www.263chat.com/zimbabwe-suspends-raw-mineral-exports/", "image": "https://www.263chat.com/wp-content/uploads/2024/11/WhatsApp-Image-2024-11-19-at-4.37.06-PM.jpeg", "publishedAt": "2026-02-25 09:00:34", "source": "263chat", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe suspends all raw mineral and lithium concentrate exports", "description": "Kambanura made the announcement and said it is with immediate effect.The post Zimbabwe suspends all raw mineral and lithium concentrate exports first appeared on Three Men On a Boat.", "url": "https://3-mob.com/news/zimbabwe-suspends-all-raw-mineral-and-lithium-concentrate-exports/", "image": "https://3-mob.com/wp-content/uploads/2026/02/pexels-photo-383559.jpeg", "publishedAt": "2026-02-25 08:52:25", "source": "Three Men On Boat", "_source_api": "Newsdata.io"}, {"title": "Zimbabwean Lawyer Expelled From Kenya For Allegedly Bankrolling Anti-Government Protests", "description": "Zimbabwean Lawyer Expelled From Kenya For Allegedly Funding Anti-Government Protests Zimbabwean constitutional lawyer Brian Bright Kagoro has been dramatically expelled from Kenya after security chiefs accused him of bankrolling a shadowy plot to reignite anti-government protests. The 51-year-old legal eagle was pounced upon by immigration officers at Jomo Kenyatta International Airport on Sunday evening, February [...]The post Zimbabwean Lawyer Expelled From Kenya For Allegedly Bankrolling Anti-Government Protests appeared first on iHarare News.", "url": "https://iharare.com/zimbabwean-lawyer-expelled-from-kenya-for-allegedly-funding-anti-government-protests/", "image": "", "publishedAt": "2026-02-25 08:48:19", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Kenya expels Zimbabwean lawyer over alleged role in protest mobilisation", "description": "The Eastleigh Voice Kenya has deported Zimbabwean constitutional lawyer Brian Bright Kagoro after security agencies accused him of involvement in a foreign-supported network allegedly seeking to stir anti-government protests. Kagoro, 51, was stopped by immigration officers at Jomo Kenyatta International Airport on Sunday evening and declared persona non grata before being put on a return flight. [...]The post Kenya expels Zimbabwean lawyer over alleged role in protest mobilisation appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/kenya-expels-zimbabwean-lawyer-over-alleged-role-in-protest-mobilisation/", "image": "", "publishedAt": "2026-02-25 08:44:17", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Zimbabwean lawyer, rights activist Brian Kagoro is expelled from Kenya", "description": "He is accused of coordinating efforts to mobilise political dissent in KenyaThe post Zimbabwean lawyer, rights activist Brian Kagoro is expelled from Kenya appeared first on Zimbabwe News Now.", "url": "https://www.zimlive.com/zimbabwean-lawyer-rights-activist-brian-kagoro-is-expelled-from-kenya/", "image": "", "publishedAt": "2026-02-25 08:35:13", "source": "Zimbabwean News", "_source_api": "Newsdata.io"}]}