{"articles": [{"title": "South African army men recover two vehicles being smuggled in flooded Limpopo River into Zimbabwe", "description": "Thupeyo Muleya South African National Defence Force members deployed to patrol the border with Zimbabwe have recovered a Toyota Land Cruiser worth around R1,5 million that was being smuggled out...The post South African army men recover two vehicles being smuggled in flooded Limpopo River into Zimbabwe appeared first on herald.", "url": "https://www.heraldonline.co.zw/south-african-army-men-recover-two-vehicles-being-smuggled-in-flooded-limpopo-river-into-zimbabwe/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/sites/2/2020/08/South-African-Flag.jpg", "publishedAt": "2026-02-24 15:42:36", "source": "The Herald", "_source_api": "Newsdata.io"}, {"title": "Report responsibly on children issues: ZMC", "description": "Moffat Mungazi Post Reporter MEDIA coverage on issues involving children must always uphold professional and ethical standards so as to protect the minors’ safety and wellbeing, the Zimbabwe Media Commission...The post Report responsibly on children issues: ZMC appeared first on herald.", "url": "https://www.heraldonline.co.zw/report-responsibly-on-children-issues-zmc/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/02/Media-coverage.jpg", "publishedAt": "2026-02-24 09:23:34", "source": "The Herald", "_source_api": "Newsdata.io"}], "more": [{"title": "How the Skeleton of Mutapa Times is Based on Sarah Charlesworth's Work", "description": "Conceptual artist Sarah Charlesworth's 1979 study of how newspapers covered a solar eclipse inspired the framework behind The Mutapa Times.", "url": "article.html?slug=2020-04-20-how-the-skeleton-of-mutapa-times-is-based-on-sarah-charlesworths-work", "image": "/img/uploads/imageedit_1_5381951801.jpg", "publishedAt": "2020-04-20T00:00:00.000Z", "source": "The Mutapa Times", "cms": true}, {"title": "RBZ presents 2026 monetary policy statement this Friday", "description": "Source: RBZ presents 2026 monetary policy statement this Friday – herald Business Reporter Business leaders and financial markets have their gaze fixed on the Reserve Bank of Zimbabwe’s 2026 Monetary Policy Statement presentation scheduled for Friday, with expectations centred on", "url": "article.html?slug=2026-02-23-rbz-presents-2026-monetary-policy-statement-this-friday", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/RBZ.jpg", "publishedAt": "2026-02-23T23:28:00", "source": "The Mutapa Times", "cms": true}, {"title": "From AI ethics to infrastructure gaps, leaders urge deeper digital cooperation at Kuwait forum", "description": "KUWAIT CITY — Global leaders gathering in Kuwait this week said the trajectory of digital transformation will depend as much on cooperation and governance as on technological advancement, with artificial intelligence taking centre stage in the discussions. The message emerged during a multilateral cooperation session at the Digital Cooperation Organization (DCO) Forum, moderated by Pamela [...]The post From AI ethics to infrastructure gaps, leaders urge deeper digital cooperation at Kuwait forum appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/from-ai-ethics-to-infrastructure-gaps-leaders-urge-deeper-digital-cooperation-at-kuwait-forum/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/02/From-AI-ethics-to-infrastructure-gaps-leaders-urge-deeper-digital-cooperation-at-Kuwait-forum.jpg", "publishedAt": "2026-02-24 19:14:04", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "NetOne Transforms Zimbabwe’s Digital Landscape with Tourist Connectivity and Data Reforms", "description": "NetOne Zimbabwe is leading the digital revolution with the launch of specialized Tourist SIMs and optimized data windows to boost connectivity and tourism.", "url": "https://zimetro.co.zw/netone-transforms-zimbabwes-digital-landscape-with-tourist-connectivity-and-data-reforms/", "image": "https://zimetro.co.zw/wp-content/uploads/2026/02/NetOne_Tourist_SIM.avif", "publishedAt": "2026-02-24 18:55:15", "source": "Zimetro News", "_source_api": "Newsdata.io"}, {"title": "Custom Rolls-Royce Wraith heads to Zimbabwe, Mnangagwa’s People Continue to Pilage and Plunder", "description": "A customised Rolls-Royce Wraith fitted with the striking Apollo Venuum body kit is ready for delivery to Zimbabwe from Pharoah Auto Investments in South Africa. The luxury grand tourer has been transformed with aggressive styling enhancements under the Apollo Venuum package, giving the already imposing Wraith an even more commanding road presence. Adding a personal [...]The post Custom Rolls-Royce Wraith heads to Zimbabwe, Mnangagwa’s People Continue to Pilage and Plunder appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/custom-rolls-royce-wraith-heads-to-zimbabwe-mnangagwas-people-continue-to-pilage-and-plunder/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/02/Custom-Rolls-Royce-Wraith-heads-to-Zimbabwe.jpg", "publishedAt": "2026-02-24 18:48:56", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "What happens when a professional football team ceases to exist?", "description": "What happens when a professional football team ceases to exist? A professional football team might cease to exist due to a number of reasons. With the sports betting in Zambia 1xBet platform, you can wager on plenty of football squads too. This may happen due to 3 reasons: Once that happens, the club’s immediate shutdown [...]The post What happens when a professional football team ceases to exist? appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/what-happens-when-a-professional-football-team-ceases-to-exist/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/wimble.jpg", "publishedAt": "2026-02-24 18:47:46", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Mabiza defends Zimbabwe at UN Human Rights Council session", "description": "Zimbabwe's Attorney-General Virginia Mabiza yesterday addressed the 61st Session of the United Nations Human Rights Council in Geneva, Switzerland, where she presented the country's position on human ...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262385.html", "image": "https://img.bulawayo24.com/articles/Mrs-Mabiza.jpg", "publishedAt": "2026-02-24 18:41:53", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "Pedros launches 10 Zimbabwe outlets", "description": "South African fast-food brand Pedros Flame Grilled Chicken is set to create approximately 300 jobs in Zimbabwe as it rolls out an initial 10 outlets by February next year.Founded in 2018, the flame-gr...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262384.html", "image": "https://img.bulawayo24.com/articles/pedros_boss.jpg", "publishedAt": "2026-02-24 18:23:14", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "Chivayo brothers G6 and Pharoah wanted in South Africa over R15 million gold case", "description": "BRAKPAN, South Africa - Joachim “G6” Chivayo and Ayanda Brian Gungwa also known as Pharoah in Zimbabwe, who are brothers of controversial businessman and President Emmerson Mnangagwa’s ally Wicknell Chivayo, have been declared as wanted by South Africa’s Directorate for Priority Crime Investigation (Hawks) after failing to appear in court in connection with a R15 million gold case.The post Chivayo brothers G6 and Pharoah wanted in South Africa over R15 million gold case appeared first on Nehanda Radio.", "url": "https://nehandaradio.com/2026/02/24/chivayo-brothers-g6-and-pharoah-wanted-in-south-africa-over-r15-million-gold-case/", "image": "https://nehandaradio.com/wp-content/uploads/2024/11/Joachim-Chivayo.webp", "publishedAt": "2026-02-24 18:20:58", "source": "Nehanda Radio", "_source_api": "Newsdata.io"}, {"title": "CPJ demands release of Zimbabwe journalist", "description": "The Committee to Protect Journalists (CPJ) has called on Zimbabwean authorities to immediately release journalist Gideon Madzikatidze, who has been in detention since February 18 on charges of cyberbu...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262383.html", "image": "https://img.bulawayo24.com/articles/Gideon_Madzikatidze.png", "publishedAt": "2026-02-24 18:16:59", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "NetOne Steers Zimbabwe’s Digital Future with Innovative Solutions", "description": "The telecoms provider says recent product enhancements and service rollouts reflect its broader vision of strengthening Zimbabwe’s digital ecosystem while delivering value to consumers, businesses and communities.The post NetOne Steers Zimbabwe’s Digital Future with Innovative Solutions appeared first on 263Chat.", "url": "https://www.263chat.com/netone-steers-zimbabwes-digital-future-with-innovative-solutions/", "image": "https://www.263chat.com/wp-content/uploads/2018/11/NetOne-Projects.jpg", "publishedAt": "2026-02-24 16:39:12", "source": "263chat", "_source_api": "Newsdata.io"}, {"title": "Opposition leader backs Mnangagwa term extension", "description": "Opposition People's Unity Party (PUP) leader Herbert Chamuka has stunned the political landscape by throwing his support behind President Emmerson Mnangagwa's proposed term extension, while also backi...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262378.html", "image": "https://img.bulawayo24.com/articles/Hebert_Chamuka.jpeg", "publishedAt": "2026-02-24 16:18:19", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "Timely Boost for Sables as CFAO Mobility Comes On Board", "description": "The Sables have received a timely boost after CFAO Mobility Zimbabwe was unveiled as the official transport partner of Zimbabwe Rugby Union for the next two years. The national team will be transported by CFAO during training camps and whenever they are travelling around Zimbabwe. Head coach Pieter Benade was handed a Toyota Hilux, [...]The post Timely Boost for Sables as CFAO Mobility Comes On Board appeared first on ZIMBUZZ.", "url": "https://zimbuzz.co.zw/2026/02/24/timely-boost-for-sables-as-cfao-mobility-comes-on-board/", "image": "https://zimbuzz.co.zw/wp-content/uploads/2026/02/641496759_1319019016929183_49629.jpg", "publishedAt": "2026-02-24 16:07:27", "source": "Zimbuzz", "_source_api": "Newsdata.io"}, {"title": "What is an election cycle?", "description": "An election cycle, sometimes called an \"electoral cycle,\" is a well-established concept in electoral practice, which is all too familiar to students of electoral politics and electoral law. All countr...", "url": "https://bulawayo24.com/index-id-opinion-sc-columnist-byo-262376.html", "image": "https://img.bulawayo24.com/articles/Jonathan-Moyo_0000.jpg", "publishedAt": "2026-02-24 15:54:01", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "GZU signs MoU to modernise ICT services", "description": "George Maponga Masvingo Bureau GREAT Zimbabwe University (GZU) has inked an MoU with Norpax Technologies and Huawei in a landmark development set to revolutionise teaching and learning at the institution...The post GZU signs MoU to modernise ICT services appeared first on herald.", "url": "https://www.heraldonline.co.zw/gzu-signs-mou-to-modernise-ict-services/", "image": "", "publishedAt": "2026-02-24 15:49:23", "source": "H-metro", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe Calls for Harmonised Border Systems to Cut Corridor Delays", "description": "HARARE– Zimbabwe has called for stronger coordination with South Africa and Zambia to address persistent bottlenecks along key regional transport corridors, as senior government officials met in Harare for the Trilateral Joint Route Management Group and Joint Committee meetings. Opening the three-day meeting at the [...]The post Zimbabwe Calls for Harmonised Border Systems to Cut Corridor Delays appeared first on 263Chat.", "url": "https://www.263chat.com/zimbabwe-calls-for-harmonised-border-systems-to-cut-corridor-delays/", "image": "https://www.263chat.com/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-24-at-16.25.10-1024x768.jpeg", "publishedAt": "2026-02-24 15:45:48", "source": "263chat", "_source_api": "Newsdata.io"}, {"title": "Blood and Hippo Meat: The Strange ‘Rituals’ and Hidden Messages at Zanu PF Kingmaker Obert Mpofu’s Homestead", "description": "NYAMANDLOVU – The morning air in Epping Forest is usually thick with the scent of dry earth and cattle, but this week, it carried the metallic tang of fresh blood and the heavy, gamey aroma of hippo meat. When two massive hippopotamuses wandered into the Nyamandlovu rural homestead of ZANU PF Politburo member and veteran [...]The post Blood and Hippo Meat: The Strange ‘Rituals’ and Hidden Messages at Zanu PF Kingmaker Obert Mpofu’s Homestead first appeared on My Zimbabwe News.", "url": "https://www.myzimbabwe.co.zw/news/185987-blood-and-hippo-meat-the-strange-rituals-and-hidden-messages-at-zanu-pf-kingmaker-obert-mpofus-homestead.html", "image": "https://www.myzimbabwe.co.zw/wp-content/uploads/2026/02/mpofu-obert-mouth-large.jpg", "publishedAt": "2026-02-24 15:25:07", "source": "My Zimbabwe News", "_source_api": "Newsdata.io"}]}
