{"articles": [], "more": [{"title": "RBZ presents 2026 monetary policy statement this Friday", "description": "Source: RBZ presents 2026 monetary policy statement this Friday – herald Business Reporter Business leaders and financial markets have their gaze fixed on the Reserve Bank of Zimbabwe’s 2026 Monetary Policy Statement presentation scheduled for Friday, with expectations centred on interest rate direction, currency stability and measures to unlock productive credit. The central bank has [...]The post RBZ presents 2026 monetary policy statement this Friday appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/rbz-presents-2026-monetary-policy-statement-this-friday/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/RBZ.jpg", "publishedAt": "2026-02-23 23:28:39", "source": "Zimbabwe Situation"}, {"title": "Tobacco farmers push for decentralisation of auction floors", "description": "Source: Tobacco farmers push for decentralisation of auction floors – herald Edgar Vhera, edgar.vhera@zimpapers.co.zw FARMERS have urged the Tobacco Industry and Marketing Board (TIMB) to decentralise tobacco auction floors by operationalising the Tobacco Value Chain Transformation Plan 2 (TVCTP 2), covering the period 2026 to 2030. This emerged during a recent stakeholders meeting in Harare to [...]The post Tobacco farmers push for decentralisation of auction floors appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/tobacco-farmers-push-for-decentralisation-of-auction-floors/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/hdrf.jpg", "publishedAt": "2026-02-23 23:28:19", "source": "Zimbabwe Situation"}, {"title": "If ZANU-PF needs two more years to finish its “development programs” does that mean it isn’t confident of winning in 2028?", "description": "Source: If ZANU-PF needs two more years to finish its “development programs” does that mean it isn’t confident of winning in 2028? Fear can be repackaged and presented as strategy. Tendai Ruben Mbofana The political landscape in Zimbabwe has often been a theater of the absurd, but the latest narrative emerging from the corridors of [...]The post If ZANU-PF needs two more years to finish its “development programs” does that mean it isn’t confident of winning in 2028? appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/if-zanu-pf-needs-two-more-years-to-finish-its-development-programs-does-that-mean-it-isnt-confident-of-winning-in-2028/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/watermarked-9d28ecb2-a37c-4f07-82dd-319b2a9f1294-14.jpg", "publishedAt": "2026-02-23 23:27:54", "source": "Zimbabwe Situation"}, {"title": "NO MERCY EVEN FOR COPS IN CRACKDOWN", "description": "Source: NO MERCY EVEN FOR COPS IN CRACKDOWN – herald Arron Nyamayaro POLICE are not sparring anyone when it comes to their crackdown on rogue elements on the country’s roads. Even police officers are being caught up in the crackdown and an officer was fined yesterday for reckless driving. Constable Masuka, who is based in [...]The post NO MERCY EVEN FOR COPS IN CRACKDOWN appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/no-mercy-even-for-cops-in-crackdown/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/Untitled-5-20.jpg", "publishedAt": "2026-02-23 23:27:35", "source": "Zimbabwe Situation"}, {"title": "What went wrong with the Mugabe children?", "description": "Source: What went wrong with the Mugabe children? When things fall apart, questions are inevitably asked. Tendai Ruben Mbofana The tragic irony of the Mugabe legacy is no longer found in the history books of the liberation struggle but rather in the grim charge sheets of police stations across Southern Africa. To directly receive my [...]The post What went wrong with the Mugabe children? appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/what-went-wrong-with-the-mugabe-children/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/file_000000008604722f8990ffbee81b35d8-15.png", "publishedAt": "2026-02-23 23:26:37", "source": "Zimbabwe Situation"}, {"title": "Govt to power all schools, clinics", "description": "Mukudzei Chingwere Senior Reporter The Government has set a target to electrify all schools and clinics across the country by the end of this year, a move that will bolster ongoing efforts to transform both the education and health sectors under the Second Republic. This was announced by Energy and Power Development Minister July Moyo, [...]The post Govt to power all schools, clinics appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/govt-to-power-all-schools-clinics/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/02/HE.jpg", "publishedAt": "2026-02-23 23:12:42", "source": "Zimbabwe Situation"}, {"title": "MAN DIES AFTER BEING STABBED WHILE RELIEVING HIMSELF IN A BUSHY AREA", "description": "Lloyd Mwale in KADOMA A MAN died at Kadoma General Hospital last week after he was stabbed while relieving himself at a bushy area near a high school. John Nazaza was 42. Family spokesperson, Leo Nazaza, said the deceased was attacked by two unidentified men while he was relieving himself in the bush near Munyaradzi [...]The post MAN DIES AFTER BEING STABBED WHILE RELIEVING HIMSELF IN A BUSHY AREA appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/man-dies-after-being-stabbed-while-relieving-himself-in-a-bushy-area/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/02/Untitled-10-18.jpg", "publishedAt": "2026-02-23 23:11:57", "source": "Zimbabwe Situation"}, {"title": "Bulawayo rolls out twice yearly HIV injection", "description": "Andile Tshuma, andile.tshuma@ztn.co.zw BULAWAYO has marked a significant milestone in Zimbabwe’s fight against HIV with the launch yesterday of Lenacapavir, a long-acting injectable pre-exposure prophylaxis (PrEP) that is administered just twice a year. Scores of key vulnerable groups, including sex workers, thronged the “Sisters Clinic at Centre for Sexual Health and HIV/Aids Research” housed at the [...]The post Bulawayo rolls out twice yearly HIV injection appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/bulawayo-rolls-out-twice-yearly-hiv-injection/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/02/fgef.jpg", "publishedAt": "2026-02-23 23:08:18", "source": "Zimbabwe Situation"}, {"title": "FATHER ASKS TEEN DAUGHTER IF SHE IS STILL A VIRGIN, REPEATEDLY RAPES HER UNTIL SHE FALLS PREGNANT", "description": "Zvikomborero Parafini A WATERFALLS man asked his teenage daughter whether she was still a virgin before allegedly raping her on multiple occasions until she fell pregnant. The 40-year-old father (whose name has been withheld to protect the identity of the victim) has been arrested. He was not asked to plead when he appeared before Harare [...]The post FATHER ASKS TEEN DAUGHTER IF SHE IS STILL A VIRGIN, REPEATEDLY RAPES HER UNTIL SHE FALLS PREGNANT appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/father-asks-teen-daughter-if-she-is-still-a-virgin-repeatedly-rapes-her-until-she-falls-pregnant/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/02/Untitled-3-22.jpg", "publishedAt": "2026-02-23 23:07:41", "source": "Zimbabwe Situation"}, {"title": "Hubs for broadcast content", "description": "Farirai Machivenyika Senior Reporter IN a move aimed at fostering homegrown talent and enhancing the nation’s creative landscape, the Government is set to establish content creation hubs for the broadcast sector, aligning with the objectives of the National Development Strategy 2 and the National Media Policy. The NDS2 recognises content creation as a pillar of [...]The post Hubs for broadcast content appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/hubs-for-broadcast-content/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/02/Mangwana.jpg", "publishedAt": "2026-02-23 23:06:37", "source": "Zimbabwe Situation"}]}