{"articles": [{"title": "Zimbabwean breakout at T20 World Cup has fans rejoicing renaissance", "description": "Swelling fanbase has been in dreamland this past month as Zimbabwe have defied all expectations in the competition", "url": "https://www.theguardian.com/sport/2026/feb/25/zimbabwe-breakout-cricket-world-cup-supporters-rejoicing-renaissance", "image": "https://media.guim.co.uk/57170b6bfd404a0e029eb92825e336f3452038e3/183_0_1827_1462/500.jpg", "publishedAt": "2026-02-25T10:05:15Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "South African army men recover two vehicles being smuggled in flooded Limpopo River into Zimbabwe", "description": "Thupeyo Muleya South African National Defence Force members deployed to patrol the border with Zimbabwe have recovered a Toyota Land Cruiser worth around R1,5 million that was being smuggled out...The post South African army men recover two vehicles being smuggled in flooded Limpopo River into Zimbabwe appeared first on herald.", "url": "https://www.heraldonline.co.zw/south-african-army-men-recover-two-vehicles-being-smuggled-in-flooded-limpopo-river-into-zimbabwe/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/sites/2/2020/08/South-African-Flag.jpg", "publishedAt": "2026-02-24 15:42:36", "source": "The Herald", "_source_api": "Newsdata.io"}, {"title": "Report responsibly on children issues: ZMC", "description": "Moffat Mungazi Post Reporter MEDIA coverage on issues involving children must always uphold professional and ethical standards so as to protect the minors’ safety and wellbeing, the Zimbabwe Media Commission...The post Report responsibly on children issues: ZMC appeared first on herald.", "url": "https://www.heraldonline.co.zw/report-responsibly-on-children-issues-zmc/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/02/Media-coverage.jpg", "publishedAt": "2026-02-24 09:23:34", "source": "The Herald", "_source_api": "Newsdata.io"}], "more": [{"title": "How the Skeleton of Mutapa Times is Based on Sarah Charlesworth's Work", "description": "Conceptual artist Sarah Charlesworth's 1979 study of how newspapers covered a solar eclipse inspired the framework behind The Mutapa Times.", "url": "article.html?slug=2020-04-20-how-the-skeleton-of-mutapa-times-is-based-on-sarah-charlesworths-work", "image": "/img/uploads/imageedit_1_5381951801.jpg", "publishedAt": "2020-04-20T00:00:00.000Z", "source": "The Mutapa Times", "cms": true}, {"title": "RBZ presents 2026 monetary policy statement this Friday", "description": "Source: RBZ presents 2026 monetary policy statement this Friday – herald Business Reporter Business leaders and financial markets have their gaze fixed on the Reserve Bank of Zimbabwe’s 2026 Monetary Policy Statement presentation scheduled for Friday, with expectations centred on", "url": "article.html?slug=2026-02-23-rbz-presents-2026-monetary-policy-statement-this-friday", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/RBZ.jpg", "publishedAt": "2026-02-23T23:28:00", "source": "The Mutapa Times", "cms": true}, {"title": "Robert Mugabe’s son charged with attempted murder over Johannesburg shooting", "description": "Bellarmine Chatunga Mugabe, known for lavish lifestyle, also accused of theft and being illegal immigrant after man allegedly shot in back", "url": "article.html?slug=2026-02-23-robert-mugabes-son-charged-with-attempted-murder-over-johann", "image": "https://media.guim.co.uk/a777e1c818970c0301f21b6c3d44c79e5163732c/99_0_3832_3066/500.jpg", "publishedAt": "2026-02-23T13:48:00", "source": "The Mutapa Times", "cms": true}, {"title": "Financial Advisor Gambles Away R2.6M In 7 Days After Taking Advantage Of Bank Error, Entire Estate Seized", "description": "Financial Advisor Gambles Away R2.6 Million After Bank Error In Just 7 Days A Cape Town financial advisor blew more than R2.6 million in one week after discovering a bank glitch that allowed him spend money he didn’t have. Now the court has seized everything he owns. Izak Petrus Van Zyl exploited an Investec error [...]The post Financial Advisor Gambles Away R2.6M In 7 Days After Taking Advantage Of Bank Error, Entire Estate Seized appeared first on iHarare News.", "url": "https://iharare.com/financial-advisor-gambles-away-r2-6m-in-7-days-after-taking-advantage-of-bank-error/", "image": "", "publishedAt": "2026-02-25 06:57:16", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "‘Chatunga must go to jail’: MMA fighter Themba Gorimbo calls for Mugabe’s son arrest", "description": "Themba Gorimbo’s bold call for Chatunga Mugabe’s arrest reignites conversations about corruption, rule of law, victims’ rights and leadership accountability.The post ‘Chatunga must go to jail’: MMA fighter Themba Gorimbo calls for Mugabe’s son arrest appeared first on iHarare News.", "url": "https://iharare.com/chatunga-must-go-to-jail-mma-fighter-themba-gorimbo-calls-for-mugabes-son-arrest/", "image": "", "publishedAt": "2026-02-25 06:37:40", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Zimbabwean youngster Murisa signs first Arsenal professional contract", "description": "The 17-year-old has been with the current league leaders since he was six.The post Zimbabwean youngster Murisa signs first Arsenal professional contract first appeared on Three Men On a Boat.", "url": "https://3-mob.com/sport/zimbabwean-youngster-murisa-signs-first-arsenal-professional-contract/", "image": "https://3-mob.com/wp-content/uploads/2026/02/Teshaun-Murisa-PIC-Aarsenal.webp", "publishedAt": "2026-02-25 06:33:22", "source": "Three Men On Boat", "_source_api": "Newsdata.io"}, {"title": "Missing car keys and US$100 demand: Chaos in Harare CBD as inDrive driver clashes with prostitute at 4am", "description": "HARARE – Under the flickering orange glow of the streetlights on Nelson Mandela Avenue, the air is often thick with the scent of cheap perfume and exhaust fumes. It is 4:00 am, the hour when the capital city’s night owls and early birds collide in a desperate dance for survival. For one inDrive driver, this [...]The post Missing car keys and US$100 demand: Chaos in Harare CBD as inDrive driver clashes with prostitute at 4am first appeared on My Zimbabwe News.", "url": "https://www.myzimbabwe.co.zw/news/185997-missing-car-keys-and-us100-demand-chaos-in-harare-cbd-as-indrive-driver-clashes-with-prostitute-at-4am.html", "image": "https://www.myzimbabwe.co.zw/wp-content/uploads/2026/02/indrive-driver-and-miriam-mahove-the-prostitute.jpg", "publishedAt": "2026-02-25 06:33:18", "source": "My Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "US Embassy Confirms It’s Shutting Down Lifesaving HIV, TB, And Malaria Programs After Zimbabwe Rejects US$367M Deal", "description": "The United States Embassy has confirmed it is pulling the plug on lifesaving health programs in Zimbabwe, including HIV/AIDS treatment, tuberculosis control, and malaria prevention, after President Emmerson Mnangagwa rejected a massive US$367 million (approximately R6.8 billion) funding deal over sovereignty concerns. The devastating decision puts 1.2 million Zimbabweans currently receiving antiretroviral drugs through US-supported [...]The post US Embassy Confirms It’s Shutting Down Lifesaving HIV, TB, And Malaria Programs After Zimbabwe Rejects US$367M Deal appeared first on iHarare News.", "url": "https://iharare.com/us-embassy-confirms-shutdown-of-lifesaving-hiv-tb-and-malaria-programs-in-zimbabwe/", "image": "", "publishedAt": "2026-02-25 06:04:48", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "STATEMENT: Passion Java and his wife Lily divorces", "description": "In official statement, Passion Java and Lily announce divorce, explain reasons, urge privacy, emphasise mutual respect and shared responsibilities ahead.The post STATEMENT: Passion Java and his wife Lily divorces appeared first on iHarare News.", "url": "https://iharare.com/statement-passion-java-and-his-wife-lily-divorces/", "image": "https://iharare.com/wp-content/uploads/2026/02/639748674_18533915539070164_3570212295427386274_n-1024x1024.jpg", "publishedAt": "2026-02-25 05:32:11", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "SA fast food chain makes Zim bow", "description": "Source: SA fast food chain makes Zim bow -Newsday Zimbabwe South African fast-food chain Pedros Flame Grilled Chicken is set to create about 300 jobs in Zimbabwe as it rolls out an initial 10 outlets by February next year.The brand, founded in *2018* and now operating more than 210 stores across South Africa, Zambia, Botswana [...]The post SA fast food chain makes Zim bow appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/sa-fast-food-chain-makes-zim-bow/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/HbXSXfsC7MJ2adOD6DndFW7gq3OIwSzYCprrMdP8.jpg", "publishedAt": "2026-02-25 03:42:51", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Citizens push back on Mnangagwa’s term extension", "description": "Source: Citizens push back on Mnangagwa’s term extension -Newsday Zimbabwe Sanyati residents have urged their Member of Parliament, Polite Kambamura, not to support proposed constitutional amendments that would extend President Emmerson Mnangagwa’s tenure by two years, keeping him in office until 2030. The Constitutional Amendment Bill No 3, gazetted last week, gives Parliament the power [...]The post Citizens push back on Mnangagwa’s term extension appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/citizens-push-back-on-mnangagwas-term-extension/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/nJh1t77A3GHr1UoLritXBcNPKRS8uR0IzNkZLFJy-scaled.jpg", "publishedAt": "2026-02-25 03:41:56", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Govt, Pfizer sign landmark health equity Accord", "description": "Source: Govt, Pfizer sign landmark health equity Accord – herald Trust Freddy Herald Correspondent GOVERNMENT has formally signed onto the Pfizer Accord for a Healthier World, a high-level agreement designed to provide the nation with equitable access to patented medicines and vaccines on a not-for-profit basis. Health and Child Care Minister Dr Douglas Mombeshora yesterday [...]The post Govt, Pfizer sign landmark health equity Accord appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/govt-pfizer-sign-landmark-health-equity-accord/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/DM1-1.jpg", "publishedAt": "2026-02-25 03:40:35", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Polarization is part of any democracy and can never justify extending presidential terms", "description": "Source: Polarization is part of any democracy and can never justify extending presidential terms When those in power place their own failures on a constitution. Tendai Ruben Mbofana ​The current discourse surrounding the proposed Constitutional Amendment No 3 Bill in Zimbabwe represents a profound misunderstanding of democratic principles or, more likely, a deliberate attempt to [...]The post Polarization is part of any democracy and can never justify extending presidential terms appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/polarization-is-part-of-any-democracy-and-can-never-justify-extending-presidential-terms/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/file_000000008604722f8990ffbee81b35d8-16.png", "publishedAt": "2026-02-25 03:40:00", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "From AI ethics to infrastructure gaps, leaders urge deeper digital cooperation at Kuwait forum", "description": "KUWAIT CITY — Global leaders gathering in Kuwait this week said the trajectory of digital transformation will depend as much on cooperation and governance as on technological advancement, with artificial intelligence taking centre stage in the discussions. The message emerged during a multilateral cooperation session at the Digital Cooperation Organization (DCO) Forum, moderated by Pamela [...]The post From AI ethics to infrastructure gaps, leaders urge deeper digital cooperation at Kuwait forum appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/from-ai-ethics-to-infrastructure-gaps-leaders-urge-deeper-digital-cooperation-at-kuwait-forum/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/02/From-AI-ethics-to-infrastructure-gaps-leaders-urge-deeper-digital-cooperation-at-Kuwait-forum.jpg", "publishedAt": "2026-02-24 19:14:04", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "NetOne Transforms Zimbabwe’s Digital Landscape with Tourist Connectivity and Data Reforms", "description": "NetOne Zimbabwe is leading the digital revolution with the launch of specialized Tourist SIMs and optimized data windows to boost connectivity and tourism.", "url": "https://zimetro.co.zw/netone-transforms-zimbabwes-digital-landscape-with-tourist-connectivity-and-data-reforms/", "image": "https://zimetro.co.zw/wp-content/uploads/2026/02/NetOne_Tourist_SIM.avif", "publishedAt": "2026-02-24 18:55:15", "source": "Zimetro News", "_source_api": "Newsdata.io"}, {"title": "Custom Rolls-Royce Wraith heads to Zimbabwe, Mnangagwa’s People Continue to Pilage and Plunder", "description": "A customised Rolls-Royce Wraith fitted with the striking Apollo Venuum body kit is ready for delivery to Zimbabwe from Pharoah Auto Investments in South Africa. The luxury grand tourer has been transformed with aggressive styling enhancements under the Apollo Venuum package, giving the already imposing Wraith an even more commanding road presence. Adding a personal [...]The post Custom Rolls-Royce Wraith heads to Zimbabwe, Mnangagwa’s People Continue to Pilage and Plunder appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/custom-rolls-royce-wraith-heads-to-zimbabwe-mnangagwas-people-continue-to-pilage-and-plunder/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/02/Custom-Rolls-Royce-Wraith-heads-to-Zimbabwe.jpg", "publishedAt": "2026-02-24 18:48:56", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "What happens when a professional football team ceases to exist?", "description": "What happens when a professional football team ceases to exist? A professional football team might cease to exist due to a number of reasons. With the sports betting in Zambia 1xBet platform, you can wager on plenty of football squads too. This may happen due to 3 reasons: Once that happens, the club’s immediate shutdown [...]The post What happens when a professional football team ceases to exist? appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/what-happens-when-a-professional-football-team-ceases-to-exist/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/wimble.jpg", "publishedAt": "2026-02-24 18:47:46", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Mabiza defends Zimbabwe at UN Human Rights Council session", "description": "Zimbabwe's Attorney-General Virginia Mabiza yesterday addressed the 61st Session of the United Nations Human Rights Council in Geneva, Switzerland, where she presented the country's position on human ...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262385.html", "image": "https://img.bulawayo24.com/articles/Mrs-Mabiza.jpg", "publishedAt": "2026-02-24 18:41:53", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}]}