{"articles": [{"title": "Rising anger over ‘lop-sided’ and ‘immoral’ US health funding pacts with African countries", "description": "Zimbabwe refuses to sign agreement and Kenya faces a court case over data sharing as new aid deals come under scrutiny", "url": "https://www.theguardian.com/global-development/2026/feb/27/rising-anger-over-lop-sided-immoral-us-health-funding-pacts-africa-countries", "image": "https://media.guim.co.uk/052f71618f81a5e32d654d7d911f9002cd98f9e0/967_502_3452_2762/500.jpg", "publishedAt": "2026-02-27T07:00:34Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "Zimbabwean breakout at T20 World Cup has fans rejoicing renaissance", "description": "Swelling fanbase has been in dreamland this past month as Zimbabwe have defied all expectations in the competition", "url": "https://www.theguardian.com/sport/2026/feb/25/zimbabwe-breakout-cricket-world-cup-supporters-rejoicing-renaissance", "image": "https://media.guim.co.uk/57170b6bfd404a0e029eb92825e336f3452038e3/183_0_1827_1462/500.jpg", "publishedAt": "2026-02-25T10:05:15Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "Zimbabwe rejects 'lopsided' US health aid deal over data concerns", "description": "Access to biological samples raised flags for Zimbabwe as the US did not want to share the benefits of its research.", "url": "https://www.bbc.com/news/articles/cwy6nd3664no", "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6ada/live/d161dbc0-1249-11f1-b048-c9424b2cf5fd.jpg", "publishedAt": "2026-02-25 13:39:40", "source": "The Bbc", "_source_api": "Newsdata.io"}], "more": [{"title": "How the Skeleton of Mutapa Times is Based on Sarah Charlesworth's Work", "description": "Conceptual artist Sarah Charlesworth's 1979 study of how newspapers covered a solar eclipse inspired the framework behind The Mutapa Times.", "url": "article.html?slug=2020-04-20-how-the-skeleton-of-mutapa-times-is-based-on-sarah-charlesworths-work", "image": "/img/uploads/imageedit_1_5381951801.jpg", "publishedAt": "2020-04-20T00:00:00.000Z", "source": "The Mutapa Times", "cms": true}, {"title": "President Mnangagwa applauds academic-military synergy", "description": "Zvamaida Murwira Senior Reporter Zimbabwe Defence Forces Commander-in-Chief, President Mnangagwa, has commended the partnership between Midlands State University and the Zimbabwe Military Academy (ZMA) in training officer cadets, stating that...The post President Mnangagwa applauds academic-military synergy appeared first on herald.", "url": "https://www.heraldonline.co.zw/president-mnangagwa-applauds-academic-military-synergy/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/02/HE1-2.jpg", "publishedAt": "2026-02-27 16:11:57", "source": "H-metro", "_source_api": "Newsdata.io"}, {"title": "RBZ abandons 2030 multi-currency deadline, unveils new ZiG banknotes", "description": "HARARE - The Reserve Bank of Zimbabwe (RBZ) has abandoned its fixed 2030 deadline for ending the multi-currency system, shifting its focus instead to achieving key economic conditions, while also preparing to roll out new ZiG banknotes aimed at improving transaction efficiency and strengthening the local currency.The post RBZ abandons 2030 multi-currency deadline, unveils new ZiG banknotes appeared first on Nehanda Radio.", "url": "https://nehandaradio.com/2026/02/27/rbz-abandons-2030-multi-currency-deadline-unveils-new-zig-banknotes/", "image": "https://nehandaradio.com/wp-content/uploads/2024/04/John-Mushayavanhu-2.jpg", "publishedAt": "2026-02-27 16:11:29", "source": "Nehanda Radio", "_source_api": "Newsdata.io"}, {"title": "Assessing the status of qualifications and work experience in the agriculture sector in Zimbabwe and across Africa – Part 1", "description": "Tapuwa Justice Mashangwa Agriculture remains the backbone of many African economies, providing livelihoods, food security and export earnings. In Zimbabwe and across the continent, the sector continues to evolve from...The post Assessing the status of qualifications and work experience in the agriculture sector in Zimbabwe and across Africa – Part 1 appeared first on herald.", "url": "https://www.heraldonline.co.zw/assessing-the-status-of-qualifications-and-work-experience-in-the-agriculture-sector-in-zimbabwe-and-across-africa-part-1/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/02/Gwebi-Agricultural-College.jpg", "publishedAt": "2026-02-27 16:04:02", "source": "H-metro", "_source_api": "Newsdata.io"}, {"title": "RBZ slashes bank charges", "description": "The new measures will come into effect on 31 MarchThe post RBZ slashes bank charges first appeared on Three Men On a Boat.", "url": "https://3-mob.com/news/rbz-slashes-bank-charges/", "image": "https://3-mob.com/wp-content/uploads/2026/02/pexels-photo-5497952.jpeg", "publishedAt": "2026-02-27 15:48:04", "source": "Three Men On Boat", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe scraps 2030 deadline for single currency", "description": "Announcement made by RBZ governorThe post Zimbabwe scraps 2030 deadline for single currency first appeared on Three Men On a Boat.", "url": "https://3-mob.com/news/zimbabwe-scraps-2030-deadline-for-single-currency/", "image": "https://3-mob.com/wp-content/uploads/2016/11/rbz-logo.jpg", "publishedAt": "2026-02-27 15:37:23", "source": "Three Men On Boat", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe central bank develops algorithm-based forex trading system", "description": "The Reserve Bank of Zimbabwe (RBZ) is developing an algorithm-based electronic foreign exchange trading system aimed at eliminating manual intervention in exchange rate determination and enhancing tra...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262482.html", "image": "https://img.bulawayo24.com/articles/rbz", "publishedAt": "2026-02-27 15:26:38", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "Ncube Charts Transition from Stabilisation to Growth at NUST Budget Indaba", "description": "BULAWAYO – Mthuli Ncube today delivered a keynote address at the Graduate School of Business Sciences Indaba held at the National University of Science and Technology (NUST), outlining the strategic direction of the 2026 National Budget and its alignment with the country’s long-term development agenda. The event, convened under the theme “Aligning the 2026 Budget [...]The post Ncube Charts Transition from Stabilisation to Growth at NUST Budget Indaba appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/ncube-charts-transition-from-stabilisation-to-growth-at-nust-budget-indaba/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/02/Finance-Minister-Professor-Mthuli-Ncube.jpg", "publishedAt": "2026-02-27 15:01:29", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "Econet shareholders approve ZSE exit, InfraCo restructuring", "description": "Business Reporter Minority shareholders of Econet Wireless Zimbabwe Limited (both institutional and retail) have voted overwhelmingly to approve the group’s voluntary delisting from the Zimbabwe Stock Exchange (ZSE), with all...The post Econet shareholders approve ZSE exit, InfraCo restructuring appeared first on herald.", "url": "https://www.heraldonline.co.zw/econet-shareholders-approve-zse-exit-infraco-restructuring-2/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/02/Econet-Wireless.jpg", "publishedAt": "2026-02-27 14:51:44", "source": "H-metro", "_source_api": "Newsdata.io"}, {"title": "The RAF Marham Files: Why Former British Prime Minister Gordon Brown is Risking Everything to Expose Epstein’s UK Flight Path", "description": "The quiet Norfolk countryside, home to the Royal Air Force base at Marham, has long been a bastion of British security. Yet, beneath its stoic facade, a shadow looms, cast by the controversial figure of Jeffrey Epstein and a perplexing flight that landed on its tarmac in December 2000. This seemingly isolated incident has now [...]The post The RAF Marham Files: Why Former British Prime Minister Gordon Brown is Risking Everything to Expose Epstein’s UK Flight Path first appeared on My Zimbabwe News.", "url": "https://www.myzimbabwe.co.zw/news/186055-the-raf-marham-files-why-former-british-prime-minister-gordon-brown-is-risking-everything-to-expose-epsteins-uk-flight-path.html", "image": "https://www.myzimbabwe.co.zw/wp-content/uploads/2026/02/Thumbnail-Gordon-Brown-on-Epstein-UK-Flight-Path.jpg", "publishedAt": "2026-02-27 14:14:00", "source": "My Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "“From Crayons to Couture”: Strive Masiyiwa Celebrates Daughter Joanna’s Launch of AMAYI Luxury Clothing Brand", "description": "“From Crayons to Couture”: Strive Masiyiwa Celebrates Daughter Joanna’s Launch of AMAYI Luxury Clothing Brand Strive Masiyiwa has shared a proud moment as his daughter, Joanna, officially launched her first women’s wear collection under the luxury brand AMAYI. The 28-year-old entrepreneur has created a future-vintage fashion house focused on scarcity, craftsmanship, and cultural memory, aiming [...]The post “From Crayons to Couture”: Strive Masiyiwa Celebrates Daughter Joanna’s Launch of AMAYI Luxury Clothing Brand appeared first on iHarare News.", "url": "https://iharare.com/strive-masiyiwa-celebrates-daughter-joannas-launch-of-amayi-luxury-clothing-brand/", "image": "", "publishedAt": "2026-02-27 14:07:19", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Zim Hosts Summit to Drive Digital Transformation in Schools", "description": "By Tinomudaishe Muzanenhamo Zimbabwe is set to host a major education and technology summit next week aimed at accelerating digital transformation in schools and preparing learners for an artificial intelligence-driven future. The Smart Education Seminar 2026, organised by the Smart Zimbabwe Business Network, will take [...]The post Zim Hosts Summit to Drive Digital Transformation in Schools appeared first on 263Chat.", "url": "https://www.263chat.com/zim-hosts-summit-to-drive-digital-transformation-in-schools/", "image": "https://www.263chat.com/wp-content/uploads/2026/02/image-60-1024x683.png", "publishedAt": "2026-02-27 13:22:59", "source": "263chat", "_source_api": "Newsdata.io"}, {"title": "New Zealand Women Cruise to Series Lead with Emphatic Win Over Zim", "description": "By Kudzaiishe Zvaguma New Zealand Women delivered a commanding all-round performance to defeat Zimbabwe Women by 110 runs in the second T20 international at Seddon Park on Thursday, taking an unassailable 2-0 lead in the series. After winning the toss, the hosts chose to bat [...]The post New Zealand Women Cruise to Series Lead with Emphatic Win Over Zim appeared first on 263Chat.", "url": "https://www.263chat.com/new-zealand-women-cruise-to-series-lead-with-emphatic-win-over-zim/", "image": "https://www.263chat.com/wp-content/uploads/2026/02/image-53-1024x768.png", "publishedAt": "2026-02-27 13:09:04", "source": "263chat", "_source_api": "Newsdata.io"}, {"title": "Former Tsvangirai Aide Receives Death Threats Over Opposing Constitutional Amendment Bill", "description": "Tinashe Sambiri – Jameson Timba, a former aide to the late MDC founding president Morgan Tsvangirai, has reportedly received threatening ... Continue reading \"Former Tsvangirai Aide Receives Death Threats Over Opposing Constitutional Amendment Bill\"", "url": "https://www.zimeye.net/2026/02/27/former-tsvangirai-aide-receives-death-threats-over-opposing-constitutional-amendment-bill/", "image": "https://www.zimeye.net/wp-content/uploads/2018/07/jameson-timba.jpg", "publishedAt": "2026-02-27 13:00:00", "source": "Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "RBZ unveils new ZWG notes to start circulating April 7", "description": "THE Reserve Bank of Zimbabwe (RBZ) has revealed new ZiG10, ZiG20 and ZiG50 banknotes which start circulation on April with the ZiG100 and ZiG200 to be introduced later. The designs of the new notes pay tribute to the Big Five wildlife. Presenting the 2026 Monetary Policy Statement Friday, RBZ Governor John Mushayavanhu confirmed that the [...]The post RBZ unveils new ZWG notes to start circulating April 7 appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/rbz-unveils-new-zwg-notes-to-start-circulating-april-7/", "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2026/02/27125401/new-zig-e1772197173384-1024x768.jpeg", "publishedAt": "2026-02-27 12:59:55", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Tight Monetary Policy Steering Economy Towards Stability: RBZ", "description": "By Tinomudaishe Muzanenhamo Reserve Bank of Zimbabwe Governor John Mushayavanhu says strict monetary controls are beginning to stabilise the economy, with inflation easing to single-digit levels for the first time in years. Presenting the 2026 Monetary Policy Statement, Mushayavanhu said tight control of money supply [...]The post Tight Monetary Policy Steering Economy Towards Stability: RBZ appeared first on 263Chat.", "url": "https://www.263chat.com/tight-monetary-policy-steering-economy-towards-stability-rbz/", "image": "https://www.263chat.com/wp-content/uploads/2024/04/Mushayavanhu.jpg", "publishedAt": "2026-02-27 12:53:47", "source": "263chat", "_source_api": "Newsdata.io"}]}