{"articles": [{"title": "Zimbabwean breakout at T20 World Cup has fans rejoicing renaissance", "description": "Swelling fanbase has been in dreamland this past month as Zimbabwe have defied all expectations in the competition", "url": "https://www.theguardian.com/sport/2026/feb/25/zimbabwe-breakout-cricket-world-cup-supporters-rejoicing-renaissance", "image": "https://media.guim.co.uk/57170b6bfd404a0e029eb92825e336f3452038e3/183_0_1827_1462/500.jpg", "publishedAt": "2026-02-25T10:05:15Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "Zimbabwe rejects 'lopsided' US health aid deal over data concerns", "description": "Access to biological samples raised flags for Zimbabwe as the US did not want to share the benefits of its research.", "url": "https://www.bbc.com/news/articles/cwy6nd3664no", "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6ada/live/d161dbc0-1249-11f1-b048-c9424b2cf5fd.jpg", "publishedAt": "2026-02-25 13:39:40", "source": "The Bbc", "_source_api": "Newsdata.io"}, {"title": "South African army men recover two vehicles being smuggled in flooded Limpopo River into Zimbabwe", "description": "Thupeyo Muleya South African National Defence Force members deployed to patrol the border with Zimbabwe have recovered a Toyota Land Cruiser worth around R1,5 million that was being smuggled out...The post South African army men recover two vehicles being smuggled in flooded Limpopo River into Zimbabwe appeared first on herald.", "url": "https://www.heraldonline.co.zw/south-african-army-men-recover-two-vehicles-being-smuggled-in-flooded-limpopo-river-into-zimbabwe/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/sites/2/2020/08/South-African-Flag.jpg", "publishedAt": "2026-02-24 15:42:36", "source": "The Herald", "_source_api": "Newsdata.io"}], "more": [{"title": "How the Skeleton of Mutapa Times is Based on Sarah Charlesworth's Work", "description": "Conceptual artist Sarah Charlesworth's 1979 study of how newspapers covered a solar eclipse inspired the framework behind The Mutapa Times.", "url": "article.html?slug=2020-04-20-how-the-skeleton-of-mutapa-times-is-based-on-sarah-charlesworths-work", "image": "/img/uploads/imageedit_1_5381951801.jpg", "publishedAt": "2020-04-20T00:00:00.000Z", "source": "The Mutapa Times", "cms": true}, {"title": "Robert Mugabe’s son charged with attempted murder over Johannesburg shooting", "description": "Bellarmine Chatunga Mugabe, known for lavish lifestyle, also accused of theft and being illegal immigrant after man allegedly shot in back", "url": "article.html?slug=2026-02-23-robert-mugabes-son-charged-with-attempted-murder-over-johann", "image": "https://media.guim.co.uk/a777e1c818970c0301f21b6c3d44c79e5163732c/99_0_3832_3066/500.jpg", "publishedAt": "2026-02-23T13:48:00", "source": "The Mutapa Times", "cms": true}, {"title": "Prophet Walter Magaya Linked to Drug Scandal After Police Raid at Yadah Hotel", "description": "Prophet Walter Magaya Linked to Drug Scandal After Police Raid at Yadah Hotel The founder of PHD Ministries, Prophet Walter Magaya, has been drawn into a widening drug trafficking scandal following a police raid at his hotel. Detectives reportedly uncovered a substantial stash of medicines during a search operation at Yadah Hotel, triggering criminal proceedings [...]The post Prophet Walter Magaya Linked to Drug Scandal After Police Raid at Yadah Hotel appeared first on iHarare News.", "url": "https://iharare.com/prophet-walter-magaya-linked-to-drug-scandal-after-police-raid-at-yadah-hotel/", "image": "", "publishedAt": "2026-02-26 06:33:32", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Fresh faces, Big chance: Rassie Erasmus names youth-laced Springboks squad", "description": "Rassie Erasmus unveils a youth-laced Springboks squad, giving fresh faces big chances to shine in upcoming international rugby tests soon.The post Fresh faces, Big chance: Rassie Erasmus names youth-laced Springboks squad appeared first on iHarare News.", "url": "https://iharare.com/fresh-faces-big-chance-rassie-erasmus-names-youth-laced-springboks-squad/", "image": "", "publishedAt": "2026-02-26 05:57:44", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Retail giant OK Zimbabwe goes under corporate rescue after massive losses, revenue collapse", "description": "EMBATTLED retail giant OK Zimbabwe has been placed under Corporate Rescue following a resolution passed by its board of directors, as the company battles a deepening financial crisis marked by heavy losses, store closures and declining creditor confidence. Once regarded as one of Zimbabwe’s largest and most dominant retail chains, the company is now navigating [...]The post Retail giant OK Zimbabwe goes under corporate rescue after massive losses, revenue collapse appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/retail-giant-ok-zimbabwe-goes-under-corporate-rescue-after-massive-losses-revenue-collapse/", "image": "", "publishedAt": "2026-02-26 05:42:55", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Why Zimbabwe rejected a million-dollar US health funding deal", "description": "Zimbabwe’s rejection of a million-dollar US health funding deal sparks debate over aid dependence, economic policy, national interests and accountability.The post Why Zimbabwe rejected a million-dollar US health funding deal appeared first on iHarare News.", "url": "https://iharare.com/why-zimbabwe-rejected-a-million-dollar-us-health-funding-deal/", "image": "", "publishedAt": "2026-02-26 05:38:59", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Parliament invites public input on Constitutional Amendment (No.3) Bill which proposes extension of presidential term", "description": "The Parliament of Zimbabwe has invited the public to submit their views on the proposed Constitution of Zimbabwe Amendment (No. 3) Bill (H.B. 1), 2026, following its recent gazetting. The proposed amendment includes extending the presidential term from the current five years to seven years and introducing a parliamentary process for the election of the [...]The post Parliament invites public input on Constitutional Amendment (No.3) Bill which proposes extension of presidential term appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/parliament-invites-public-input-on-constitutional-amendment-no-3-bill-which-proposes-extension-of-presidential-term/", "image": "", "publishedAt": "2026-02-26 05:30:45", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Academies plan massive protest over exorbitant ZIFA charges, set to petition Magwizi", "description": "– We were never consulted, we don’t know who spoke on our behalf FOOTBALL academies operating across Zimbabwe are set to deliver a petition in protest to ZIFA’s recent decision to hike registration fees, annual levies and player registration charges. They argue, in a petition seen by this publication, that ZIFA neither consulted nor acknowledged [...]The post Academies plan massive protest over exorbitant ZIFA charges, set to petition Magwizi appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/academies-plan-massive-protest-over-exorbitant-zifa-charges-set-to-petition-magwizi/", "image": "", "publishedAt": "2026-02-26 05:05:41", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Former footballers Abbas Amidu, Reuben Mhlanga sentenced to 12 years in jail prison for drug dealing", "description": "Former CAPS United and Kaizer Chiefs player Abbas Amidu has been sentenced to 12 years in prison after being convicted of dealing in dangerous drugs. Amidu was sentenced alongside his accomplice, Reuben Kudzai Mhlanga, a former Dynamos player. The duo was arrested in June last year along the Harare-Bulawayo highway after they were found in [...]The post Former footballers Abbas Amidu, Reuben Mhlanga sentenced to 12 years in jail prison for drug dealing appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/former-footballers-abbas-amidu-reuben-mhlanga-sentenced-to-12-years-in-jail-prison-for-drug-dealing/", "image": "", "publishedAt": "2026-02-26 05:02:40", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe can fund it’s health sector with minerals says Hwende, labels US$367 million American deal a joke", "description": "Opposition legislator Chalton Hwende has said that Zimbabwe possesses the capacity to finance its own healthcare system without relying on external support, provided that corruption in the mineral resources sector is addressed. Hwende’s sentiments follow President Emmerson Mnangagwa’s decision to terminate a proposed five-year health funding deal with the United States, worth US$367 million. In [...]The post Zimbabwe can fund it’s health sector with minerals says Hwende, labels US$367 million American deal a joke appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/zimbabwe-can-fund-its-health-sector-with-minerals-says-hwende-labels-us367-million-american-deal-a-joke/", "image": "", "publishedAt": "2026-02-26 04:21:09", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Lock brothers eye global spotlight for The Hills Luxury Golf Estate, plan to bring international athletes and investors", "description": "One of the Lock brothers, Benjamin Lock, says he is excited by developments at The Hills Luxury Golf Estate and has committed to bringing his tennis and golf colleagues to Harare to experience the emerging world-class facility. Lock said he also plans to introduce property investors to The Hills, noting growing interest among professional athletes [...]The post Lock brothers eye global spotlight for The Hills Luxury Golf Estate, plan to bring international athletes and investors appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/lock-brothers-eye-global-spotlight-for-the-hills-luxury-golf-estate-plan-to-bring-international-athletes-and-investors/", "image": "", "publishedAt": "2026-02-26 04:17:14", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe women fall to New Zealand in T20I series opener", "description": "The New Zealand women’s national cricket team, the White Ferns, secured a 92-run victory over Zimbabwe in the opening match of their T20 International series at Seddon Park. After Zimbabwe won the toss and elected to bowl, they were immediately put on the back foot. New Zealand’s captain, Amelia Kerr, led from the front with [...]The post Zimbabwe women fall to New Zealand in T20I series opener appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/zimbabwe-women-fall-to-new-zealand-in-t20i-series-opener/", "image": "", "publishedAt": "2026-02-26 00:10:42", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Interpol veteran calls for regional crackdown on Zimbabwe’s high-flying Chivayo wanted by Hawks", "description": "IOL Retired Interpol ambassador and security strategist Andy Mashaile has called for a regional law enforcement crackdown following the issuance of a warrant of arrest for high-profile Zimbabwean socialite and Zanu PF deputy secretary for information and publicity in Harare province, Joachim Chivayo, also known as G6. Earlier this week, IOL reported that the Directorate for Priority Crime [...]The post Interpol veteran calls for regional crackdown on Zimbabwe’s high-flying Chivayo wanted by Hawks appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/interpol-veteran-calls-for-regional-crackdown-on-zimbabwes-high-flying-chivayo-wanted-by-hawks/", "image": "https://iol-prod.appspot.com/image/5df625adabb4f18224589fb6a91f08f4293469d7=w700", "publishedAt": "2026-02-26 00:05:03", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "NGO petitions Parliament to enact new law protecting Zimbabwe’s senior citizens, pensioners", "description": "A non-governmental organisation, Power of Touch Institution, has petitioned Parliament to enact legislation specifically designed to protect senior citizens, pensioners and retired professionals amid growing concerns over their welfare. Presenting the petition on Monday before the Parliament of Zimbabwe’s Portfolio Committee on Public Service and Social Welfare, the organisation’s leaders, Francis Dembetembe and Beatrice Sithole, [...]The post NGO petitions Parliament to enact new law protecting Zimbabwe’s senior citizens, pensioners appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/ngo-petitions-parliament-to-enact-new-law-protecting-zimbabwes-senior-citizens-pensioners/", "image": "", "publishedAt": "2026-02-26 00:00:51", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Let monetary policy anchor people’s hope", "description": "THE nation tomorrow turns its eyes toward the Reserve Bank of Zimbabwe (RBZ) as it presents the 2026 Monetary Policy Statement (MPS).For... To access this content, please purchase a subscription by clicking the button below and select a package of your choice!Subscriptions", "url": "https://dailynews.co.zw/let-monetary-policy-anchor-peoples-hope/", "image": "", "publishedAt": "2026-02-26 00:00:00", "source": "Dailynews", "_source_api": "Newsdata.io"}, {"title": "Zimpost, Telco partner to power green logistics", "description": "ZIMBABWE Posts (Zimpost) is shedding its traditional image to become the heartbeat of the nation’s green revolution following a recent landmark strategic... To access this content, please purchase a subscription by clicking the button below and select a package of your choice!Subscriptions", "url": "https://dailynews.co.zw/zimpost-telco-partner-to-power-green-logistics/", "image": "", "publishedAt": "2026-02-26 00:00:00", "source": "Dailynews", "_source_api": "Newsdata.io"}, {"title": "Stage set for Nama awards night", "description": "DIRECTOR of the National Arts Council of Zimbabwe (Nacz), Napoleon Nyanhi, says preparations are complete for the 24th edition of the National... To access this content, please purchase a subscription by clicking the button below and select a package of your choice!Subscriptions", "url": "https://dailynews.co.zw/stage-set-for-nama-awards-night/", "image": "", "publishedAt": "2026-02-26 00:00:00", "source": "Dailynews", "_source_api": "Newsdata.io"}]}