{"articles": [{"title": "Zimbabwean breakout at T20 World Cup has fans rejoicing renaissance", "description": "Swelling fanbase has been in dreamland this past month as Zimbabwe have defied all expectations in the competition", "url": "https://www.theguardian.com/sport/2026/feb/25/zimbabwe-breakout-cricket-world-cup-supporters-rejoicing-renaissance", "image": "https://media.guim.co.uk/57170b6bfd404a0e029eb92825e336f3452038e3/183_0_1827_1462/500.jpg", "publishedAt": "2026-02-25T10:05:15Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "Live Talk: The Connection", "description": "Livetalk is a 30-minute call-in TV (simulcast) talk show engaging Zimbabweans in-country and in the diaspora to air their views on developments taking place in Zimbabwe and elsewhere. The program aims to enlighten citizens on critical issues by engaging experts, non-state actors, politicians and government officials. Join us Monday to Friday 1800-1830UTC, 2000-2030pm Zimbabwe time.", "url": "https://www.voazimbabwe.com/a/8117157.html", "image": "https://gdb.voanews.com/4a8ce12a-a06b-45be-9ed8-4cbf1b17dd17_tv_w800_h450.jpg", "publishedAt": "2026-02-24 18:33:45", "source": "Voa Zimbabwe", "_source_api": "Newsdata.io"}, {"title": "South African army men recover two vehicles being smuggled in flooded Limpopo River into Zimbabwe", "description": "Thupeyo Muleya South African National Defence Force members deployed to patrol the border with Zimbabwe have recovered a Toyota Land Cruiser worth around R1,5 million that was being smuggled out...The post South African army men recover two vehicles being smuggled in flooded Limpopo River into Zimbabwe appeared first on herald.", "url": "https://www.heraldonline.co.zw/south-african-army-men-recover-two-vehicles-being-smuggled-in-flooded-limpopo-river-into-zimbabwe/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/sites/2/2020/08/South-African-Flag.jpg", "publishedAt": "2026-02-24 15:42:36", "source": "The Herald", "_source_api": "Newsdata.io"}], "more": [{"title": "How the Skeleton of Mutapa Times is Based on Sarah Charlesworth's Work", "description": "Conceptual artist Sarah Charlesworth's 1979 study of how newspapers covered a solar eclipse inspired the framework behind The Mutapa Times.", "url": "article.html?slug=2020-04-20-how-the-skeleton-of-mutapa-times-is-based-on-sarah-charlesworths-work", "image": "/img/uploads/imageedit_1_5381951801.jpg", "publishedAt": "2020-04-20T00:00:00.000Z", "source": "The Mutapa Times", "cms": true}, {"title": "RBZ presents 2026 monetary policy statement this Friday", "description": "Source: RBZ presents 2026 monetary policy statement this Friday – herald Business Reporter Business leaders and financial markets have their gaze fixed on the Reserve Bank of Zimbabwe’s 2026 Monetary Policy Statement presentation scheduled for Friday, with expectations centred on", "url": "article.html?slug=2026-02-23-rbz-presents-2026-monetary-policy-statement-this-friday", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/RBZ.jpg", "publishedAt": "2026-02-23T23:28:00", "source": "The Mutapa Times", "cms": true}, {"title": "Robert Mugabe’s son charged with attempted murder over Johannesburg shooting", "description": "Bellarmine Chatunga Mugabe, known for lavish lifestyle, also accused of theft and being illegal immigrant after man allegedly shot in back", "url": "article.html?slug=2026-02-23-robert-mugabes-son-charged-with-attempted-murder-over-johann", "image": "https://media.guim.co.uk/a777e1c818970c0301f21b6c3d44c79e5163732c/99_0_3832_3066/500.jpg", "publishedAt": "2026-02-23T13:48:00", "source": "The Mutapa Times", "cms": true}, {"title": "What happens if the next term is extended to 20 years – asks Coltart, as headstrong Zanu PF trudges on with Constitutional amendments", "description": "WITH Zanu PF leaders and government adamant that President Emmerson Mnangagwa’s second five-year-term must be extended by two more years, Bulawayo mayor David Coltart has asked how Zimbabweans would react if government was to add another 20-year-term in 2030.The post What happens if the next term is extended to 20 years – asks Coltart, as headstrong Zanu PF trudges on with Constitutional amendments appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/what-happens-if-the-next-term-is-extended-to-20-years-asks-coltart-as-head-strong-zanu-pf-trudges-on-with-constitutional-amendments/", "image": "", "publishedAt": "2026-02-25 00:05:18", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Not a fluke says ZANU PF legislator as Parliament hails Chevrons performance at T20 World Cup", "description": "Parliament has hailed the exploits of the Zimbabwe senior men’s cricket team at the ongoing T20 World Cup, being hosted by Sri Lanka and India. Zimbabwe has earned global admiration after putting in strong performances to qualify unbeaten for the Super 8 stage. On their way to the Super 8s, the Chevrons beat Australia, Oman, [...]The post Not a fluke says ZANU PF legislator as Parliament hails Chevrons performance at T20 World Cup appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/not-a-fluke-says-zanu-pf-legislator-as-parliament-hails-chevrons-performance-at-t20-world-cup/", "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2026/02/23191529/fb_img_1771873552524-e1771902448276.jpg", "publishedAt": "2026-02-25 00:03:41", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "South African musician Naledi Aphiwe apologises after Xenophobic remark against Zimbabweans resurfaces", "description": "Not willing to risk facing the wrath of Zimbabweans when she comes to perform in the country in April, South African musician Naledi Aphiwe has apologised over a xenophobic remark she made online a few years ago. Naledi Aphiwe’s announcement as part of the line-up to perform at the Ama2k festival, to be held in [...]The post South African musician Naledi Aphiwe apologises after Xenophobic remark against Zimbabweans resurfaces appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/south-african-musician-naledi-aphiwe-apologises-after-xenophobic-remark-against-zimbabweans-resurfaces/", "image": "", "publishedAt": "2026-02-25 00:00:32", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "ZIMRA wins Supreme Court appeal against Pacific Cigarette Company", "description": "The Zimbabwe Revenue Authority (ZIMRA) has won a major Supreme Court appeal against Pacific Cigarette Company (Private) Limited after the court ruled that the company was not entitled to a tax clearance certificate (TCC) while owing more than US$19.5 million in taxes and operating under corporate rescue. In a unanimous judgment delivered in Harare on [...]The post ZIMRA wins Supreme Court appeal against Pacific Cigarette Company appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/zimra-wins-supreme-court-appeal-against-pacific-cigarette-company/", "image": "", "publishedAt": "2026-02-25 00:00:20", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "‘Harmonised borders vital for regional trade’", "description": "ADOPTING coordinated inspections and digital systems is critical to eliminating bottlenecks between Zimbabwe, Zambia, and South Africa, the government has said.Officially opening... To access this content, please purchase a subscription by clicking the button below and select a package of your choice!Subscriptions", "url": "https://dailynews.co.zw/harmonised-borders-vital-for-regional-trade/", "image": "", "publishedAt": "2026-02-24 23:58:00", "source": "Dailynews", "_source_api": "Newsdata.io"}, {"title": "CFAO Mobility hands Sables logistics boost", "description": "THE Zimbabwe Sables have scored a major off‐field victory, sealing a partnership with CFAO Mobility that will cover the team’s transport needs... To access this content, please purchase a subscription by clicking the button below and select a package of your choice!Subscriptions", "url": "https://dailynews.co.zw/cfao-mobility-hands-sables-logistics-boost/", "image": "", "publishedAt": "2026-02-24 23:57:00", "source": "Dailynews", "_source_api": "Newsdata.io"}, {"title": "500MW solar plant on cards", "description": "THE Zimbabwe Energy Regulatory Authority (Zera) has received an application from Kwayedza Energy Networks Corporation (Pvt) Ltd to build a 500MW solar... To access this content, please purchase a subscription by clicking the button below and select a package of your choice!Subscriptions", "url": "https://dailynews.co.zw/500mw-solar-plant-on-cards/", "image": "", "publishedAt": "2026-02-24 23:54:00", "source": "Dailynews", "_source_api": "Newsdata.io"}, {"title": "Late diagnosis hinders childhood cancer fight", "description": "LATE diagnosis of childhood cancer remains one of the most critical challenges facing Zimbabwe’s paediatric health sector, KidzCan Zimbabwe has said.The remarks... To access this content, please purchase a subscription by clicking the button below and select a package of your choice!Subscriptions", "url": "https://dailynews.co.zw/late-diagnosis-hinders-childhood-cancer-fight/", "image": "", "publishedAt": "2026-02-24 23:50:00", "source": "Dailynews", "_source_api": "Newsdata.io"}, {"title": "Innovation as Strategy: How Zimbabwe’s Top Performers Grow Within and Beyond the Core", "description": "IN Zimbabwe’s business environment, growth rarely follows a predictable script. Currency instability, shifting consumer spending patterns, liquidity constraints, and regulatory adjustments have made traditional expansion models increasingly fragile. Yet despite these pressures, certain organisations continue to expand, defend margins, and reshape their markets. Their advantage is not simply scale or legacy. It is innovation. By [...]The post Innovation as Strategy: How Zimbabwe’s Top Performers Grow Within and Beyond the Core appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/innovation-as-strategy-how-zimbabwes-top-performers-grow-within-and-beyond-the-core/", "image": "https://thezimbabwemail.com/wp-content/uploads/2025/11/Cassava-Technologies.jpg", "publishedAt": "2026-02-24 22:31:40", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "US winds down health programmes after Mnangagwa rejects $367m deal", "description": "‘We wish them well’ - Ambassador TremontThe post US winds down health programmes after Mnangagwa rejects $367m deal appeared first on Zimbabwe News Now.", "url": "https://www.zimlive.com/us-winds-down-health-programmes-after-mnangagwa-rejects-367m-deal/", "image": "", "publishedAt": "2026-02-24 21:14:33", "source": "Zimbabwean News", "_source_api": "Newsdata.io"}, {"title": "Zim prospect signs first pro-contract with EPL giants Arsenal", "description": "Zim prospect signs first pro-contract with EPL giants Arsenal. The post Zim prospect signs first pro-contract with EPL giants Arsenal appeared first on Soccer24.", "url": "https://www.soccer24.co.zw/2026/02/24/zim-prospect-signs-first-pro-contract-with-epl-giants-arsenal/", "image": "https://www.soccer24.co.zw/wp-content/uploads/2026/02/teshaun-murisa-image_mfejzo0t.webp", "publishedAt": "2026-02-24 21:12:48", "source": "Soccer24", "_source_api": "Newsdata.io"}, {"title": "USA regrets Zimbabwe’s decision to withdraw from health MOU talks", "description": "The United States says it regrets the Government of Zimbabwe’s decision to withdraw from negotiations on a proposed bilateral health Memorandum of Understanding (MOU), which would have channelled US$3...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262391.html", "image": "https://img.bulawayo24.com/articles/bulawayo24.png", "publishedAt": "2026-02-24 20:55:18", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "Treasury rejects plan to take over CAAZ legacy debts", "description": "The Ministry of Finance has rejected a proposal by Parliament to assume legacy debts owed by the Civil Aviation Authority of Zimbabwe (CAAZ), arguing that the aviation regulator has adequate revenue s...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262389.html", "image": "https://img.bulawayo24.com/articles/bulawayo24.png", "publishedAt": "2026-02-24 20:01:58", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "Mucheke bridge 93% complete, fails compaction test", "description": "The new Mucheke (Chevron) Bridge in Masvingo has reached 93 percent completion, but authorities say its official opening remains uncertain due to funding delays and failed compaction tests that requir...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262388.html", "image": "https://img.bulawayo24.com/articles/bulawayo24.png", "publishedAt": "2026-02-24 20:01:11", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "There is more than one way to skin a cat", "description": "In this constitution, terms of office are five years and coterminous with the life of Parliament. The Bill elongates the electoral cycle from five to seven years.That's all it's doing, to elongat...", "url": "https://bulawayo24.com/index-id-opinion-sc-columnist-byo-262387.html", "image": "https://img.bulawayo24.com/articles/Chinamasa_2023_election.jpeg", "publishedAt": "2026-02-24 20:00:16", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}]}