{"articles": [{"title": "Zimbabwean breakout at T20 World Cup has fans rejoicing renaissance", "description": "Swelling fanbase has been in dreamland this past month as Zimbabwe have defied all expectations in the competition", "url": "https://www.theguardian.com/sport/2026/feb/25/zimbabwe-breakout-cricket-world-cup-supporters-rejoicing-renaissance", "image": "https://media.guim.co.uk/57170b6bfd404a0e029eb92825e336f3452038e3/183_0_1827_1462/500.jpg", "publishedAt": "2026-02-25T10:05:15Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "South African army men recover two vehicles being smuggled in flooded Limpopo River into Zimbabwe", "description": "Thupeyo Muleya South African National Defence Force members deployed to patrol the border with Zimbabwe have recovered a Toyota Land Cruiser worth around R1,5 million that was being smuggled out...The post South African army men recover two vehicles being smuggled in flooded Limpopo River into Zimbabwe appeared first on herald.", "url": "https://www.heraldonline.co.zw/south-african-army-men-recover-two-vehicles-being-smuggled-in-flooded-limpopo-river-into-zimbabwe/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/sites/2/2020/08/South-African-Flag.jpg", "publishedAt": "2026-02-24 15:42:36", "source": "The Herald", "_source_api": "Newsdata.io"}, {"title": "Report responsibly on children issues: ZMC", "description": "Moffat Mungazi Post Reporter MEDIA coverage on issues involving children must always uphold professional and ethical standards so as to protect the minors’ safety and wellbeing, the Zimbabwe Media Commission...The post Report responsibly on children issues: ZMC appeared first on herald.", "url": "https://www.heraldonline.co.zw/report-responsibly-on-children-issues-zmc/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/02/Media-coverage.jpg", "publishedAt": "2026-02-24 09:23:34", "source": "The Herald", "_source_api": "Newsdata.io"}], "more": [{"title": "How the Skeleton of Mutapa Times is Based on Sarah Charlesworth's Work", "description": "Conceptual artist Sarah Charlesworth's 1979 study of how newspapers covered a solar eclipse inspired the framework behind The Mutapa Times.", "url": "article.html?slug=2020-04-20-how-the-skeleton-of-mutapa-times-is-based-on-sarah-charlesworths-work", "image": "/img/uploads/imageedit_1_5381951801.jpg", "publishedAt": "2020-04-20T00:00:00.000Z", "source": "The Mutapa Times", "cms": true}, {"title": "RBZ presents 2026 monetary policy statement this Friday", "description": "Source: RBZ presents 2026 monetary policy statement this Friday – herald Business Reporter Business leaders and financial markets have their gaze fixed on the Reserve Bank of Zimbabwe’s 2026 Monetary Policy Statement presentation scheduled for Friday, with expectations centred on", "url": "article.html?slug=2026-02-23-rbz-presents-2026-monetary-policy-statement-this-friday", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/RBZ.jpg", "publishedAt": "2026-02-23T23:28:00", "source": "The Mutapa Times", "cms": true}, {"title": "Robert Mugabe’s son charged with attempted murder over Johannesburg shooting", "description": "Bellarmine Chatunga Mugabe, known for lavish lifestyle, also accused of theft and being illegal immigrant after man allegedly shot in back", "url": "article.html?slug=2026-02-23-robert-mugabes-son-charged-with-attempted-murder-over-johann", "image": "https://media.guim.co.uk/a777e1c818970c0301f21b6c3d44c79e5163732c/99_0_3832_3066/500.jpg", "publishedAt": "2026-02-23T13:48:00", "source": "The Mutapa Times", "cms": true}, {"title": "Zimbabwe Sables Receive Vehicle Sponsorship Ahead of Australia 2027 World Cup", "description": "Zimbabwe Sables Receive Vehicle Sponsorship Ahead of Australia 2027 World Cup The Zimbabwe Rugby Union has sealed a strategic partnership with CFAO Mobility Zimbabwe, which will provide crucial transport support to the senior national team. This comes as the Sables intensify their preparations for the 2027 World Cup campaign. The sponsorship package, unveiled yesterday, includes [...]The post Zimbabwe Sables Receive Vehicle Sponsorship Ahead of Australia 2027 World Cup appeared first on iHarare News.", "url": "https://iharare.com/zimbabwe-sables-receive-vehicle-sponsorship-ahead-of-australia-2027-world-cup/", "image": "", "publishedAt": "2026-02-25 09:23:34", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe Suspends Raw Mineral Exports", "description": "Government has suspended the export of all raw minerals and lithium concentrates with immediate effect, in a move the government says is aimed at protecting national interests and boosting value addition. Addressing journalists in Harare, Mines and Mining Development Minister, Polite Kambamura said the ban [...]The post Zimbabwe Suspends Raw Mineral Exports appeared first on 263Chat.", "url": "https://www.263chat.com/zimbabwe-suspends-raw-mineral-exports/", "image": "https://www.263chat.com/wp-content/uploads/2024/11/WhatsApp-Image-2024-11-19-at-4.37.06-PM.jpeg", "publishedAt": "2026-02-25 09:00:34", "source": "263chat", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe suspends all raw mineral and lithium concentrate exports", "description": "Kambanura made the announcement and said it is with immediate effect.The post Zimbabwe suspends all raw mineral and lithium concentrate exports first appeared on Three Men On a Boat.", "url": "https://3-mob.com/news/zimbabwe-suspends-all-raw-mineral-and-lithium-concentrate-exports/", "image": "https://3-mob.com/wp-content/uploads/2026/02/pexels-photo-383559.jpeg", "publishedAt": "2026-02-25 08:52:25", "source": "Three Men On Boat", "_source_api": "Newsdata.io"}, {"title": "Zimbabwean Lawyer Expelled From Kenya For Allegedly Bankrolling Anti-Government Protests", "description": "Zimbabwean Lawyer Expelled From Kenya For Allegedly Funding Anti-Government Protests Zimbabwean constitutional lawyer Brian Bright Kagoro has been dramatically expelled from Kenya after security chiefs accused him of bankrolling a shadowy plot to reignite anti-government protests. The 51-year-old legal eagle was pounced upon by immigration officers at Jomo Kenyatta International Airport on Sunday evening, February [...]The post Zimbabwean Lawyer Expelled From Kenya For Allegedly Bankrolling Anti-Government Protests appeared first on iHarare News.", "url": "https://iharare.com/zimbabwean-lawyer-expelled-from-kenya-for-allegedly-funding-anti-government-protests/", "image": "", "publishedAt": "2026-02-25 08:48:19", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Kenya expels Zimbabwean lawyer over alleged role in protest mobilisation", "description": "The Eastleigh Voice Kenya has deported Zimbabwean constitutional lawyer Brian Bright Kagoro after security agencies accused him of involvement in a foreign-supported network allegedly seeking to stir anti-government protests. Kagoro, 51, was stopped by immigration officers at Jomo Kenyatta International Airport on Sunday evening and declared persona non grata before being put on a return flight. [...]The post Kenya expels Zimbabwean lawyer over alleged role in protest mobilisation appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/kenya-expels-zimbabwean-lawyer-over-alleged-role-in-protest-mobilisation/", "image": "", "publishedAt": "2026-02-25 08:44:17", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Zimbabwean lawyer, rights activist Brian Kagoro is expelled from Kenya", "description": "He is accused of coordinating efforts to mobilise political dissent in KenyaThe post Zimbabwean lawyer, rights activist Brian Kagoro is expelled from Kenya appeared first on Zimbabwe News Now.", "url": "https://www.zimlive.com/zimbabwean-lawyer-rights-activist-brian-kagoro-is-expelled-from-kenya/", "image": "", "publishedAt": "2026-02-25 08:35:13", "source": "Zimbabwean News", "_source_api": "Newsdata.io"}, {"title": "80 people including 77 children packed in 2 kombis... as hwindi ‘samples’ Grade 5 girl’s privates in mushikashika boot for US$1", "description": "HARARE – A disturbing pattern of negligence and exploitation has cast a long shadow over Zimbabwe’s public transport system, particularly affecting the nation’s most vulnerable citizens: its schoolchildren. Recent incidents, ranging from dangerously overloaded commuter omnibuses to horrific acts of sexual assault within informal transport vehicles, paint a grim picture of a system teetering on [...]The post 80 people including 77 children packed in 2 kombis... as hwindi ‘samples’ Grade 5 girl’s privates in mushikashika boot for US$1 first appeared on My Zimbabwe News.", "url": "https://www.myzimbabwe.co.zw/news/186000-80-people-including-77-children-packed-in-2-kombis-as-hwindi-samples-grade-5-girls-privates-in-mushikashika-boot-for-us1.html", "image": "https://www.myzimbabwe.co.zw/wp-content/uploads/2026/02/kombi-80-passengers.jpg", "publishedAt": "2026-02-25 08:28:38", "source": "My Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "US to Wind Down $367m Health Support After Zim Pulls Out of Deal", "description": "The United States says it will begin winding down its health assistance to Zimbabwe after the government withdrew from negotiations on a proposed $367 million bilateral health agreement. In a statement released by the Embassy of the United States of America in Zimbabwe, Washington expressed [...]The post US to Wind Down $367m Health Support After Zim Pulls Out of Deal appeared first on 263Chat.", "url": "https://www.263chat.com/us-to-wind-down-367m-health-support-after-zimbabwe-pulls-out-of-deal/", "image": "https://www.263chat.com/wp-content/uploads/2026/02/image-46.png", "publishedAt": "2026-02-25 08:02:40", "source": "263chat", "_source_api": "Newsdata.io"}, {"title": "ZACC Officials in Court Over Alleged Extortion at Border Post", "description": "By Kudzaishe Chimonera Two officials employed by the Zimbabwe Anti-Corruption Commission (ZACC) have appeared before the Plumtree Magistrates’ Court facing charges of criminal abuse of duty as public officers and unlawful detention. In a statement, National Prosecuting Authority of Zimbabwe (NPAZ) said Brian Munyaradzi Kombora [...]The post ZACC Officials in Court Over Alleged Extortion at Border Post appeared first on 263Chat.", "url": "https://www.263chat.com/zacc-officials-in-court-over-alleged-extortion-at-border-post/", "image": "https://www.263chat.com/wp-content/uploads/2020/09/pastor-head-arrested.jpg", "publishedAt": "2026-02-25 07:54:55", "source": "263chat", "_source_api": "Newsdata.io"}, {"title": "InDrive Driver Accuses Thigh Vendor of Stealing His Car Keys and Money", "description": "InDrive Driver Accuses Thigh Vendor of Stealing His Car Keys and Money After Offering Her Shelter An early morning encounter in Harare’s central business district ended in drama after an InDrive driver allegedly lost his car keys and cash following a dispute with a thigh vendor he had allowed into his vehicle. The incident occurred [...]The post InDrive Driver Accuses Thigh Vendor of Stealing His Car Keys and Money appeared first on iHarare News.", "url": "https://iharare.com/indrive-driver-accuses-thigh-vendor-of-stealing-his-car-keys-and-money-after-offering-her-shelter/", "image": "", "publishedAt": "2026-02-25 07:26:34", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Financial Advisor Gambles Away R2.6M In 7 Days After Taking Advantage Of Bank Error, Entire Estate Seized", "description": "Financial Advisor Gambles Away R2.6 Million After Bank Error In Just 7 Days A Cape Town financial advisor blew more than R2.6 million in one week after discovering a bank glitch that allowed him spend money he didn’t have. Now the court has seized everything he owns. Izak Petrus Van Zyl exploited an Investec error [...]The post Financial Advisor Gambles Away R2.6M In 7 Days After Taking Advantage Of Bank Error, Entire Estate Seized appeared first on iHarare News.", "url": "https://iharare.com/financial-advisor-gambles-away-r2-6m-in-7-days-after-taking-advantage-of-bank-error/", "image": "", "publishedAt": "2026-02-25 06:57:16", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "‘Chatunga must go to jail’: MMA fighter Themba Gorimbo calls for Mugabe’s son arrest", "description": "Themba Gorimbo’s bold call for Chatunga Mugabe’s arrest reignites conversations about corruption, rule of law, victims’ rights and leadership accountability.The post ‘Chatunga must go to jail’: MMA fighter Themba Gorimbo calls for Mugabe’s son arrest appeared first on iHarare News.", "url": "https://iharare.com/chatunga-must-go-to-jail-mma-fighter-themba-gorimbo-calls-for-mugabes-son-arrest/", "image": "", "publishedAt": "2026-02-25 06:37:40", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Zimbabwean youngster Murisa signs first Arsenal professional contract", "description": "The 17-year-old has been with the current league leaders since he was six.The post Zimbabwean youngster Murisa signs first Arsenal professional contract first appeared on Three Men On a Boat.", "url": "https://3-mob.com/sport/zimbabwean-youngster-murisa-signs-first-arsenal-professional-contract/", "image": "https://3-mob.com/wp-content/uploads/2026/02/Teshaun-Murisa-PIC-Aarsenal.webp", "publishedAt": "2026-02-25 06:33:22", "source": "Three Men On Boat", "_source_api": "Newsdata.io"}, {"title": "Missing car keys and US$100 demand: Chaos in Harare CBD as inDrive driver clashes with prostitute at 4am", "description": "HARARE – Under the flickering orange glow of the streetlights on Nelson Mandela Avenue, the air is often thick with the scent of cheap perfume and exhaust fumes. It is 4:00 am, the hour when the capital city’s night owls and early birds collide in a desperate dance for survival. For one inDrive driver, this [...]The post Missing car keys and US$100 demand: Chaos in Harare CBD as inDrive driver clashes with prostitute at 4am first appeared on My Zimbabwe News.", "url": "https://www.myzimbabwe.co.zw/news/185997-missing-car-keys-and-us100-demand-chaos-in-harare-cbd-as-indrive-driver-clashes-with-prostitute-at-4am.html", "image": "https://www.myzimbabwe.co.zw/wp-content/uploads/2026/02/indrive-driver-and-miriam-mahove-the-prostitute.jpg", "publishedAt": "2026-02-25 06:33:18", "source": "My Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "US Embassy Confirms It’s Shutting Down Lifesaving HIV, TB, And Malaria Programs After Zimbabwe Rejects US$367M Deal", "description": "The United States Embassy has confirmed it is pulling the plug on lifesaving health programs in Zimbabwe, including HIV/AIDS treatment, tuberculosis control, and malaria prevention, after President Emmerson Mnangagwa rejected a massive US$367 million (approximately R6.8 billion) funding deal over sovereignty concerns. The devastating decision puts 1.2 million Zimbabweans currently receiving antiretroviral drugs through US-supported [...]The post US Embassy Confirms It’s Shutting Down Lifesaving HIV, TB, And Malaria Programs After Zimbabwe Rejects US$367M Deal appeared first on iHarare News.", "url": "https://iharare.com/us-embassy-confirms-shutdown-of-lifesaving-hiv-tb-and-malaria-programs-in-zimbabwe/", "image": "", "publishedAt": "2026-02-25 06:04:48", "source": "Iharare News", "_source_api": "Newsdata.io"}]}