{"articles": [{"title": "Zimbabwean breakout at T20 World Cup has fans rejoicing renaissance", "description": "Swelling fanbase has been in dreamland this past month as Zimbabwe have defied all expectations in the competition", "url": "https://www.theguardian.com/sport/2026/feb/25/zimbabwe-breakout-cricket-world-cup-supporters-rejoicing-renaissance", "image": "https://media.guim.co.uk/57170b6bfd404a0e029eb92825e336f3452038e3/183_0_1827_1462/500.jpg", "publishedAt": "2026-02-25T10:05:15Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "Zimbabwe rejects 'lopsided' US health aid deal over data concerns", "description": "Access to biological samples raised flags for Zimbabwe as the US did not want to share the benefits of its research.", "url": "https://www.bbc.com/news/articles/cwy6nd3664no", "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6ada/live/d161dbc0-1249-11f1-b048-c9424b2cf5fd.jpg", "publishedAt": "2026-02-25 13:39:40", "source": "The Bbc", "_source_api": "Newsdata.io"}, {"title": "South African army men recover two vehicles being smuggled in flooded Limpopo River into Zimbabwe", "description": "Thupeyo Muleya South African National Defence Force members deployed to patrol the border with Zimbabwe have recovered a Toyota Land Cruiser worth around R1,5 million that was being smuggled out...The post South African army men recover two vehicles being smuggled in flooded Limpopo River into Zimbabwe appeared first on herald.", "url": "https://www.heraldonline.co.zw/south-african-army-men-recover-two-vehicles-being-smuggled-in-flooded-limpopo-river-into-zimbabwe/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/sites/2/2020/08/South-African-Flag.jpg", "publishedAt": "2026-02-24 15:42:36", "source": "The Herald", "_source_api": "Newsdata.io"}], "more": [{"title": "How the Skeleton of Mutapa Times is Based on Sarah Charlesworth's Work", "description": "Conceptual artist Sarah Charlesworth's 1979 study of how newspapers covered a solar eclipse inspired the framework behind The Mutapa Times.", "url": "article.html?slug=2020-04-20-how-the-skeleton-of-mutapa-times-is-based-on-sarah-charlesworths-work", "image": "/img/uploads/imageedit_1_5381951801.jpg", "publishedAt": "2020-04-20T00:00:00.000Z", "source": "The Mutapa Times", "cms": true}, {"title": "Robert Mugabe’s son charged with attempted murder over Johannesburg shooting", "description": "Bellarmine Chatunga Mugabe, known for lavish lifestyle, also accused of theft and being illegal immigrant after man allegedly shot in back", "url": "article.html?slug=2026-02-23-robert-mugabes-son-charged-with-attempted-murder-over-johann", "image": "https://media.guim.co.uk/a777e1c818970c0301f21b6c3d44c79e5163732c/99_0_3832_3066/500.jpg", "publishedAt": "2026-02-23T13:48:00", "source": "The Mutapa Times", "cms": true}, {"title": "If Zimbabwe feels cheated by the US in health deal then why are we beggars and not funding our own programs?", "description": "Beggars are not choosers, it is said.", "url": "https://www.thezimbabwean.co/2026/02/if-zimbabwe-feels-cheated-by-the-us-in-health-deal-then-why-are-we-beggars-and-not-funding-our-own-programs/", "image": "https://www.thezimbabwean.co/wp-content/uploads/2026/02/file_000000008604722f8990ffbee81b35d8.png", "publishedAt": "2026-02-26 16:29:12", "source": "The Zimbabwean", "_source_api": "Newsdata.io"}, {"title": "US describes Zimbabwe aid cut as “regrettable” after US$367m deal collapse", "description": "HARARE – The United States (US) has announced plans to wind down its health assistance to Zimbabwe following the government’s decision to withdraw from negotiations on a proposed US$367 million health cooperation agreement, in a move Washington described as “difficult and regrettable. In a statement released by the US Embassy in Harare on Tuesday, Pamela [...]The post US describes Zimbabwe aid cut as “regrettable” after US$367m deal collapse appeared first on Nehanda Radio.", "url": "https://nehandaradio.com/2026/02/26/us-describes-zimbabwe-aid-cut-as-regrettable-after-us367m-deal-collapse/", "image": "https://nehandaradio.com/wp-content/uploads/2025/06/Pamela-Tremont.webp", "publishedAt": "2026-02-26 16:28:42", "source": "Nehanda Radio", "_source_api": "Newsdata.io"}, {"title": "Retail giant OK Zimbabwe runs out of money and placed under corporate rescue", "description": "HARARE – OK Zimbabwe Limited has entered corporate rescue after its US$30.5 million recapitalisation plan failed to close a critical funding gap, leaving the country’s largest listed supermarket group struggling under mounting supplier debt, declining revenues and worsening liquidity constraints. The move follows stalled property disposals meant to raise US$10.5 million and growing pressure from [...]The post Retail giant OK Zimbabwe runs out of money and placed under corporate rescue appeared first on Nehanda Radio.", "url": "https://nehandaradio.com/2026/02/26/retail-giant-ok-zimbabwe-runs-out-of-money-and-placed-under-corporate-rescue/", "image": "https://nehandaradio.com/wp-content/uploads/2025/10/OK-Zimbabwe.webp", "publishedAt": "2026-02-26 16:13:22", "source": "Nehanda Radio", "_source_api": "Newsdata.io"}, {"title": "OK Zimbabwe enters corporate rescue as suppliers withdraw support", "description": "Board appoints corporate rescue practitioner in last-ditch effort to save retail giantThe post OK Zimbabwe enters corporate rescue as suppliers withdraw support appeared first on Zimbabwe News Now.", "url": "https://www.zimlive.com/ok-zimbabwe-enters-corporate-rescue-as-suppliers-withdraw-support/", "image": "", "publishedAt": "2026-02-26 16:10:39", "source": "Zimbabwean News", "_source_api": "Newsdata.io"}, {"title": "Chippa United Snatch Warriors Defender", "description": "Sports Correspondent – South African side Chippa United have completed the signing of Zimbabwe international Isheanesu Mauchi, bolstering their defensive ... Continue reading \"Chippa United Snatch Warriors Defender\"", "url": "https://www.zimeye.net/2026/02/26/chippa-united-snatch-warriors-defender/", "image": "https://www.zimeye.net/wp-content/uploads/2020/12/Young-Warriors-3-scaled-1.jpg", "publishedAt": "2026-02-26 16:00:00", "source": "Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Chatunga Mugabe faces 15-year prison sentence in South Africa, BUT Grace Mugabe wants him back home for good", "description": "JOHANNESBURG — The youngest son of the late Zimbabwean strongman Robert Mugabe, Bellarmine Chatunga Mugabe, is currently languishing in a South African prison cell, facing a legal storm that could see him behind bars for up to 15 years. The 29-year-old, known more for his flamboyant lifestyle and champagne-drenched social media posts than for any [...]The post Chatunga Mugabe faces 15-year prison sentence in South Africa, BUT Grace Mugabe wants him back home for good first appeared on My Zimbabwe News.", "url": "https://www.myzimbabwe.co.zw/news/186031-chatunga-mugabe-faces-15-year-prison-sentence-in-south-africa-but-grace-mugabe-wants-him-back-home-for-good.html", "image": "https://www.myzimbabwe.co.zw/wp-content/uploads/2026/02/grace-mugabe-worred-chatunga-arrested.jpg", "publishedAt": "2026-02-26 15:36:08", "source": "My Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Liquid Resets Finances After Debt Repayment, Secures US$410m Fresh Funding", "description": "JOHANNESBURG – Liquid Intelligent Technologies has completed a significant refinancing exercise, repaying key debt facilities while lining up new funding to support expansion across Africa’s fast-evolving digital infrastructure landscape. The company, a subsidiary of Cassava Technologies, confirmed the full repayment of its South African rand term loan and US dollar revolving credit facility, a move [...]The post Liquid Resets Finances After Debt Repayment, Secures US$410m Fresh Funding appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/liquid-resets-finances-after-debt-repayment-secures-us410m-fresh-funding/", "image": "https://thezimbabwemail.com/wp-content/uploads/2025/12/Liquid-Telecoms-990x646.png", "publishedAt": "2026-02-26 14:32:35", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "Watch: Passion Java Claims Zim Dollar Shall Be At Par With US Dollar In 2040", "description": "Tinashe Sambiri – Controversial preacher Passion Java has once again made headlines, this time endorsing an extension of President Emmerson ... Continue reading \"Watch: Passion Java Claims Zim Dollar Shall Be At Par With US Dollar In 2040\"", "url": "https://www.zimeye.net/2026/02/26/watch-passion-java-claims-zim-dollar-shall-be-at-par-with-us-dollar-in-2040/", "image": "https://www.zimeye.net/wp-content/uploads/2026/02/IMG_20260225_062534.jpg", "publishedAt": "2026-02-26 14:30:00", "source": "Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Zambia pushed back on U.S. health funding deal to protect interests, government says", "description": "Reuters Zambia has pushed back on part of a deal worth more than $1 billion in global health aid from the United States because it does not align with the country’s interests, the government said on Wednesday, as health advocates warned the deal links the money to mining access and has data-sharing risks. The deal [...]The post Zambia pushed back on U.S. health funding deal to protect interests, government says appeared first on NewZimbabwe.com.", "url": "https://www.newzimbabwe.com/zambia-pushed-back-on-u-s-health-funding-deal-to-protect-interests-government-says/", "image": "", "publishedAt": "2026-02-26 13:13:50", "source": "The Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Scott Sakupwanya Backs Black Rhinos FC with US$460 000 Sponsorship Package and Luxury Team Bus", "description": "Scott Sakupwanya Backs Black Rhinos FC with US$460 000 Sponsorship Package and Luxury Team Bus Businessman and legislator Pedzai Sakupwanya has bankrolled Black Rhinos F.C. with a US$460 000 sponsorship package ahead of the 2026 Division One season. The sponsorship deal was channelled through his company, Betterbrands Gold. Also Read: Scott Sakupwanya Donates US$100,000 to Simba [...]The post Scott Sakupwanya Backs Black Rhinos FC with US$460 000 Sponsorship Package and Luxury Team Bus appeared first on iHarare News.", "url": "https://iharare.com/scott-sakupwanya-backs-black-rhinos-fc-with-us460-000-sponsorship-package-and-luxury-team-bus/", "image": "https://iharare.com/wp-content/uploads/2026/02/MixCollage-26-Feb-2026-02-40-PM-4337.jpg", "publishedAt": "2026-02-26 12:56:12", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Simplifying The Proposed Zimbabwe Constitutional Amendment Bill No. 3: A Simple Guide For Ordinary Zimbabweans", "description": "Following the Cabinet’s approval of the draft Constitution of Zimbabwe Amendment (No. 3) Bill earlier this February, a whirlwind of legislative activity and public debate has swept across the nation and social media platforms. The formal gazetting of the Bill on February 16, 2026, officially triggered a 90-day window for public scrutiny, yet the weeks [...]The post Simplifying The Proposed Zimbabwe Constitutional Amendment Bill No. 3: A Simple Guide For Ordinary Zimbabweans appeared first on iHarare News.", "url": "https://iharare.com/simplifying-zimbabwe-constitutional-amendment-bill-no-3/", "image": "", "publishedAt": "2026-02-26 12:52:53", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Global lithium price goes up as Zimbabwe BANS exports: Why the world has SUDDENLY PANICKED over Zimbabwe’s raw mineral ban", "description": "HARARE – In a move that has reverberated across international markets, Zimbabwe has imposed an immediate and indefinite ban on the export of all raw minerals and lithium concentrates. Announced on Wednesday, 25 February 2026, by Minister of Mines and Mining Development Polite Kambamura, this decisive action includes all minerals already in transit, effectively halting [...]The post Global lithium price goes up as Zimbabwe BANS exports: Why the world has SUDDENLY PANICKED over Zimbabwe’s raw mineral ban first appeared on My Zimbabwe News.", "url": "https://www.myzimbabwe.co.zw/blog/186027-global-lithium-price-goes-up-as-zimbabwe-bans-exports-why-the-world-has-suddenly-panicked-over-zimbabwes-raw-mineral-ban.html", "image": "https://www.myzimbabwe.co.zw/wp-content/uploads/2026/02/zimbabwe-mining-minerals-data.jpg", "publishedAt": "2026-02-26 12:49:09", "source": "My Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Stewart Murisa distances himself from Arsenal's Teashaun", "description": "Former Castle Soccer Star of the Year Stewart Murisa has clarified that he is not related to highly rated London-based teenager Teashaun Murisa, who has signed his first professional contract with Eng...", "url": "https://bulawayo24.com/index-id-news-sc-national-byo-262448.html", "image": "https://img.bulawayo24.com/articles/bulawayo24.png", "publishedAt": "2026-02-26 12:43:15", "source": "Bulawayo24 News", "_source_api": "Newsdata.io"}, {"title": "SHOCKING DNA details: What USA wanted from Zimbabweans and why Mnangagwa refused a US$367 million dangerous deal", "description": "The $367 Million US Health Deal Collapse: What Data Did Washington Really Want From Our DNA? Zimbabwe has made a stunning move by walking away from a US$367 million health funding deal with the United States, citing “sovereignty” and “data concerns.” To the average citizen, rejecting such a massive sum during a health crisis seems [...]The post SHOCKING DNA details: What USA wanted from Zimbabweans and why Mnangagwa refused a US$367 million dangerous deal first appeared on My Zimbabwe News.", "url": "https://www.myzimbabwe.co.zw/news/186025-shocking-dna-details-what-usa-wanted-from-zimbabweans-and-why-mnangagwa-refused-a-us367-million-dangerous-deal.html", "image": "https://www.myzimbabwe.co.zw/wp-content/uploads/2024/08/mnangagwa-national-sports-speech.jpg", "publishedAt": "2026-02-26 12:34:05", "source": "My Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Zambia emulates Zimbabwe, pushed back on US health funding deal", "description": "Zambia has pushed back on part of a deal worth more than $1 billion in global health aid from the United States because it does not align with the country’s interests, the government said on Wednesday, as health advocates warned the deal links the money to mining access and has data-sharing risks. The deal governs [...]The post Zambia emulates Zimbabwe, pushed back on US health funding deal appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/zambia-emulates-zimbabwe-pushed-back-on-us-health-funding-deal/", "image": "https://thezimbabwemail.com/wp-content/uploads/2025/11/Zimbabwean-President-Mnangagwa-and-Zambia-President-Hakainde-Hichilema.jpeg", "publishedAt": "2026-02-26 12:27:43", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}]}