{"articles": [{"title": "Zimbabwean breakout at T20 World Cup has fans rejoicing renaissance", "description": "Swelling fanbase has been in dreamland this past month as Zimbabwe have defied all expectations in the competition", "url": "https://www.theguardian.com/sport/2026/feb/25/zimbabwe-breakout-cricket-world-cup-supporters-rejoicing-renaissance", "image": "https://media.guim.co.uk/57170b6bfd404a0e029eb92825e336f3452038e3/183_0_1827_1462/500.jpg", "publishedAt": "2026-02-25T10:05:15Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "Zimbabwe rejects 'lopsided' US health aid deal over data concerns", "description": "Access to biological samples raised flags for Zimbabwe as the US did not want to share the benefits of its research.", "url": "https://www.bbc.com/news/articles/cwy6nd3664no", "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6ada/live/d161dbc0-1249-11f1-b048-c9424b2cf5fd.jpg", "publishedAt": "2026-02-25 13:39:40", "source": "The Bbc", "_source_api": "Newsdata.io"}, {"title": "South African army men recover two vehicles being smuggled in flooded Limpopo River into Zimbabwe", "description": "Thupeyo Muleya South African National Defence Force members deployed to patrol the border with Zimbabwe have recovered a Toyota Land Cruiser worth around R1,5 million that was being smuggled out...The post South African army men recover two vehicles being smuggled in flooded Limpopo River into Zimbabwe appeared first on herald.", "url": "https://www.heraldonline.co.zw/south-african-army-men-recover-two-vehicles-being-smuggled-in-flooded-limpopo-river-into-zimbabwe/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/sites/2/2020/08/South-African-Flag.jpg", "publishedAt": "2026-02-24 15:42:36", "source": "The Herald", "_source_api": "Newsdata.io"}], "more": [{"title": "How the Skeleton of Mutapa Times is Based on Sarah Charlesworth's Work", "description": "Conceptual artist Sarah Charlesworth's 1979 study of how newspapers covered a solar eclipse inspired the framework behind The Mutapa Times.", "url": "article.html?slug=2020-04-20-how-the-skeleton-of-mutapa-times-is-based-on-sarah-charlesworths-work", "image": "/img/uploads/imageedit_1_5381951801.jpg", "publishedAt": "2020-04-20T00:00:00.000Z", "source": "The Mutapa Times", "cms": true}, {"title": "RBZ presents 2026 monetary policy statement this Friday", "description": "Source: RBZ presents 2026 monetary policy statement this Friday – herald Business Reporter Business leaders and financial markets have their gaze fixed on the Reserve Bank of Zimbabwe’s 2026 Monetary Policy Statement presentation scheduled for Friday, with expectations centred on", "url": "article.html?slug=2026-02-23-rbz-presents-2026-monetary-policy-statement-this-friday", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/RBZ.jpg", "publishedAt": "2026-02-23T23:28:00", "source": "The Mutapa Times", "cms": true}, {"title": "Robert Mugabe’s son charged with attempted murder over Johannesburg shooting", "description": "Bellarmine Chatunga Mugabe, known for lavish lifestyle, also accused of theft and being illegal immigrant after man allegedly shot in back", "url": "article.html?slug=2026-02-23-robert-mugabes-son-charged-with-attempted-murder-over-johann", "image": "https://media.guim.co.uk/a777e1c818970c0301f21b6c3d44c79e5163732c/99_0_3832_3066/500.jpg", "publishedAt": "2026-02-23T13:48:00", "source": "The Mutapa Times", "cms": true}, {"title": "Chinese and Indian car brands taking over dealerships across South Africa", "description": "CAPE TOWN – Super Group has reported a stronger interim performance, with its dealership operations benefiting from sustained demand for competitively priced vehicles from Chinese and Indian manufacturers — a shift carrying growing relevance for Zimbabwe and the broader regional automotive market. In interim results for the six months ended 31 December 2025, according to [...]The post Chinese and Indian car brands taking over dealerships across South Africa appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/chinese-and-indian-car-brands-taking-over-dealerships-across-south-africa/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/02/Chinese-and-Indian-car-brands-taking-over-dealerships-across-South-Africa.webp", "publishedAt": "2026-02-25 16:43:45", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "Lock Brothers Bring Tourists to Harare", "description": "By Sports Reporter-One of Zimbabwe’s top tennis exports, Benjamin Lock, has pledged to bring his international tennis and golf associates to ... Continue reading \"Lock Brothers Bring Tourists to Harare\"", "url": "https://www.zimeye.net/2026/02/25/lock-brothers-bring-tourists-to-harare/", "image": "https://www.zimeye.net/wp-content/uploads/2026/02/54fe51de-0843-43ca-8b48-5678504d1028.png", "publishedAt": "2026-02-25 16:16:04", "source": "Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Mnangagwa Urges Allies to ‘Lead from the Front’ Amid Growing Economic Pressures", "description": "HARARE – President Emmerson Mnangagwa has called on members of the ruling ZANU PF Politburo to “lead from the front,” pressing senior party officials to drive implementation of Government programmes under the National Development Strategy 2 (NDS2). Addressing the party’s 390th Politburo Session at ZANU PF Headquarters in Harare on Thursday, Mnangagwa declared that the [...]The post Mnangagwa Urges Allies to ‘Lead from the Front’ Amid Growing Economic Pressures appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/mnangagwa-urges-allies-to-lead-from-the-front-amid-growing-economic-pressures/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/02/President-Mnangagwa.jpg", "publishedAt": "2026-02-25 16:11:17", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "ED Says 2026 Offers ‘Immense Opportunities’ for Economic Transformation", "description": "By Tinomudaishe Muzanenhamo President Emmerson Mnangagwa has said the country is entering a year of significant opportunity for economic growth and social transformation urging members of the ruling ZANU-PF to intensify efforts to drive development in line with the country’s Vision 2030 agenda. Addressing the [...]The post ED Says 2026 Offers ‘Immense Opportunities’ for Economic Transformation appeared first on 263Chat.", "url": "https://www.263chat.com/ed-says-2026-offers-immense-opportunities-for-economic-transformation/", "image": "https://www.263chat.com/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-25-at-5.18.32-PM-1024x682.jpeg", "publishedAt": "2026-02-25 15:38:20", "source": "263chat", "_source_api": "Newsdata.io"}, {"title": "Digital Fragmentation Is Becoming Zimbabwe’s Invisible Business Tax: Here’s How Smart Firms Are Responding", "description": "HARARE – Zimbabwean businesses have embraced digital tools with urgency. From CRMs to ERPs, accounting platforms to analytics dashboards, organisations are layering technology to improve efficiency, visibility, and control. Yet for many firms, the expected gains are colliding with an uncomfortable reality. More software does not always produce more performance. In fact, for a growing [...]The post Digital Fragmentation Is Becoming Zimbabwe’s Invisible Business Tax: Here’s How Smart Firms Are Responding appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/digital-fragmentation-is-becoming-zimbabwes-invisible-business-tax-heres-how-smart-firms-are-responding/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/02/Digital-AI.jpg", "publishedAt": "2026-02-25 15:36:42", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "India vs Zimbabwe, T20WC2026 Super 8 Preview: Defending champions cannot afford another slip", "description": "A preview of of a knife-edge moment for Zimbabwe and India in the T20 World Cup 2026The post India vs Zimbabwe, T20WC2026 Super 8 Preview: Defending champions cannot afford another slip first appeared on Three Men On a Boat.", "url": "https://3-mob.com/sport/india-vs-zimbabwe-t20wc2026-super-8-preview-defending-champions-cannot-afford-another-slip/", "image": "https://3-mob.com/wp-content/uploads/2026/02/Zimbabwe-Cricket-T20-PIC-ICC-Getty-Images.jpeg", "publishedAt": "2026-02-25 15:14:52", "source": "Three Men On Boat", "_source_api": "Newsdata.io"}, {"title": "Cartel violence fuels doubts about FIFA World Cup games in Mexico", "description": "GUADALAJARA, Mexico — Hugo Alejandro Pérez was in his house a few miles from the Mexican stadium that is slated to host FIFA World Cup games when gunfire and explosions erupted just outside his door. The 53-year-old restaurant owner was already skeptical about his city, Guadalajara, hosting the international sporting event. He saw a government [...]The post Cartel violence fuels doubts about FIFA World Cup games in Mexico appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/cartel-violence-fuels-doubts-about-fifa-world-cup-games-in-mexico/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/02/Cartel-violence-fuels-doubts-about-FIFA-World-Cup-games-in-Mexico.webp", "publishedAt": "2026-02-25 14:48:51", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "HIV Groups Fear Treatment Disruptions After US Health Funding Talks Collapse", "description": "By Kudzaishe Chimonera Local organisations representing people living with HIV have warned that the collapse of negotiations over a major United States-funded health agreement could threaten access to life-saving treatment and reverse progress made in the country’s HIV response. The Zimbabwe National Network of People [...]The post HIV Groups Fear Treatment Disruptions After US Health Funding Talks Collapse appeared first on 263Chat.", "url": "https://www.263chat.com/hiv-groups-fear-treatment-disruptions-after-us-health-funding-talks-collapse/", "image": "https://www.263chat.com/wp-content/uploads/2026/02/image-52.png", "publishedAt": "2026-02-25 14:34:47", "source": "263chat", "_source_api": "Newsdata.io"}, {"title": "Zimbabwe Halts Lithium Concentrate Exports as Government Tightens Mineral Controls", "description": "Zimbabwe Halts Lithium Concentrate Exports as Government Tightens Mineral Controls The Government has announced an immediate suspension of all lithium concentrate and raw mineral exports, tightening control over one of the country’s most strategic resources. Confirming the development, Mines and Mining Development Minister Polite Kambamura said the directive takes effect immediately and will remain in [...]The post Zimbabwe Halts Lithium Concentrate Exports as Government Tightens Mineral Controls appeared first on iHarare News.", "url": "https://iharare.com/zimbabwe-halts-lithium-concentrate-exports-as-government-tightens-mineral-controls/", "image": "", "publishedAt": "2026-02-25 14:00:59", "source": "Iharare News", "_source_api": "Newsdata.io"}, {"title": "Top Zimbabwe tennis duo the Lock brothers to bring tourists to Harare", "description": "HARARE - One of the Lock brothers, Benjamin is excited with developments at The Hills Luxury Golf Estate to the extent he has committed to bringing his tennis and golf friends to Harare to experience the city’s developing golf estate.The post Top Zimbabwe tennis duo the Lock brothers to bring tourists to Harare appeared first on Nehanda Radio.", "url": "https://nehandaradio.com/2026/02/25/top-zimbabwe-tennis-duo-the-lock-brothers-to-bring-tourists-to-harare/", "image": "https://nehandaradio.com/wp-content/uploads/2026/02/Benjamin-Lock-and-Michael-Chideme-at-The-Hills-Golf-Estate.webp", "publishedAt": "2026-02-25 13:30:01", "source": "Nehanda Radio", "_source_api": "Newsdata.io"}, {"title": "Interpol veteran calls for regional crackdown on Zimbabwe’s high-flying Chivayo family", "description": "SOUTH Africa’s retired Interpol ambassador and security strategist, Andy Mashaile has called for a regional law enforcement crackdown following the issuance of a warrant of arrest for high-profile Zimbabwean socialite and Zanu PF deputy secretary for information and publicity in Harare province, Joachim Chivayo, also known as G6. Earlier this week, IOL reported that the [...]The post Interpol veteran calls for regional crackdown on Zimbabwe’s high-flying Chivayo family appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/sa-interpol-veteran-calls-for-regional-crackdown-on-zimbabwes-high-flying-chivayo-family/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/02/Wicknell-and-Joachim-Chivayo.jpg", "publishedAt": "2026-02-25 13:29:28", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "Rick Ross, Omah Lay to headline ‘Hustle and Heritage’ in Zimbabwe", "description": "Zimbabwean music fans are gearing up for a star-studded weekend as Rick Ross and Omah Lay are set to arrive in the country on Friday ahead of the highly anticipated show, Hustle and Heritage. The international stars will share the stage with top local acts including “,”zimbabwe singer”], Freeman EXQ”], Takuraimbabwe singer”], ashl”,”zimbabwe singer”], Tamy [...]The post Rick Ross, Omah Lay to headline ‘Hustle and Heritage’ in Zimbabwe appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/rick-ross-omah-lay-to-headline-hustle-and-heritage-in-zimbabwe/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/01/Rick-Ross.jpg", "publishedAt": "2026-02-25 13:18:09", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "$TRONG WARNING to car owners as ZRP launches Zimbabwe’s most aggressive ‘NO MERCY’ traffic blitz, even fellow police officers are being FINED!", "description": "HARARE – Before the morning sun has barely cleared the horizon over the capital, for the thousands of motorists navigating the potholed arteries of Harare, the day would have already descended into a tactical battle for survival. The streets of Zimbabwe’s largest city have become a “war zone” as the Zimbabwe Republic Police (ZRP) launches [...]The post $TRONG WARNING to car owners as ZRP launches Zimbabwe’s most aggressive ‘NO MERCY’ traffic blitz, even fellow police officers are being FINED! first appeared on My Zimbabwe News.", "url": "https://www.myzimbabwe.co.zw/news/186011-trong-warning-to-car-owners-as-zrp-launches-zimbabwes-most-aggressive-no-mercy-traffic-blitz-even-fellow-police-officers-are-being-fined.html", "image": "https://www.myzimbabwe.co.zw/wp-content/uploads/2024/08/impounded-vehicles-zrp-police-zinara-vid.webp", "publishedAt": "2026-02-25 12:53:42", "source": "My Zimbabwe News", "_source_api": "Newsdata.io"}, {"title": "Public Health Doctors Call for Dialogue After Zimbabwe–US Health Funding Talks Stall", "description": "HARARE – The Zimbabwe College of Public Health Physicians (ZCPHP) has called for renewed dialogue following the breakdown of negotiations between Zimbabwe and the United States over a proposed health funding Memorandum of Understanding (MoU). In a statement, the association of public health doctors cautioned that abrupt financing shifts could destabilise essential health programmes, particularly [...]The post Public Health Doctors Call for Dialogue After Zimbabwe–US Health Funding Talks Stall appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/public-health-doctors-call-for-dialogue-after-zimbabwe-us-health-funding-talks-stall/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/02/Doctor.png", "publishedAt": "2026-02-25 12:32:21", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "Mnangagwa Blocks US Health Funding, Citing Threats to Sovereignty", "description": "Tinashe Sambiri– Zimbabwe has officially rejected a proposed health funding agreement from the United States, with President Emmerson Mnangagwa directing ... Continue reading \"Mnangagwa Blocks US Health Funding, Citing Threats to Sovereignty\"", "url": "https://www.zimeye.net/2026/02/25/mnangagwa-blocks-us-health-funding-citing-threats-to-sovereignty/", "image": "https://www.zimeye.net/wp-content/uploads/2026/02/IMG_20260223_055404.jpg", "publishedAt": "2026-02-25 12:30:00", "source": "Zimbabwe News", "_source_api": "Newsdata.io"}]}