{"articles": [{"title": "Rising anger over ‘lop-sided’ and ‘immoral’ US health funding pacts with African countries", "description": "Zimbabwe refuses to sign agreement and Kenya faces a court case over data sharing as new aid deals come under scrutiny", "url": "https://www.theguardian.com/global-development/2026/feb/27/rising-anger-over-lop-sided-immoral-us-health-funding-pacts-africa-countries", "image": "https://media.guim.co.uk/052f71618f81a5e32d654d7d911f9002cd98f9e0/967_502_3452_2762/500.jpg", "publishedAt": "2026-02-27T07:00:34Z", "source": "The Guardian", "_source_api": "Guardian"}, {"title": "Duty comes first: President", "description": "Zvamaida Murwira Senior Reporter MILITARY service will always come first over one’s personal interests, because a soldier must be ready to defend the country’s territorial integrity and hard-won independence, President...The post Duty comes first: President appeared first on herald.", "url": "https://www.heraldonline.co.zw/duty-comes-first-president/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/02/PP1.jpg", "publishedAt": "2026-02-27 22:10:42", "source": "The Herald", "_source_api": "Newsdata.io"}, {"title": "RBZ announces measures to boost ZiG, price stability", "description": "Senior Business Reporter THE Reserve Bank of Zimbabwe has announced several key monetary policy interventions, including slashing many bank charges and refining the foreign exchange trading regime as part of...The post RBZ announces measures to boost ZiG, price stability appeared first on herald.", "url": "https://www.heraldonline.co.zw/rbz-announces-measures-to-boost-zig-price-stability/", "image": "https://www.heraldonline.co.zw/wp-content/uploads/2026/02/JM1.jpg", "publishedAt": "2026-02-27 22:09:37", "source": "The Herald", "_source_api": "Newsdata.io"}], "more": [{"title": "How the Skeleton of Mutapa Times is Based on Sarah Charlesworth's Work", "description": "Conceptual artist Sarah Charlesworth's 1979 study of how newspapers covered a solar eclipse inspired the framework behind The Mutapa Times.", "url": "article.html?slug=2020-04-20-how-the-skeleton-of-mutapa-times-is-based-on-sarah-charlesworths-work", "image": "/img/uploads/imageedit_1_5381951801.jpg", "publishedAt": "2020-04-20T00:00:00.000Z", "source": "The Mutapa Times", "cms": true}, {"title": "Castle Lager Premiership", "description": "Zimbabwe Premier Soccer League season 2025/26 : Find Fixtures, results, latest table, statistics and Latest news all hereThe post Castle Lager Premiership appeared first on Soccer24.", "url": "https://www.soccer24.co.zw/2026/02/28/castle-lager-premiership/", "image": "", "publishedAt": "2026-02-28 00:32:30", "source": "Soccer24", "_source_api": "Newsdata.io"}, {"title": "Higher, upgraded ZiG notes laid out", "description": "THE Reserve Bank of Zimbabwe (RBZ) has unveiled its new and upgraded ZiG notes, as it strives to improve cash availability in... To access this content, please purchase a subscription by clicking the button below and select a package of your choice!Subscriptions", "url": "https://dailynews.co.zw/higher-upgraded-zig-notes-laid-out/", "image": "", "publishedAt": "2026-02-28 00:00:00", "source": "Dailynews", "_source_api": "Newsdata.io"}, {"title": "TIMB projects 400 million kg tobacco crop", "description": "ZIMBABWE expects tobacco deliveries to reach 400 million kilogrammes this season as auction floors prepare to open next week.The Tobacco Industry and... To access this content, please purchase a subscription by clicking the button below and select a package of your choice!Subscriptions", "url": "https://dailynews.co.zw/timb-projects-400-million-kg-tobacco-crop/", "image": "", "publishedAt": "2026-02-28 00:00:00", "source": "Dailynews", "_source_api": "Newsdata.io"}, {"title": "Econet shareholders approve ZSE exit", "description": "MINORITY shareholders of Econet Wireless Zimbabwe Limited, both institutional and retail, on Thursday voted overwhelmingly to approve the group’s voluntary delisting from... To access this content, please purchase a subscription by clicking the button below and select a package of your choice!Subscriptions", "url": "https://dailynews.co.zw/econet-shareholders-approve-zse-exit/", "image": "", "publishedAt": "2026-02-28 00:00:00", "source": "Dailynews", "_source_api": "Newsdata.io"}, {"title": "First Capital Bank dominates regional stage", "description": "FIRST Capital Bank Limited recently showcased its financial prowess at the 2026 Mining Indaba in Cape Town, South Africa.The bank, representing Zimbabwe... To access this content, please purchase a subscription by clicking the button below and select a package of your choice!Subscriptions", "url": "https://dailynews.co.zw/first-capital-bank-dominates-regional-stage/", "image": "", "publishedAt": "2026-02-27 23:59:00", "source": "Dailynews", "_source_api": "Newsdata.io"}, {"title": "China pledges support for women empowerment", "description": "CHINA has reaffirmed its commitment to advancing women’s empowerment and development in Zimbabwe, pledging continued cooperation in skills development, health support and...", "url": "https://dailynews.co.zw/china-pledges-support-for-women-empowerment/", "image": "", "publishedAt": "2026-02-27 23:56:00", "source": "Dailynews", "_source_api": "Newsdata.io"}, {"title": "Trucks halted at Forbes after raw lithium export ban", "description": "FROM Wednesday, the Government enforced the suspension on the export of raw lithium and other precious minerals, halting a large convoy of haulage trucks laden with the precious minerals at Forbes Border Post in Mutare, the gateway to the Indian Ocean. The decision by Government, announced by Mines and Mining Development Minister, Dr Polite Kambamura, [...]The post Trucks halted at Forbes after raw lithium export ban appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/trucks-halted-at-forbes-after-raw-lithium-export-ban/", "image": "https://thezimbabwemail.com/wp-content/uploads/2026/02/Polite-Kambamura-1.jpg", "publishedAt": "2026-02-27 22:52:47", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}, {"title": "Zimbabweans lured to Russia’s War: Inside the deceptive recruitment network drawing civilians to the frontlines", "description": "A growing network of recruiters operating in Zimbabwe and across southern Africa is drawing young men into Russia’s war in Ukraine through promises of civilian jobs and financial security, only for ‘many’ to find themselves on an active, deadly frontline war zone after minimal training.", "url": "https://www.thezimbabwean.co/2026/02/zimbabweans-lured-to-russias-war-inside-the-deceptive-recruitment-network-drawing-civilians-to-the-frontlines/", "image": "https://cite.org.zw/wp-content/uploads/2026/02/russia-war.jpeg", "publishedAt": "2026-02-27 21:10:19", "source": "The Zimbabwean", "_source_api": "Newsdata.io"}, {"title": "Why pretend to invite public views on proposed constitutional amendments when the same public is barred from discussing them?", "description": "Source: Why pretend to invite public views on proposed constitutional amendments when the same public is barred from discussing them? Why pretend to invite public views on proposed constitutional amendments when the same public is barred from discussing them? This is a cynical game of smoke and mirrors we have all become too familiar with. [...]The post Why pretend to invite public views on proposed constitutional amendments when the same public is barred from discussing them? appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/why-pretend-to-invite-public-views-on-proposed-constitutional-amendments-when-the-same-public-is-barred-from-discussing-them/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/watermarked-9d28ecb2-a37c-4f07-82dd-319b2a9f1294-17.jpg", "publishedAt": "2026-02-27 21:06:50", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Why are we no longer taking responsibility for our actions but choosing to blame others for the consequences?", "description": "Source: Why are we no longer taking responsibility for our actions but choosing to blame others for the consequences? The spectacle currently unfolding in a Los Angeles courtroom—where a twenty-year-old woman named Kaley G.M. sits as the face of a massive litigation effort against tech giants—is more than just a legal battle over algorithms. If [...]The post Why are we no longer taking responsibility for our actions but choosing to blame others for the consequences? appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/why-are-we-no-longer-taking-responsibility-for-our-actions-but-choosing-to-blame-others-for-the-consequences/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/file_000000008604722f8990ffbee81b35d8-19.png", "publishedAt": "2026-02-27 21:00:01", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "Church leaders condemn amendment bill as threat to constitutional integrity", "description": "Church leaders have declared their firm opposition to the proposed Constitution of Zimbabwe (Amendment) Bill No. 3 of 2026, warning that the changes would fundamentally alter the spirit of the country’s people-driven 2013 Constitution and risk concentrating power at the expense of citizens’ voices.", "url": "https://www.thezimbabwean.co/2026/02/church-leaders-condemn-amendment-bill-as-threat-to-constitutional-integrity/", "image": "https://cite.org.zw/wp-content/uploads/2021/06/MNANGAGWA.jpeg", "publishedAt": "2026-02-27 20:59:30", "source": "The Zimbabwean", "_source_api": "Newsdata.io"}, {"title": "BCC commissions $1m road equipment", "description": "Source: BCC commissions $1m road equipment – CITEZW The Bulawayo City Council (BCC) has commissioned road construction and maintenance equipment worth more than US$1m, in a move aimed at strengthening its ability to rehabilitate the city’s deteriorating road network using in-house teams. Speaking at the ceremony on Friday, Mayor David Coltart described the development as [...]The post BCC commissions $1m road equipment appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/bcc-commissions-1m-road-equipment/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/IMG_20260227_100605-1200x900-1.jpg", "publishedAt": "2026-02-27 20:55:39", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "RBZ Unveils New ZiG Banknotes To Circulate From 7 April", "description": "Source: RBZ Unveils New ZiG Banknotes To Circulate From 7 April ⋆ Pindula News The Reserve Bank of Zimbabwe (RBZ) has unveiled a new series of Zimbabwe Gold (ZiG) banknotes, set to enter circulation on 7 April 2026. The new notes will circulate alongside the existing series introduced in April 2024. Speaking during the 2026 [...]The post RBZ Unveils New ZiG Banknotes To Circulate From 7 April appeared first on Zimbabwe Situation.", "url": "https://www.zimbabwesituation.com/news/rbz-unveils-new-zig-banknotes-to-circulate-from-7-april/", "image": "https://www.zimbabwesituation.com/wp-content/uploads/2026/02/John-Mushayavanhu-New-ZiG-Banknotes.jpg", "publishedAt": "2026-02-27 20:52:55", "source": "Zimbabwe Situation", "_source_api": "Newsdata.io"}, {"title": "RBZ Orders Removal Of Account Balance Inquiry, Cash Deposit Charges", "description": "The Reserve Bank of Zimbabwe (RBZ) has taken steps to curb excessive cash withdrawal and point-of-sale (POS) charges imposed by financial institutions.", "url": "https://www.thezimbabwean.co/2026/02/rbz-orders-removal-of-account-balance-inquiry-cash-deposit-charges/", "image": "https://t792ae.c2.acecdn.net/wp-content/uploads/2021/04/EcoCash-Mobile-Phone.jpg", "publishedAt": "2026-02-27 20:50:12", "source": "The Zimbabwean", "_source_api": "Newsdata.io"}, {"title": "Constitution Amendment: Zimbabwe Churches Objects to Mnangagwa’s Power-Grab", "description": "HARARE – Zimbabwe’s leading Christian bodies have issued a strongly worded pastoral statement opposing the proposed Constitution of Zimbabwe Amendment (No. 3) Bill, 2026, warning that the changes threaten constitutional democracy and could reverse the gains of the 2013 people-driven Constitution. In a statement dated 27 February 2026, the Zimbabwe Heads of Christian Denominations (ZHOCD) [...]The post Constitution Amendment: Zimbabwe Churches Objects to Mnangagwa’s Power-Grab appeared first on The Zimbabwe Mail.", "url": "https://thezimbabwemail.com/constitution-amendment-zimbabwe-churches-objects-to-mnangagwas-power-grab/", "image": "https://thezimbabwemail.com/wp-content/uploads/2025/10/Mnangagwa-453.jpg", "publishedAt": "2026-02-27 18:28:12", "source": "The Zimbabwe Mail", "_source_api": "Newsdata.io"}]}